name: "12Net"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 12
input_dim: 12
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  blobs {
    data: -0.333312
    data: -0.190646
    data: -0.061314
    data: -0.083515
    data: 0.182096
    data: -0.007908
    data: -0.032630
    data: 0.244501
    data: 0.032021
    data: 0.049516
    data: -0.001247
    data: 0.053689
    data: 0.120642
    data: 0.099212
    data: 0.004690
    data: 0.138631
    data: 0.095032
    data: -0.149820
    data: 0.095626
    data: -0.073576
    data: -0.018200
    data: 0.308262
    data: 0.211772
    data: -0.327446
    data: -0.100169
    data: -0.214175
    data: -0.214595
    data: 0.005073
    data: -0.011632
    data: 0.027846
    data: -0.167302
    data: -0.191650
    data: 0.002877
    data: -0.000418
    data: 0.039358
    data: 0.095187
    data: 0.187952
    data: -0.100378
    data: -0.046924
    data: -0.104246
    data: -0.197507
    data: 0.109171
    data: 0.020570
    data: 0.091777
    data: 0.079419
    data: -0.323804
    data: -0.228339
    data: -0.041953
    data: -0.339086
    data: -0.304535
    data: -0.176263
    data: -0.098563
    data: -0.154168
    data: -0.086281
    data: 0.160979
    data: 0.212232
    data: 0.122046
    data: -0.000239
    data: -0.185280
    data: 0.064143
    data: 0.007729
    data: -0.222232
    data: 0.040780
    data: -0.012490
    data: 0.226636
    data: 0.000898
    data: 0.026294
    data: 0.204181
    data: 0.008436
    data: -0.114493
    data: 0.179514
    data: -0.004928
    data: 0.074571
    data: -0.079670
    data: 0.011882
    data: 0.043783
    data: -0.070642
    data: -0.114924
    data: 0.156720
    data: 0.005438
    data: -0.024964
    data: 0.012704
    data: -0.024697
    data: -0.446626
    data: -0.055402
    data: 0.312855
    data: -0.029195
    data: -0.130864
    data: 0.215315
    data: -0.057866
    data: -0.035436
    data: 0.301162
    data: 0.255723
    data: 0.086265
    data: 0.353546
    data: 0.219528
    data: 0.324453
    data: 0.320000
    data: 0.199121
    data: 0.015621
    data: -0.272947
    data: 0.206879
    data: -0.019467
    data: -0.651601
    data: -0.164709
    data: -0.159951
    data: -0.521535
    data: -0.110682
    data: 0.119151
    data: -0.200748
    data: 0.101013
    data: 0.006292
    data: -0.087451
    data: -0.018910
    data: 0.002291
    data: -0.053574
    data: -0.276749
    data: 0.151465
    data: -0.080984
    data: 0.233911
    data: -0.057188
    data: -0.036643
    data: 0.149891
    data: -0.257632
    data: 0.054151
    data: -0.089660
    data: 0.000501
    data: -0.319016
    data: 0.259018
    data: -0.120644
    data: -0.066059
    data: 0.000727
    data: -0.083336
    data: -0.068999
    data: 0.255393
    data: 0.402003
    data: -0.036783
    data: 0.213620
    data: -0.195683
    data: -0.057380
    data: -0.233829
    data: 0.191153
    data: -0.316665
    data: -0.032488
    data: 0.289317
    data: -0.085375
    data: 0.152633
    data: -0.400337
    data: 0.077696
    data: 0.082112
    data: 0.110053
    data: -0.037624
    data: 0.042538
    data: -0.100039
    data: -0.184540
    data: -0.065849
    data: -0.163351
    data: 0.099287
    data: -0.100688
    data: 0.291387
    data: 0.114752
    data: 0.307348
    data: -0.030845
    data: 0.195778
    data: -0.178173
    data: 0.182821
    data: 0.191882
    data: -0.241656
    data: 0.012830
    data: -0.127485
    data: -0.160405
    data: -0.122822
    data: 0.246802
    data: -0.200206
    data: 0.094856
    data: 0.101494
    data: -0.159036
    data: 0.180705
    data: 0.077760
    data: -0.071584
    data: 0.171267
    data: 0.222000
    data: -0.261198
    data: -0.022802
    data: 0.173733
    data: -0.266495
    data: -0.009933
    data: 0.073870
    data: -0.124139
    data: -0.184681
    data: 0.345077
    data: -0.070847
    data: -0.048221
    data: 0.230779
    data: 0.075562
    data: 0.102410
    data: 0.252289
    data: 0.170011
    data: -0.191753
    data: 0.223579
    data: -0.117760
    data: -0.386781
    data: -0.128683
    data: -0.347417
    data: -0.185617
    data: -0.229975
    data: -0.253517
    data: -0.151519
    data: 0.340378
    data: -0.263732
    data: 0.091410
    data: 0.196094
    data: 0.157404
    data: -0.124568
    data: 0.099942
    data: -0.003787
    data: -0.207973
    data: -0.284611
    data: -0.086591
    data: 0.209344
    data: -0.020959
    data: -0.167925
    data: 0.087140
    data: 0.299391
    data: 0.113800
    data: 0.070424
    data: 0.012546
    data: -0.344429
    data: 0.192723
    data: 0.099947
    data: -0.129932
    data: 0.218501
    data: -0.058829
    data: -0.039385
    data: 0.069418
    data: -0.470136
    data: -0.358079
    data: 0.224309
    data: 0.057482
    data: -0.202554
    data: 0.123137
    data: 0.470826
    data: 0.083547
    data: -0.084062
    data: -0.087201
    data: 0.065940
    data: 0.095403
    data: 0.115730
    data: 0.031024
    data: 0.096205
    data: 0.259520
    data: -0.068633
    data: -0.204776
    data: -0.041525
    data: 0.142714
    data: -0.190185
    data: 0.018511
    data: 0.134411
    data: -0.068153
    data: -0.045131
    data: 0.143041
    data: -0.120692
    data: 0.207783
    data: 0.100984
    data: 0.108653
    data: 0.285672
    data: 0.217353
    data: 0.211366
    data: 0.184325
    data: 0.098783
    shape {
      dim: 10
      dim: 3
      dim: 3
      dim: 3
    }
  }
  blobs {
    data: -0.09853255
    data: 0.22800057
    data: 0.63386965
    data: 0.42186368
    data: -0.17767702
    data: 0.28392881
    data: -0.00806611
    data: -0.29639107
    data: -0.04033116
    data: 0.03156535
    shape {
      dim: 10
    }
  }
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 10
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "PReLU1"
  type: "PReLU"
  bottom: "conv1"
  top: "conv1"
  blobs {
    data: -0.09882698
    data: 0.93231511
    data: 0.29605904
    data: 0.31168345
    data: 0.31492367
    data: 0.24214387
    data: 0.21270956
    data: 0.43111879
    data: 0.19570042
    data: 0.94165695
    shape {
      dim: 10
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  blobs {
    data: -0.153722
    data: -0.021419
    data: 0.088374
    data: 0.046282
    data: -0.016768
    data: -0.122733
    data: 0.149897
    data: 0.053362
    data: -0.031095
    data: 0.001750
    data: 0.108942
    data: 0.031382
    data: -0.034138
    data: -0.040256
    data: -0.119509
    data: -0.001280
    data: -0.014173
    data: -0.030400
    data: 0.063665
    data: 0.001603
    data: -0.182927
    data: 0.076041
    data: 0.032378
    data: -0.077485
    data: 0.086707
    data: -0.035164
    data: 0.126023
    data: -0.085801
    data: 0.081928
    data: 0.099082
    data: 0.090707
    data: -0.081416
    data: 0.033401
    data: 0.144618
    data: -0.032934
    data: -0.058208
    data: 0.073109
    data: 0.000740
    data: 0.039311
    data: -0.024472
    data: -0.027105
    data: -0.052859
    data: 0.025561
    data: -0.021427
    data: -0.100972
    data: -0.112283
    data: -0.006248
    data: 0.071362
    data: -0.107973
    data: -0.004550
    data: 0.112981
    data: 0.033036
    data: 0.111111
    data: -0.083130
    data: 0.110783
    data: -0.061241
    data: 0.078776
    data: -0.049749
    data: 0.066884
    data: 0.070768
    data: -0.089689
    data: -0.043869
    data: -0.082903
    data: 0.118130
    data: 0.048056
    data: -0.037858
    data: 0.051895
    data: -0.020330
    data: -0.088557
    data: 0.113053
    data: -0.145098
    data: 0.093613
    data: 0.057125
    data: 0.072327
    data: 0.015337
    data: -0.006802
    data: -0.200061
    data: -0.073768
    data: 0.120773
    data: -0.068030
    data: -0.107243
    data: -0.075397
    data: 0.043564
    data: 0.091043
    data: 0.093680
    data: 0.057193
    data: -0.073068
    data: -0.017803
    data: -0.128371
    data: -0.131931
    data: -0.020310
    data: 0.121889
    data: 0.083098
    data: 0.075320
    data: 0.053666
    data: 0.135531
    data: -0.003830
    data: -0.153901
    data: 0.047674
    data: -0.000434
    data: 0.048308
    data: 0.172655
    data: 0.043561
    data: -0.075289
    data: 0.085118
    data: -0.239011
    data: -0.219494
    data: -0.138509
    data: -0.042902
    data: -0.153315
    data: 0.038809
    data: 0.073573
    data: 0.085163
    data: -0.094371
    data: 0.159806
    data: 0.136148
    data: -0.055827
    data: -0.270460
    data: -0.043285
    data: -0.121806
    data: 0.006153
    data: 0.118431
    data: 0.037373
    data: -0.158321
    data: 0.071023
    data: 0.000820
    data: -0.072299
    data: -0.049972
    data: 0.114971
    data: -0.073901
    data: 0.017587
    data: 0.020037
    data: -0.013533
    data: -0.146185
    data: -0.145680
    data: 0.083457
    data: -0.102461
    data: 0.102561
    data: 0.134753
    data: -0.131992
    data: -0.014366
    data: 0.200458
    data: -0.035153
    data: 0.096653
    data: -0.101418
    data: 0.162209
    data: 0.009211
    data: -0.246612
    data: -0.000944
    data: -0.143062
    data: -0.058880
    data: 0.021638
    data: 0.092673
    data: 0.141807
    data: 0.081150
    data: 0.047824
    data: -0.113367
    data: -0.199922
    data: 0.054180
    data: -0.149273
    data: -0.084966
    data: -0.095604
    data: -0.136803
    data: -0.099254
    data: 0.001347
    data: -0.200604
    data: -0.179203
    data: -0.037387
    data: -0.266298
    data: -0.170316
    data: -0.032403
    data: -0.195622
    data: -0.180457
    data: -0.094677
    data: -0.142137
    data: -0.039445
    data: -0.193257
    data: 0.226227
    data: 0.155365
    data: -0.092357
    data: 0.069811
    data: -0.069440
    data: -0.022021
    data: -0.094158
    data: 0.066917
    data: 0.016792
    data: 0.093914
    data: 0.157497
    data: 0.026615
    data: -0.315419
    data: 0.146098
    data: -0.152912
    data: -0.181581
    data: 0.100370
    data: -0.211754
    data: 0.049813
    data: 0.203891
    data: -0.169671
    data: -0.169814
    data: -0.089221
    data: -0.208105
    data: 0.160114
    data: 0.066280
    data: 0.004004
    data: 0.088188
    data: 0.264774
    data: 0.170510
    data: -0.072098
    data: 0.013322
    data: -0.339276
    data: -0.080212
    data: 0.260372
    data: -0.062342
    data: -0.089306
    data: 0.282645
    data: -0.088341
    data: -0.068150
    data: 0.172657
    data: -0.003584
    data: -0.062460
    data: 0.001266
    data: 0.022018
    data: -0.059530
    data: -0.077798
    data: 0.011917
    data: 0.085738
    data: 0.052121
    data: 0.094300
    data: -0.038568
    data: 0.093982
    data: 0.069815
    data: 0.106045
    data: 0.082794
    data: 0.216281
    data: 0.088533
    data: 0.001365
    data: -0.161269
    data: 0.099137
    data: 0.193308
    data: -0.210498
    data: 0.076154
    data: 0.040638
    data: 0.029769
    data: -0.018142
    data: 0.158445
    data: -0.010682
    data: -0.012172
    data: -0.020125
    data: 0.095826
    data: -0.047368
    data: -0.039239
    data: -0.039260
    data: -0.211428
    data: -0.173927
    data: -0.455072
    data: -0.194253
    data: -0.047760
    data: -0.139684
    data: -0.133270
    data: 0.085730
    data: 0.006992
    data: -0.154865
    data: -0.153886
    data: -0.116436
    data: -0.107978
    data: -0.153558
    data: -0.107928
    data: 0.000330
    data: -0.006627
    data: -0.097326
    data: 0.025461
    data: 0.053604
    data: 0.155767
    data: -0.003488
    data: -0.086708
    data: 0.153297
    data: 0.019222
    data: 0.027756
    data: -0.060193
    data: 0.026466
    data: -0.026733
    data: 0.128742
    data: -0.044128
    data: 0.095857
    data: 0.157808
    data: 0.109014
    data: 0.037504
    data: -0.083344
    data: 0.149976
    data: 0.126101
    data: 0.199262
    data: 0.148655
    data: -0.003775
    data: 0.110096
    data: -0.105609
    data: -0.071654
    data: 0.149534
    data: -0.084180
    data: -0.085440
    data: 0.061875
    data: -0.043765
    data: 0.034466
    data: 0.049251
    data: -0.018256
    data: -0.157043
    data: -0.004751
    data: 0.046952
    data: 0.025980
    data: -0.067492
    data: -0.053203
    data: 0.036500
    data: 0.000939
    data: -0.048321
    data: -0.110155
    data: 0.108524
    data: 0.048711
    data: -0.151042
    data: -0.085476
    data: 0.051740
    data: -0.006185
    data: 0.104909
    data: -0.011861
    data: 0.150843
    data: 0.159206
    data: 0.005576
    data: -0.070054
    data: -0.066198
    data: -0.037424
    data: -0.042171
    data: 0.004792
    data: 0.101922
    data: -0.047723
    data: -0.011186
    data: -0.084228
    data: -0.205474
    data: -0.031531
    data: -0.063049
    data: 0.104423
    data: 0.084734
    data: 0.090438
    data: 0.172025
    data: 0.044905
    data: -0.090116
    data: 0.011985
    data: 0.078092
    data: -0.108576
    data: 0.063780
    data: -0.062237
    data: -0.039280
    data: 0.077576
    data: 0.103447
    data: 0.060067
    data: -0.043714
    data: -0.027057
    data: 0.041069
    data: 0.075446
    data: 0.059380
    data: 0.036583
    data: 0.016347
    data: -0.139145
    data: 0.015658
    data: 0.068827
    data: 0.033137
    data: -0.025759
    data: 0.034020
    data: 0.037342
    data: 0.038663
    data: 0.069195
    data: -0.040966
    data: -0.001983
    data: 0.164911
    data: -0.023913
    data: 0.061543
    data: 0.177891
    data: -0.170224
    data: -0.059337
    data: -0.077649
    data: -0.167286
    data: -0.165451
    data: -0.081347
    data: -0.243371
    data: 0.011267
    data: -0.076055
    data: 0.173263
    data: -0.035949
    data: 0.197411
    data: -0.025232
    data: -0.056211
    data: 0.070580
    data: -0.208978
    data: 0.125745
    data: 0.226599
    data: 0.129792
    data: -0.182850
    data: -0.033921
    data: -0.061747
    data: 0.097368
    data: 0.008639
    data: -0.081436
    data: -0.072648
    data: 0.031931
    data: -0.127491
    data: 0.002156
    data: 0.056731
    data: 0.021603
    data: -0.028779
    data: -0.023439
    data: 0.033469
    data: 0.060605
    data: 0.140444
    data: 0.149715
    data: 0.112878
    data: 0.043874
    data: 0.024469
    data: 0.143633
    data: -0.059626
    data: -0.221576
    data: -0.113617
    data: -0.123206
    data: -0.247173
    data: 0.040625
    data: -0.069710
    data: -0.116214
    data: -0.051812
    data: -0.031436
    data: 0.079884
    data: -0.106468
    data: -0.131041
    data: -0.165427
    data: 0.129256
    data: 0.132491
    data: 0.127315
    data: 0.159170
    data: 0.094874
    data: -0.055048
    data: -0.044107
    data: 0.110382
    data: 0.044483
    data: -0.099846
    data: -0.037816
    data: 0.039147
    data: -0.032542
    data: -0.140484
    data: -0.160701
    data: -0.003477
    data: -0.065094
    data: -0.001479
    data: 0.175865
    data: 0.158322
    data: -0.049338
    data: 0.016012
    data: -0.048702
    data: -0.092501
    data: -0.107368
    data: -0.040379
    data: -0.096086
    data: -0.033836
    data: -0.057432
    data: -0.108647
    data: 0.269746
    data: 0.126054
    data: -0.253619
    data: 0.091134
    data: -0.070054
    data: -0.064239
    data: -0.092711
    data: 0.031135
    data: 0.104202
    data: -0.114591
    data: -0.123896
    data: -0.048139
    data: 0.087710
    data: 0.116731
    data: -0.090775
    data: 0.098675
    data: -0.008269
    data: 0.127477
    data: 0.078704
    data: -0.000784
    data: -0.021065
    data: -0.092746
    data: 0.080394
    data: -0.001261
    data: -0.051515
    data: 0.069347
    data: -0.057355
    data: 0.079296
    data: -0.023261
    data: -0.178543
    data: -0.009177
    data: 0.026401
    data: 0.070415
    data: -0.103779
    data: 0.102597
    data: -0.102063
    data: -0.107594
    data: -0.108791
    data: 0.096961
    data: -0.048813
    data: -0.033671
    data: -0.113030
    data: 0.047305
    data: 0.151722
    data: 0.043557
    data: -0.099143
    data: 0.093852
    data: 0.020476
    data: 0.050340
    data: 0.092709
    data: 0.022788
    data: 0.097776
    data: -0.004400
    data: 0.173057
    data: 0.041590
    data: 0.043656
    data: -0.048499
    data: -0.093091
    data: -0.022513
    data: -0.019344
    data: 0.166561
    data: 0.077817
    data: -0.027316
    data: -0.024632
    data: -0.212984
    data: -0.199439
    data: 0.050186
    data: -0.015155
    data: -0.167638
    data: -0.171739
    data: -0.027403
    data: -0.002857
    data: -0.050587
    data: 0.102598
    data: 0.034658
    data: -0.071515
    data: 0.041737
    data: -0.096270
    data: 0.126653
    data: 0.087488
    data: -0.095369
    data: 0.025416
    data: 0.125440
    data: 0.112474
    data: 0.076699
    data: 0.113486
    data: 0.107303
    data: 0.107559
    data: 0.081635
    data: -0.026984
    data: -0.120315
    data: -0.145697
    data: -0.062804
    data: 0.047121
    data: -0.127490
    data: -0.085734
    data: 0.138649
    data: 0.000780
    data: -0.082802
    data: -0.085398
    data: 0.046466
    data: 0.019271
    data: -0.041592
    data: -0.038272
    data: 0.220087
    data: -0.122542
    data: -0.148195
    data: 0.125249
    data: -0.072363
    data: 0.296757
    data: 0.173442
    data: -0.027441
    data: 0.206147
    data: -0.140414
    data: 0.111046
    data: 0.233312
    data: -0.150563
    data: 0.035435
    data: 0.244481
    data: 0.066662
    data: 0.080953
    data: 0.136278
    data: 0.143760
    data: 0.157352
    data: 0.096317
    data: 0.137145
    data: 0.201654
    data: 0.052817
    data: 0.037458
    data: -0.037433
    data: 0.058396
    data: 0.046317
    data: -0.001339
    data: -0.149915
    data: 0.144560
    data: -0.026511
    data: 0.196165
    data: -0.007700
    data: 0.035491
    data: -0.094256
    data: -0.087586
    data: -0.017380
    data: -0.069470
    data: -0.189986
    data: 0.171591
    data: 0.291909
    data: 0.282005
    data: -0.026208
    data: 0.095174
    data: 0.248830
    data: 0.233744
    data: 0.189212
    data: 0.152989
    data: 0.061555
    data: -0.054570
    data: -0.126949
    data: 0.034496
    data: -0.052285
    data: 0.160436
    data: 0.040504
    data: 0.024093
    data: 0.161960
    data: -0.191208
    data: -0.002596
    data: -0.079859
    data: 0.147427
    data: 0.099080
    data: 0.017182
    data: 0.028710
    data: -0.115382
    data: -0.129654
    data: 0.126287
    data: 0.006523
    data: -0.119376
    data: -0.079194
    data: 0.035077
    data: -0.027346
    data: 0.113882
    data: -0.118476
    data: -0.010103
    data: 0.114031
    data: -0.019128
    data: -0.090376
    data: 0.031090
    data: 0.037774
    data: 0.018091
    data: -0.015870
    data: -0.148645
    data: 0.092519
    data: -0.120388
    data: -0.110382
    data: -0.013730
    data: 0.132414
    data: 0.185576
    data: 0.089517
    data: 0.090001
    data: 0.124251
    data: 0.126988
    data: 0.002337
    data: 0.124972
    data: -0.158180
    data: -0.038207
    data: -0.148769
    data: -0.000109
    data: 0.064264
    data: 0.029663
    data: 0.067819
    data: 0.019897
    data: 0.078312
    data: -0.012334
    data: -0.038568
    data: -0.112909
    data: 0.119988
    data: 0.130956
    data: -0.087479
    data: 0.022988
    data: -0.063422
    data: 0.104750
    data: 0.046265
    data: -0.087695
    data: -0.025651
    data: 0.220481
    data: -0.187965
    data: -0.124777
    data: -0.026959
    data: 0.071990
    data: 0.153930
    data: 0.116682
    data: -0.130611
    data: 0.042638
    data: 0.042704
    data: -0.014204
    data: -0.056620
    data: 0.078050
    data: 0.118873
    data: 0.048218
    data: 0.112847
    data: -0.080756
    data: -0.027951
    data: 0.130511
    data: -0.092245
    data: -0.092342
    data: -0.073303
    data: 0.050395
    data: 0.105342
    data: -0.150979
    data: -0.012118
    data: -0.043793
    data: 0.017560
    data: 0.113528
    data: -0.084944
    data: 0.009837
    data: -0.179005
    data: -0.008723
    data: 0.033458
    data: 0.063223
    data: 0.041690
    data: -0.089223
    data: 0.064599
    data: -0.013329
    data: 0.018358
    data: -0.193152
    data: -0.068523
    data: -0.235919
    data: -0.056077
    data: -0.096181
    data: -0.250324
    data: -0.069979
    data: -0.032132
    data: 0.072016
    data: 0.236153
    data: 0.162761
    data: 0.098695
    data: -0.026659
    data: 0.086685
    data: 0.094837
    data: 0.015514
    data: 0.064018
    data: 0.062763
    data: 0.178231
    data: 0.167746
    data: 0.212134
    data: 0.160706
    data: -0.088995
    data: 0.041010
    data: 0.074478
    data: -0.025581
    data: 0.130799
    data: 0.032727
    data: -0.304177
    data: -0.269247
    data: -0.153675
    data: -0.252609
    data: -0.311729
    data: -0.039260
    data: -0.103411
    data: -0.271458
    data: -0.039651
    data: -0.008013
    data: -0.062725
    data: -0.166626
    data: -0.107806
    data: -0.108209
    data: 0.055951
    data: -0.145921
    data: -0.128775
    data: -0.053313
    data: -0.149954
    data: -0.105191
    data: -0.073251
    data: -0.005631
    data: -0.052091
    data: -0.229469
    data: -0.027911
    data: 0.103790
    data: 0.027544
    data: -0.108197
    data: -0.092205
    data: 0.065505
    data: -0.025451
    data: 0.063294
    data: -0.022061
    data: 0.013865
    data: -0.064091
    data: -0.122901
    data: -0.062981
    data: -0.120846
    data: -0.076548
    data: -0.060491
    data: 0.032859
    data: 0.120007
    data: -0.180105
    data: -0.031242
    data: -0.091894
    data: -0.036273
    data: 0.095379
    data: 0.025718
    data: 0.127398
    data: 0.099016
    data: 0.109918
    data: -0.011984
    data: -0.057322
    data: 0.166541
    data: 0.139940
    data: 0.037774
    data: -0.022418
    data: 0.101151
    data: 0.083067
    data: -0.117560
    data: 0.021316
    data: -0.015431
    data: 0.098724
    data: -0.107744
    data: -0.021480
    data: -0.127867
    data: -0.136177
    data: -0.008808
    data: 0.066393
    data: -0.083430
    data: 0.072883
    data: -0.219735
    data: -0.039348
    data: 0.108356
    data: -0.001001
    data: 0.036141
    data: 0.134290
    data: -0.048334
    data: -0.090824
    data: -0.116774
    data: 0.024399
    data: -0.024692
    data: 0.167687
    data: -0.036890
    data: -0.025586
    data: -0.046428
    data: 0.068387
    data: 0.078043
    data: -0.055702
    data: -0.093481
    data: -0.093017
    data: 0.024900
    data: -0.081304
    data: -0.030467
    data: 0.074613
    data: 0.041043
    data: -0.046665
    data: 0.041482
    data: -0.067967
    data: -0.055761
    data: -0.071599
    data: 0.028120
    data: 0.152575
    data: -0.109334
    data: -0.077861
    data: 0.067066
    data: -0.055895
    data: 0.091143
    data: 0.145197
    data: 0.022560
    data: -0.135933
    data: -0.014950
    data: 0.075192
    data: 0.049839
    data: -0.003938
    data: 0.051356
    data: -0.175020
    data: -0.022947
    data: 0.096495
    data: -0.147623
    data: -0.132890
    data: -0.136402
    data: 0.084866
    data: -0.075417
    data: -0.090291
    data: -0.185151
    data: -0.026145
    data: -0.023531
    data: -0.112446
    data: -0.070564
    data: 0.045718
    data: -0.130989
    data: 0.158728
    data: 0.115592
    data: 0.036130
    data: -0.010418
    data: 0.060302
    data: -0.104132
    data: -0.022634
    data: -0.018187
    data: -0.138649
    data: 0.043086
    data: 0.099124
    data: 0.002353
    data: -0.108538
    data: 0.047903
    data: -0.121865
    data: -0.034278
    data: -0.054025
    data: -0.010055
    data: -0.098091
    data: -0.083622
    data: 0.077086
    data: 0.045144
    data: -0.083475
    data: -0.077971
    data: 0.124564
    data: -0.022108
    data: 0.077194
    data: -0.056333
    data: 0.053424
    data: -0.043132
    data: -0.106292
    data: -0.103927
    data: 0.006293
    data: -0.098589
    data: -0.011148
    data: -0.055926
    data: -0.041615
    data: -0.113150
    data: 0.098736
    data: -0.130889
    data: 0.047807
    data: 0.007343
    data: 0.013211
    data: 0.103259
    data: 0.058525
    data: -0.045560
    data: -0.043637
    data: -0.050434
    data: -0.097472
    data: 0.061693
    data: 0.059028
    data: 0.063258
    data: 0.099829
    data: 0.001475
    data: -0.029570
    data: -0.118610
    data: -0.060641
    data: -0.073044
    data: 0.027479
    data: -0.046035
    data: 0.126022
    data: 0.051310
    data: 0.065483
    data: -0.103999
    data: -0.061861
    data: -0.091794
    data: -0.028657
    data: 0.102653
    data: -0.006759
    data: -0.144025
    data: -0.132822
    data: 0.104193
    data: -0.149671
    data: -0.064154
    data: 0.011130
    data: 0.002050
    data: -0.033509
    data: 0.088977
    data: -0.142806
    data: -0.134332
    data: -0.095361
    data: -0.089996
    data: 0.118455
    data: -0.051195
    data: -0.020178
    data: -0.038000
    data: -0.143182
    data: -0.075069
    data: -0.108634
    data: 0.047650
    data: 0.052286
    data: 0.040470
    data: 0.036707
    data: 0.100725
    data: 0.005551
    data: -0.083746
    data: -0.068747
    data: -0.095187
    data: 0.049010
    data: -0.015603
    data: 0.063269
    data: -0.115585
    data: -0.012809
    data: -0.125766
    data: 0.005572
    data: 0.121668
    data: -0.077081
    data: -0.105480
    data: 0.016273
    data: -0.127910
    data: -0.117969
    data: 0.009088
    data: -0.050690
    data: 0.106628
    data: -0.022050
    data: -0.035036
    data: 0.140504
    data: 0.115303
    data: -0.005170
    data: -0.155088
    data: 0.092589
    data: 0.051011
    data: 0.078671
    data: -0.043323
    data: -0.058188
    data: -0.015299
    data: -0.129605
    data: 0.089553
    data: -0.036884
    data: -0.006482
    data: 0.127569
    data: 0.124774
    data: -0.052916
    data: -0.133677
    data: -0.064170
    data: -0.086728
    data: 0.103438
    data: -0.023194
    data: -0.066675
    data: 0.003708
    data: 0.037132
    data: 0.082285
    data: -0.113389
    data: -0.060244
    data: -0.061142
    data: -0.061276
    data: 0.072226
    data: 0.108857
    data: -0.065282
    data: 0.108637
    data: -0.089025
    data: -0.036307
    data: -0.150371
    data: -0.102756
    data: -0.054455
    data: 0.086788
    data: 0.041067
    data: -0.072096
    data: -0.066446
    data: -0.105246
    data: 0.083022
    data: 0.132873
    data: -0.116886
    data: 0.025543
    data: -0.017848
    data: -0.055442
    data: -0.044423
    data: 0.113819
    data: -0.117965
    data: 0.073326
    data: -0.051648
    data: -0.033803
    data: -0.024345
    data: 0.090939
    data: 0.104132
    data: 0.000351
    data: -0.065697
    data: -0.090369
    data: -0.066363
    data: 0.095014
    data: -0.137681
    data: 0.007208
    data: -0.095768
    data: 0.073202
    data: 0.062078
    data: -0.042365
    data: -0.098696
    data: -0.101296
    data: -0.121323
    data: -0.097108
    data: -0.137968
    data: 0.115066
    data: 0.096192
    data: -0.041414
    data: 0.002616
    data: -0.025965
    data: 0.036090
    data: -0.125644
    data: -0.121215
    data: 0.042930
    data: 0.128531
    data: -0.048705
    data: 0.032262
    data: -0.076285
    data: -0.057100
    data: -0.047346
    data: -0.101525
    data: -0.063120
    data: -0.119237
    data: -0.030891
    data: -0.046997
    data: -0.122123
    data: -0.098550
    data: -0.033828
    data: 0.075904
    data: 0.064348
    data: -0.036158
    data: -0.098789
    data: 0.087668
    data: -0.125095
    data: 0.011261
    data: 0.057761
    data: 0.073716
    data: -0.118752
    data: 0.023747
    data: 0.044181
    data: -0.130764
    data: -0.091101
    data: -0.024437
    data: 0.051397
    data: -0.033013
    data: 0.026997
    data: -0.051997
    data: 0.130408
    data: -0.048042
    data: -0.102396
    data: -0.074399
    data: -0.022433
    data: -0.131869
    data: -0.027886
    data: -0.150200
    data: 0.062249
    data: 0.099749
    data: -0.117532
    data: 0.038381
    data: -0.010199
    data: -0.077658
    data: 0.046480
    data: 0.005477
    data: 0.003965
    data: -0.098620
    data: -0.021967
    data: -0.007054
    data: -0.159617
    data: 0.009273
    data: 0.004339
    data: -0.134704
    data: -0.088008
    data: -0.060131
    data: -0.034355
    data: 0.089555
    data: -0.070665
    data: 0.053474
    data: -0.097595
    data: -0.058181
    data: -0.063978
    data: -0.049971
    data: -0.004331
    data: -0.033877
    data: -0.090482
    data: -0.040706
    data: -0.074279
    data: 0.034087
    data: -0.153921
    data: 0.065720
    data: 0.119329
    data: 0.092239
    data: 0.089760
    data: 0.013057
    data: -0.073713
    data: 0.012838
    data: -0.121439
    data: -0.055386
    data: -0.006805
    data: 0.070535
    data: -0.013428
    data: 0.049216
    data: -0.021961
    data: -0.124678
    data: 0.104630
    data: -0.169437
    data: -0.034507
    data: -0.144310
    data: -0.117785
    data: -0.165666
    data: -0.134944
    data: -0.065419
    data: -0.113213
    data: 0.052754
    data: 0.192592
    data: 0.154027
    data: 0.114403
    data: -0.002605
    data: -0.008628
    data: -0.027269
    data: 0.034011
    data: -0.127760
    data: -0.058146
    data: 0.039976
    data: 0.142588
    data: 0.053328
    data: -0.026023
    data: 0.116523
    data: -0.002462
    data: -0.049799
    data: -0.063248
    data: 0.048205
    data: 0.079390
    data: -0.083322
    data: -0.056856
    data: -0.139111
    data: -0.110149
    data: -0.140008
    data: 0.191092
    data: -0.167936
    data: -0.021200
    data: 0.038899
    data: -0.099865
    data: -0.136192
    data: -0.142723
    data: -0.117120
    data: 0.110811
    data: 0.046028
    data: -0.129812
    data: 0.049435
    data: -0.116086
    data: -0.013626
    data: -0.004710
    data: -0.163553
    data: 0.089420
    data: 0.158827
    data: -0.115196
    data: -0.077883
    data: 0.228867
    data: -0.001802
    data: 0.055915
    data: -0.081198
    data: 0.071971
    data: 0.018003
    data: 0.063038
    data: -0.041878
    data: -0.016849
    data: -0.123203
    data: -0.012299
    data: -0.064592
    data: 0.020091
    data: -0.015942
    data: 0.095499
    data: 0.142475
    data: 0.108913
    data: -0.172959
    data: -0.045857
    data: 0.026531
    data: -0.053789
    data: 0.106235
    data: -0.105523
    data: 0.095746
    data: 0.048116
    data: 0.012158
    data: -0.093268
    data: -0.164335
    data: -0.008656
    data: 0.065977
    data: -0.008240
    data: 0.080062
    data: 0.078700
    data: 0.049844
    data: -0.048722
    data: -0.059580
    data: 0.024204
    data: 0.126579
    data: 0.069097
    data: -0.038987
    data: -0.087393
    data: 0.032963
    data: -0.070479
    data: -0.056636
    data: -0.036216
    data: -0.002502
    data: 0.059321
    data: -0.077659
    data: 0.015054
    data: 0.147553
    data: 0.053752
    data: 0.039966
    data: 0.005181
    data: -0.156188
    data: -0.191427
    data: 0.095706
    data: 0.018404
    data: 0.068413
    data: -0.047114
    data: 0.091925
    data: -0.075397
    data: -0.034244
    data: 0.083691
    data: -0.067800
    data: 0.140061
    data: 0.061204
    data: 0.001473
    data: 0.121507
    data: -0.120826
    data: -0.077954
    data: 0.068034
    data: 0.026555
    data: -0.294127
    data: 0.031567
    data: -0.063484
    data: 0.043032
    data: 0.105118
    data: -0.046267
    data: -0.046861
    data: 0.022970
    data: 0.035387
    data: -0.108468
    data: -0.065121
    data: 0.047185
    data: 0.050677
    data: -0.086887
    data: -0.010831
    data: 0.052511
    data: -0.014965
    data: -0.081597
    data: 0.121250
    data: 0.064666
    data: -0.152375
    data: -0.262756
    data: 0.077832
    data: 0.077202
    data: -0.026929
    data: 0.065962
    data: 0.012741
    data: -0.112609
    data: -0.147549
    data: -0.210326
    data: -0.052364
    data: 0.015232
    data: 0.006552
    data: 0.000632
    data: -0.049670
    data: 0.133505
    data: 0.056539
    data: -0.026465
    data: -0.093425
    data: 0.074287
    data: -0.031320
    data: -0.083881
    data: 0.165847
    data: -0.031298
    data: 0.137774
    data: 0.111756
    data: 0.101009
    data: -0.064766
    data: 0.029697
    data: 0.000704
    data: -0.060278
    data: -0.138533
    data: 0.018817
    data: -0.094026
    data: -0.020963
    data: 0.064060
    data: 0.025371
    data: 0.062128
    data: -0.103993
    data: -0.062218
    data: -0.014289
    data: 0.027405
    data: 0.085023
    data: -0.144181
    data: -0.122917
    data: 0.051844
    data: 0.030613
    data: -0.017754
    data: 0.017953
    data: 0.043829
    data: 0.070886
    data: -0.056474
    data: -0.016568
    data: -0.031056
    data: 0.142062
    data: -0.013338
    data: -0.079414
    data: -0.023445
    data: -0.107549
    data: -0.087432
    data: -0.090144
    data: -0.072787
    data: -0.156926
    data: 0.097758
    data: 0.061587
    data: -0.038146
    data: 0.002566
    data: 0.125136
    data: 0.090667
    data: -0.097903
    data: -0.004135
    data: -0.087716
    data: -0.075408
    data: 0.126406
    data: -0.095958
    data: -0.129397
    data: 0.010910
    data: 0.073954
    data: -0.078935
    data: -0.007384
    data: 0.099956
    data: -0.061448
    data: -0.055604
    data: -0.056633
    data: 0.046793
    data: 0.141039
    data: 0.095688
    data: -0.059095
    data: -0.028686
    data: 0.023305
    data: 0.084308
    data: 0.010788
    data: 0.100739
    data: -0.067366
    data: -0.004537
    data: -0.075925
    data: 0.123671
    data: -0.163847
    data: -0.092887
    data: 0.061722
    data: 0.145858
    data: 0.097004
    data: -0.008950
    data: 0.117857
    data: 0.014670
    data: 0.003782
    data: -0.092648
    data: -0.025197
    data: 0.097598
    data: -0.087227
    data: -0.047265
    data: -0.055009
    data: 0.023351
    data: -0.118702
    data: -0.054684
    data: 0.088424
    data: 0.081479
    data: 0.091511
    data: -0.124142
    data: -0.138161
    data: -0.135428
    data: 0.024143
    data: 0.073158
    data: -0.098191
    data: 0.105238
    shape {
      dim: 16
      dim: 10
      dim: 3
      dim: 3
    }
  }
  blobs {
    data: 0.05917688
    data: 0.25241089
    data: 0.24647136
    data: 0.24992204
    data: 0.13357244
    data: 0.08144960
    data: 0.13232994
    data: 0.23777097
    data: 0.12792034
    data: 0.18851930
    data: -0.00354720
    data: -0.00185118
    data: -0.09648261
    data: 0.06120347
    data: 0.22306298
    data: -0.02210688
    shape {
      dim: 16
    }
  }
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
     weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "PReLU2"
  type: "PReLU"
  bottom: "conv2"
  top: "conv2"
  blobs {
    data: 0.23615679
    data: 0.15737164
    data: 0.08193993
    data: 0.24944052
    data: 0.00698878
    data: 0.05453971
    data: 0.18198454
    data: 0.24913751
    data: 0.06542041
    data: 0.23150215
    data: 0.16672623
    data: 0.17359309
    data: 0.25019479
    data: 0.16401748
    data: 0.24797535
    data: 0.31807244
    shape {
      dim: 16
    }
  }
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  blobs {
    data: -0.079812
    data: -0.075331
    data: 0.003648
    data: 0.048044
    data: -0.016813
    data: -0.025547
    data: -0.022811
    data: -0.041893
    data: 0.075628
    data: -0.093818
    data: 0.061760
    data: -0.058150
    data: -0.077803
    data: 0.006065
    data: 0.087929
    data: 0.047782
    data: 0.070683
    data: 0.005874
    data: -0.030172
    data: -0.009480
    data: -0.111740
    data: 0.100948
    data: 0.057917
    data: -0.007175
    data: 0.088268
    data: -0.051408
    data: 0.039578
    data: 0.074183
    data: 0.046014
    data: -0.005523
    data: 0.004348
    data: -0.078338
    data: 0.042867
    data: -0.049794
    data: -0.089777
    data: -0.100593
    data: -0.044595
    data: 0.015072
    data: 0.044469
    data: 0.013479
    data: -0.051734
    data: -0.047410
    data: 0.077574
    data: 0.071510
    data: -0.049224
    data: 0.061345
    data: -0.001499
    data: -0.016128
    data: 0.087652
    data: -0.118146
    data: 0.012313
    data: -0.090244
    data: 0.007970
    data: 0.047361
    data: 0.078212
    data: 0.008664
    data: 0.026616
    data: -0.052964
    data: 0.053876
    data: 0.036494
    data: -0.006497
    data: -0.102805
    data: -0.042514
    data: -0.103176
    data: 0.054359
    data: -0.085368
    data: 0.002365
    data: -0.007560
    data: 0.031211
    data: -0.014337
    data: 0.043692
    data: 0.000200
    data: 0.075825
    data: 0.089845
    data: -0.082379
    data: 0.051019
    data: -0.021844
    data: 0.061344
    data: 0.057730
    data: -0.091730
    data: -0.014463
    data: -0.069497
    data: -0.054125
    data: -0.110133
    data: 0.033690
    data: 0.075829
    data: -0.061065
    data: -0.058617
    data: 0.014344
    data: 0.082114
    data: -0.081794
    data: 0.096992
    data: 0.002322
    data: -0.040560
    data: 0.059026
    data: 0.050998
    data: -0.025990
    data: -0.021621
    data: -0.092190
    data: 0.008419
    data: 0.056655
    data: 0.077164
    data: -0.019001
    data: -0.065486
    data: -0.083851
    data: 0.092285
    data: 0.071043
    data: 0.099597
    data: 0.075004
    data: -0.057208
    data: -0.039117
    data: 0.028859
    data: 0.069903
    data: -0.019211
    data: 0.037592
    data: -0.073087
    data: 0.042800
    data: 0.085026
    data: -0.099847
    data: 0.010315
    data: 0.082047
    data: -0.021215
    data: -0.014303
    data: -0.088679
    data: -0.025272
    data: -0.089377
    data: -0.052162
    data: -0.098406
    data: -0.005009
    data: -0.035394
    data: -0.025518
    data: 0.030617
    data: 0.087288
    data: 0.025598
    data: -0.068185
    data: 0.023368
    data: -0.045986
    data: -0.030782
    data: -0.012940
    data: 0.051344
    data: -0.005736
    data: -0.035657
    data: 0.039110
    data: 0.012814
    data: -0.002200
    data: -0.059922
    data: -0.045940
    data: -0.019865
    data: -0.041255
    data: -0.067648
    data: -0.065079
    data: 0.012749
    data: -0.031797
    data: 0.038786
    data: 0.021372
    data: -0.011877
    data: 0.113418
    data: 0.016820
    data: 0.031832
    data: 0.077671
    data: -0.002990
    data: -0.072802
    data: 0.040120
    data: -0.036427
    data: 0.064667
    data: 0.036017
    data: -0.011804
    data: 0.081481
    data: -0.021932
    data: 0.088927
    data: 0.035305
    data: -0.054030
    data: -0.041796
    data: -0.006671
    data: -0.048685
    data: 0.011428
    data: 0.003496
    data: -0.032040
    data: -0.029342
    data: 0.095380
    data: 0.031253
    data: -0.073573
    data: 0.003564
    data: 0.033106
    data: -0.012438
    data: -0.005624
    data: -0.043132
    data: 0.022502
    data: -0.033849
    data: -0.014770
    data: 0.053720
    data: 0.011879
    data: -0.042260
    data: 0.062310
    data: 0.011375
    data: 0.018985
    data: 0.072107
    data: -0.017721
    data: 0.055522
    data: -0.033328
    data: -0.016514
    data: -0.007004
    data: 0.027708
    data: 0.064069
    data: 0.051072
    data: 0.077516
    data: 0.039067
    data: 0.101637
    data: 0.065915
    data: 0.067322
    data: 0.013821
    data: 0.157136
    data: 0.016937
    data: 0.004667
    data: -0.039261
    data: 0.027545
    data: -0.049855
    data: 0.039037
    data: 0.010207
    data: -0.003968
    data: 0.039519
    data: 0.034247
    data: -0.061067
    data: 0.015699
    data: -0.089668
    data: 0.082698
    data: 0.023824
    data: 0.047913
    data: 0.088436
    data: 0.067990
    data: 0.065646
    data: 0.111076
    data: 0.070728
    data: 0.079177
    data: 0.022921
    data: -0.077555
    data: -0.003835
    data: -0.013613
    data: 0.012424
    data: 0.090796
    data: -0.033923
    data: -0.017347
    data: 0.045440
    data: 0.009090
    data: 0.064818
    data: 0.000529
    data: 0.071049
    data: 0.043221
    data: -0.002675
    data: -0.039459
    data: 0.080841
    data: 0.000262
    data: -0.068983
    data: 0.044486
    data: -0.035015
    data: 0.021935
    data: -0.053507
    data: -0.065700
    data: -0.082509
    data: -0.076541
    data: -0.047400
    data: -0.019847
    data: 0.011631
    data: 0.020474
    data: -0.102344
    data: -0.029728
    data: 0.027554
    data: -0.075403
    data: -0.082256
    data: 0.005879
    data: -0.069940
    data: -0.081032
    data: 0.039661
    data: 0.102331
    data: -0.020125
    data: 0.032381
    data: -0.017304
    data: 0.052125
    data: -0.036442
    data: -0.019232
    data: -0.034641
    data: 0.067090
    data: -0.018056
    data: 0.091693
    data: 0.045044
    data: 0.088699
    data: -0.032977
    data: 0.052605
    data: -0.003384
    data: 0.065984
    data: 0.047809
    data: 0.024807
    data: 0.039476
    data: -0.057997
    data: -0.030525
    data: -0.045988
    data: -0.066263
    data: -0.007805
    data: 0.069220
    data: -0.010098
    data: 0.093463
    data: -0.035819
    data: -0.073011
    data: -0.071208
    data: 0.016561
    data: -0.005848
    data: 0.087069
    data: 0.040547
    data: -0.022875
    data: 0.020174
    data: 0.008189
    data: 0.104652
    data: -0.119191
    data: -0.067201
    data: 0.047927
    data: -0.137217
    data: -0.025485
    data: 0.003293
    data: 0.042966
    data: -0.133169
    data: -0.078957
    data: -0.017575
    data: 0.060315
    data: 0.008384
    data: 0.024501
    data: 0.023914
    data: -0.110763
    data: 0.051135
    data: -0.029330
    data: -0.029785
    data: 0.062298
    data: -0.054434
    data: -0.056313
    data: 0.040634
    data: 0.012823
    data: 0.088428
    data: 0.008140
    data: -0.012738
    data: -0.070777
    data: 0.110601
    data: 0.048767
    data: -0.002228
    data: 0.037828
    data: -0.062452
    data: -0.073124
    data: 0.037189
    data: -0.096982
    data: -0.032053
    data: 0.034107
    data: 0.098080
    data: 0.037063
    data: -0.074521
    data: -0.007300
    data: -0.015231
    data: -0.056556
    data: 0.105795
    data: -0.033579
    data: 0.050596
    data: 0.082216
    data: 0.082016
    data: -0.031283
    data: -0.047286
    data: 0.026572
    data: -0.118513
    data: -0.067677
    data: -0.060659
    data: -0.051511
    data: -0.088758
    data: -0.080828
    data: 0.023999
    data: 0.106600
    data: -0.075017
    data: 0.043419
    data: -0.044199
    data: -0.095164
    data: 0.026943
    data: -0.080954
    data: 0.070777
    data: 0.034342
    data: -0.052438
    data: 0.008192
    data: -0.046779
    data: -0.091131
    data: -0.060251
    data: -0.009017
    data: 0.030789
    data: -0.003662
    data: -0.046063
    data: -0.082967
    data: 0.101859
    data: -0.013713
    data: -0.021496
    data: -0.053225
    data: 0.085245
    data: 0.002121
    data: -0.053765
    data: 0.027610
    data: 0.018247
    data: -0.097436
    data: 0.064982
    data: -0.032661
    data: 0.041706
    data: 0.075081
    data: 0.055169
    data: -0.111741
    data: 0.071616
    data: 0.033967
    data: -0.026682
    data: -0.087778
    data: 0.036733
    data: 0.046990
    data: -0.070728
    data: 0.040877
    data: -0.021351
    data: -0.035917
    data: -0.034052
    data: 0.008053
    data: 0.078879
    data: -0.096085
    data: -0.077868
    data: -0.029690
    data: 0.021166
    data: 0.019353
    data: 0.049005
    data: 0.102118
    data: 0.054464
    data: 0.013664
    data: 0.074128
    data: 0.071317
    data: 0.001629
    data: 0.048237
    data: -0.009086
    data: -0.004235
    data: -0.003050
    data: 0.030054
    data: 0.007363
    data: 0.029295
    data: -0.008306
    data: -0.086744
    data: 0.023402
    data: 0.022285
    data: -0.047574
    data: 0.016816
    data: 0.023666
    data: 0.034981
    data: -0.019247
    data: 0.007912
    data: 0.019805
    data: 0.100753
    data: 0.110996
    data: -0.049003
    data: -0.055386
    data: -0.040460
    data: 0.058810
    data: 0.052010
    data: 0.158928
    data: -0.089476
    data: 0.000854
    data: 0.004017
    data: 0.028292
    data: -0.051122
    data: -0.071054
    data: 0.042426
    data: 0.004073
    data: -0.024768
    data: -0.023995
    data: -0.011149
    data: 0.041100
    data: 0.001922
    data: 0.015341
    data: 0.062203
    data: -0.063315
    data: -0.033437
    data: -0.031386
    data: -0.058091
    data: -0.077582
    data: -0.022058
    data: 0.043958
    data: 0.012519
    data: -0.067860
    data: 0.032392
    data: 0.078651
    data: -0.007565
    data: -0.097408
    data: 0.054935
    data: 0.068862
    data: 0.025381
    data: -0.023142
    data: -0.016822
    data: -0.108752
    data: -0.001502
    data: 0.026216
    data: 0.005511
    data: 0.014460
    data: -0.098478
    data: -0.027140
    data: -0.057836
    data: -0.032326
    data: 0.038295
    data: -0.038357
    data: -0.055964
    data: -0.014471
    data: 0.060592
    data: 0.092086
    data: -0.040453
    data: 0.059889
    data: 0.023386
    data: -0.057944
    data: -0.031654
    data: 0.052587
    data: 0.093825
    data: 0.113474
    data: 0.111722
    data: 0.085220
    data: 0.066264
    data: 0.048901
    data: 0.084245
    data: 0.001499
    data: -0.064692
    data: -0.018175
    data: -0.025591
    data: 0.081488
    data: -0.039034
    data: 0.106165
    data: 0.121787
    data: -0.009769
    data: -0.036814
    data: -0.065168
    data: -0.002219
    data: 0.076045
    data: -0.035102
    data: -0.033234
    data: -0.001333
    data: 0.036075
    data: -0.101821
    data: -0.017607
    data: -0.069294
    data: -0.012634
    data: -0.009849
    data: -0.036973
    data: -0.049962
    data: 0.039468
    data: 0.047914
    data: -0.055498
    data: -0.077491
    data: 0.047801
    data: -0.038833
    data: 0.129820
    data: 0.091218
    data: -0.014532
    data: 0.046369
    data: -0.019830
    data: 0.045124
    data: 0.004562
    data: -0.022028
    data: -0.026796
    data: -0.022180
    data: 0.054502
    data: -0.110053
    data: -0.049297
    data: -0.086471
    data: 0.005216
    data: 0.020602
    data: 0.053701
    data: 0.055811
    data: 0.021298
    data: 0.155206
    data: -0.002884
    data: -0.129931
    data: -0.076970
    data: -0.020998
    data: -0.056531
    data: -0.078614
    data: -0.018072
    data: 0.026993
    data: -0.044408
    data: 0.079753
    data: -0.019568
    data: -0.067915
    data: -0.054336
    data: -0.146947
    data: -0.052599
    data: -0.081364
    data: -0.092822
    data: -0.000964
    data: 0.172148
    data: 0.126604
    data: 0.018934
    data: 0.093763
    data: 0.046339
    data: -0.022584
    data: 0.215907
    data: 0.116413
    data: 0.104198
    data: 0.241646
    data: 0.135821
    data: 0.195655
    data: 0.128862
    data: 0.130949
    data: 0.133149
    data: 0.057108
    data: 0.006951
    data: 0.175652
    data: 0.024955
    data: -0.054366
    data: 0.023894
    data: 0.064319
    data: 0.001452
    data: 0.096797
    data: -0.047687
    data: 0.061449
    data: 0.146568
    data: 0.053849
    data: 0.059309
    data: 0.109944
    data: 0.090162
    data: 0.080773
    data: 0.081868
    data: 0.103313
    data: -0.042153
    data: 0.090671
    data: 0.006649
    data: 0.001168
    data: 0.056143
    data: 0.109654
    data: 0.119386
    data: 0.001497
    data: 0.169090
    data: 0.139224
    data: 0.006974
    data: 0.115971
    data: 0.060985
    data: 0.125246
    data: 0.043644
    data: 0.031137
    data: 0.141355
    data: 0.032313
    data: 0.034025
    data: 0.119322
    data: -0.008191
    data: 0.112287
    data: 0.185763
    data: 0.047778
    data: 0.125028
    data: -0.040773
    data: 0.008369
    data: 0.025711
    data: -0.080581
    data: -0.202820
    data: -0.136038
    data: -0.054092
    data: -0.063727
    data: -0.023103
    data: -0.048583
    data: -0.049000
    data: -0.083961
    data: -0.024184
    data: 0.039159
    data: -0.101401
    data: -0.069543
    data: 0.186236
    data: 0.065398
    data: 0.041438
    data: 0.043288
    data: 0.140652
    data: 0.116724
    data: 0.010712
    data: 0.048662
    data: -0.077599
    data: 0.104732
    data: -0.031784
    data: -0.058051
    data: -0.010517
    data: -0.011777
    data: 0.062824
    data: 0.034218
    data: 0.082526
    data: 0.088274
    data: 0.019786
    data: -0.089846
    data: -0.065497
    data: 0.043613
    data: 0.076657
    data: -0.032710
    data: 0.051716
    data: 0.015063
    data: -0.023825
    data: -0.021926
    data: -0.009516
    data: -0.010697
    data: -0.116166
    data: -0.034163
    data: -0.065398
    data: -0.110347
    data: -0.024365
    data: 0.058116
    data: -0.182363
    data: -0.086235
    data: 0.054826
    data: -0.110708
    data: -0.089319
    data: 0.065958
    data: 0.041665
    data: -0.112054
    data: -0.000151
    data: 0.074081
    data: -0.000487
    data: 0.081911
    data: 0.027276
    data: 0.056801
    data: 0.170132
    data: 0.130908
    data: -0.028517
    data: -0.007499
    data: 0.112459
    data: 0.060732
