name: "12Net"
layer {
  name: "data12"
  type: "HDF5Data"
  top: "label12face"
  top: "data12face"
  include {
    phase: TRAIN
  }
  phase: TRAIN
  hdf5_data_param {
    source: "/home_sdb/kpzhang/WIDER07/data12-face4/train-12rgb.txt"
    batch_size: 2000
  }
}
layer {
  name: "slicer_label"
  type: "Slice"
  bottom: "label12face"
  top: "label1"
  top: "label2"
  top: "label3"
  phase: TRAIN
  slice_param {
    slice_point: 1
    slice_point: 5
    axis: 1
  }
}
layer {
  name: "label1_slicer_label_0_split"
  type: "Split"
  bottom: "label1"
  top: "label1_slicer_label_0_split_0"
  top: "label1_slicer_label_0_split_1"
  phase: TRAIN
}
layer {
  name: "silence"
  type: "Silence"
  bottom: "label3"
  phase: TRAIN
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data12face"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  blobs {
    data: -0.081647158
    data: -0.015041245
    data: 0.12457386
    data: 0.83591545
    data: 0.23798521
    data: -0.41081759
    data: 1.2464966
    data: -1.3452641
    data: -0.5807721
    data: -0.26630989
    data: 0.29752547
    data: 0.10301049
    data: 0.85215539
    data: 0.320185
    data: -0.33211762
    data: 0.51743889
    data: -1.0906495
    data: -0.49633175
    data: -0.13688956
    data: 0.10161299
    data: -0.17933746
    data: 0.016411681
    data: 0.4359
    data: -0.10341845
    data: 0.033679444
    data: -0.21637864
    data: 0.059704833
    data: 0.48790067
    data: 0.32513341
    data: 0.78514
    data: -0.874864
    data: -0.78996032
    data: 0.27133971
    data: -2.4023557
    data: -0.72439885
    data: 0.25449964
    data: -0.4945682
    data: -0.1312943
    data: -0.25007442
    data: 0.27103665
    data: -0.31626618
    data: -0.1839706
    data: 1.1370491
    data: 0.5234617
    data: 0.69139516
    data: -0.29579049
    data: 0.23039098
    data: -0.60144764
    data: 1.1879834
    data: 0.42563736
    data: -0.23094766
    data: 1.2591369
    data: 0.67422056
    data: -0.96440631
    data: -0.70420188
    data: -0.054862108
    data: -0.53375006
    data: 0.18163557
    data: 0.16692866
    data: -0.099706337
    data: -0.36158386
    data: 0.20309944
    data: -0.23770422
    data: 0.64413995
    data: 0.52400953
    data: 0.56341511
    data: 0.26856723
    data: 0.11958196
    data: 0.094966255
    data: 0.33196121
    data: 0.35970327
    data: 0.31466246
    data: 0.39337409
    data: -0.11159303
    data: 0.71034175
    data: -0.22909223
    data: -0.428691
    data: -0.13392697
    data: 0.31502733
    data: -0.31197491
    data: 0.11150385
    data: -2.0420761
    data: -1.3518381
    data: 0.27219638
    data: -0.53079629
    data: 0.97149509
    data: 1.1668916
    data: 0.16120936
    data: 0.659265
    data: 0.40014505
    data: -0.061987583
    data: -0.34683254
    data: -0.51148891
    data: -0.12610707
    data: 0.013289311
    data: 0.1501645
    data: 0.58500177
    data: 0.56904191
    data: -0.23701157
    data: 0.1861175
    data: -0.35845998
    data: -0.099283278
    data: -0.41665486
    data: -0.30838865
    data: 0.19942707
    data: -0.23634957
    data: 0.325002
    data: 0.85408229
    data: -1.4440769
    data: -0.89004129
    data: 0.20784411
    data: 3.115788
    data: 0.84461266
    data: 0.25657839
    data: -1.2826006
    data: -0.77952194
    data: -0.048321389
    data: -1.1269826
    data: -0.049205605
    data: 0.075863205
    data: 2.3380036
    data: 0.3375645
    data: 0.053948935
    data: -1.1374497
    data: -0.4687658
    data: -0.020753892
    data: -0.59174377
    data: 0.43708697
    data: -0.096759662
    data: 0.9547739
    data: -0.59691292
    data: -0.18393482
    data: -0.55692941
    data: 0.38907766
    data: 0.21557489
    data: -0.30975288
    data: -1.2481064
    data: -0.68574715
    data: 1.108681
    data: 0.5375734
    data: -0.40051556
    data: 0.22149056
    data: 0.71316469
    data: 0.47752327
    data: -0.36787382
    data: -1.0780324
    data: -0.64593482
    data: 0.58550072
    data: 0.27793157
    data: -0.72252983
    data: 0.13157032
    data: 0.663042
    data: 0.34077227
    data: -0.19868691
    data: -0.56689006
    data: 0.31730798
    data: 0.21814311
    data: 0.058724035
    data: -0.40664688
    data: 0.41948262
    data: 0.29146525
    data: 0.24061079
    data: -0.54091972
    data: 0.12310863
    data: 0.79804206
    data: -0.68745661
    data: 0.38436681
    data: 1.7603908
    data: -1.7550305
    data: -0.87358516
    data: 1.1731586
    data: 0.21499255
    data: 0.45208922
    data: -0.92729086
    data: -0.1214423
    data: 0.3731584
    data: -0.43908328
    data: 0.058410004
    data: 0.23668653
    data: -0.2046883
    data: -0.28774455
    data: -0.0044987313
    data: 0.42203245
    data: -0.30375281
    data: 0.14538245
    data: 0.47635084
    data: -0.079306059
    data: -0.21874121
    data: -0.21345752
    data: 1.0725912
    data: 0.94492376
    data: 0.84211671
    data: 0.62647867
    data: 1.0201669
    data: 0.58254218
    data: -1.7609195
    data: -1.6218257
    data: -1.6864873
    data: -0.22563025
    data: -0.10274804
    data: -0.34282911
    data: 0.48706883
    data: 0.58217376
    data: 0.251585
    data: -0.28732145
    data: -0.35378125
    data: 0.082610689
    data: 0.4017067
    data: 0.28889853
    data: 0.24086411
    data: -0.16537747
    data: 0.3179296
    data: 0.17362948
    data: -0.47038868
    data: -0.66697729
    data: -0.29777452
    data: -0.95784664
    data: 1.9559071
    data: -0.96243966
    data: -1.2807209
    data: 2.3139379
    data: -1.0256131
    data: -0.77318025
    data: 1.2953728
    data: -0.56868672
    data: -0.16833933
    data: 0.74754226
    data: -0.5269202
    data: -0.88302022
    data: 1.3671495
    data: -0.66813993
    data: -0.12744807
    data: 0.57821119
    data: -0.34795609
    data: -0.35232985
    data: 0.5751093
    data: -0.16183691
    data: -0.38415474
    data: 0.61460757
    data: -0.27905762
    data: -0.21577251
    data: 0.27121478
    data: -0.044237349
    data: -0.56483549
    data: -0.24465956
    data: 0.0058984552
    data: -1.543447
    data: -0.58377367
    data: -0.24878131
    data: 0.67633271
    data: 0.21342099
    data: 0.30195829
    data: 2.332953
    data: 0.93189609
    data: 0.12026583
    data: 0.83246219
    data: 0.96138
    data: -0.26003209
    data: 0.55821514
    data: -0.10409641
    data: -0.65340316
    data: -1.3352611
    data: -0.95418942
    data: -0.049981963
    data: 0.26984945
    data: 0.32250309
    data: 0.34503841
    data: -1.0192578
    data: -0.45462683
    data: 0.50872
    shape {
      dim: 10
      dim: 3
      dim: 3
      dim: 3
    }
  }
  blobs {
    data: -0.082836866
    data: 0.91978
    data: 1.1886699
    data: 0.086806826
    data: -0.01940844
    data: -0.031458907
    data: 0.13236046
    data: -0.052203927
    data: 0.0076518082
    data: 0.66731763
    shape {
      dim: 10
    }
  }
  phase: TRAIN
  convolution_param {
    num_output: 10
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "PReLU1"
  type: "PReLU"
  bottom: "conv1"
  top: "conv1"
  blobs {
    data: -0.62540632
    data: -0.2116809
    data: 1.0116835
    data: 0.44112059
    data: -1.0347496
    data: 0.32151404
    data: -0.29789081
    data: 0.25188681
    data: -0.88273621
    data: -1.2783165
    shape {
      dim: 10
    }
  }
  phase: TRAIN
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  phase: TRAIN
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  blobs {
    data: -0.11650129
    data: -0.38356358
    data: -0.57860214
    data: 0.31888211
    data: 0.028761616
    data: -0.50348806
    data: -0.34135288
    data: -0.29149538
    data: 0.83594978
    data: -0.023393825
    data: 0.29452431
    data: 0.24030495
    data: 0.038583666
    data: 0.13734145
    data: -0.43053302
    data: -0.2931793
    data: -0.15369524
    data: 0.026887039
    data: -0.091790043
    data: 0.25232309
    data: 0.41191274
    data: 0.14222096
    data: -0.039143469
    data: -0.3569859
    data: -0.0046436125
    data: 0.31627017
    data: -0.46475446
    data: 0.3385483
    data: -0.11047007
    data: 0.22118059
    data: -0.63136488
    data: 0.070206776
    data: -0.6073693
    data: 0.56475538
    data: -0.30165854
    data: 0.50661182
    data: 0.48104623
    data: 0.17634244
    data: 0.055645835
    data: -0.012667852
    data: -0.19908805
    data: -0.12028268
    data: 0.036137711
    data: -0.40328613
    data: -0.40278476
    data: -0.25042811
    data: 0.1924165
    data: -0.032995775
    data: 0.17511269
    data: 0.43491769
    data: -0.0040709814
    data: 0.08075434
    data: -0.034483559
    data: -0.1205759
    data: 0.0057402989
    data: -0.36632013
    data: 0.25607765
    data: 0.2205653
    data: 0.75983435
    data: -0.29512328
    data: 0.048065826
    data: -0.26336724
    data: -1.7909627
    data: 0.018207226
    data: 0.0735626
    data: 0.10247386
    data: -0.15740059
    data: -0.22041927
    data: -0.23558103
    data: 0.05917896
    data: 0.51133716
    data: 0.26748872
    data: -0.034609854
    data: 0.33673587
    data: 0.31478423
    data: 0.18059908
    data: 0.055872511
    data: 0.27391252
    data: -0.15600033
    data: -0.5138315
    data: -1.3409357
    data: 0.00046892097
    data: 0.22889674
    data: 0.24768415
    data: 0.071008928
    data: 0.096954912
    data: -0.27146831
    data: -0.24296866
    data: 0.09522634
    data: -0.047881402
    data: -0.24365418
    data: -0.046447136
    data: 0.0087691192
    data: 0.36972836
    data: 0.260724
    data: 0.0016532758
    data: 0.15042038
    data: 0.27860749
    data: 0.28454474
    data: -0.65530455
    data: 0.0099435626
    data: -0.12268289
    data: -0.33781874
    data: -0.18218316
    data: -0.2997416
    data: -1.0103321
    data: 0.13566178
    data: 0.20075727
    data: -0.59657943
    data: 0.778088
    data: -0.00733489
    data: -0.396945
    data: 0.41333625
    data: 0.12885785
    data: -0.64260948
    data: 0.61808032
    data: 0.12084292
    data: -0.38542089
    data: -0.24236923
    data: -0.070217274
    data: -0.17574109
    data: -0.21919781
    data: -0.12395184
    data: 0.21596871
    data: 0.095600009
    data: 0.1561776
    data: 0.067559846
    data: -0.10071305
    data: -0.11468293
    data: 0.025551548
    data: -0.52366179
    data: -0.390574
    data: 0.13402034
    data: -0.18494114
    data: -0.15538789
    data: 0.43593422
    data: 0.38416627
    data: 0.10224476
    data: 0.021276288
    data: 0.065878876
    data: 0.093725152
    data: 0.081894018
    data: -0.12807813
    data: -0.15019193
    data: 0.030394752
    data: 0.12271689
    data: 0.16949528
    data: 0.049117126
    data: -0.11573929
    data: 0.0648803
    data: -0.65790617
    data: -0.33544898
    data: -0.065532908
    data: 0.13733017
    data: 0.05856435
    data: -0.016769506
    data: -0.15376259
    data: -0.17329279
    data: -0.040972844
    data: 0.30915117
    data: 0.1082292
    data: -0.0644187
    data: -0.09050414
    data: -0.10034055
    data: -0.037208833
    data: 0.52627051
    data: 0.30103007
    data: 0.066646867
    data: -0.15120415
    data: -0.12870625
    data: -0.013647147
    data: -1.0443056
    data: 0.39613074
    data: 0.22747645
    data: -0.35986209
    data: -0.15537329
    data: 0.054596446
    data: -0.86026931
    data: -0.059902281
    data: 0.11545141
    data: -0.10232766
    data: -0.00018311798
    data: -0.011044093
    data: -0.31900951
    data: -0.1129218
    data: 0.023691148
    data: 0.30190662
    data: 0.15822846
    data: 0.013570574
    data: -0.022735571
    data: -0.027550019
    data: 0.28240791
    data: 0.071872368
    data: -0.07599511
    data: 0.20795645
    data: -1.1587365
    data: -0.29771057
    data: -0.17513725
    data: 0.64573556
    data: -0.1142295
    data: 0.60608572
    data: 0.26513284
    data: -0.39728492
    data: -0.0074346871
    data: -0.47011912
    data: -0.38958904
    data: 0.060868625
    data: 0.16666032
    data: 0.009405056
    data: 0.17780849
    data: 0.06624192
    data: -0.052132782
    data: 0.056517988
    data: 0.067861296
    data: -0.11385653
    data: -0.11016114
    data: -0.099952057
    data: 0.13457933
    data: 0.23686115
    data: 0.0843727
    data: 0.0842356
    data: 0.21327385
    data: -0.36313611
    data: 0.050666545
    data: 0.16378307
    data: -0.15594181
    data: -0.024223324
    data: 0.10974672
    data: 0.15768205
    data: -0.0050966991
    data: 0.035979338
    data: -0.42993137
    data: 0.030287672
    data: -0.0072936234
    data: -0.17510752
    data: -0.012896508
    data: -0.11749886
    data: 0.0040281215
    data: -0.22391181
    data: -0.052230045
    data: -0.270701
    data: -0.079781063
    data: -0.0066611795
    data: -0.15441687
    data: -0.079690628
    data: -0.037965942
    data: -0.26969588
    data: -0.028409876
    data: -0.16884965
    data: -0.84486848
    data: 0.01002909
    data: -0.14847891
    data: 0.041240487
    data: 0.029581048
    data: 0.026709355
    data: -0.013031775
    data: 0.084036
    data: 0.010478177
    data: 0.30323559
    data: 0.13597387
    data: 0.0055100285
    data: 0.19998464
    data: 0.094343804
    data: 0.53135067
    data: -0.057364114
    data: 0.0069372063
    data: -0.036288504
    data: -0.85867232
    data: -0.001163621
    data: -0.088102259
    data: 0.26099256
    data: 0.22925326
    data: -0.073961459
    data: -0.23628657
    data: -0.29567596
    data: 0.092176631
    data: -0.22726458
    data: -0.22580457
    data: 0.0096290288
    data: 0.012295856
    data: -0.18434854
    data: 0.30240381
    data: 0.1404597
    data: 0.10000343
    data: 0.0088810567
    data: -0.23973426
    data: 0.011197345
    data: 0.080302842
    data: -0.37809592
    data: 0.12251727
    data: -0.65569293
    data: 0.09550719
    data: 0.062005028
    data: 0.30605268
    data: 0.51612073
    data: 0.083153732
    data: -0.087086111
    data: 0.00979982
    data: 0.078866318
    data: 0.070102125
    data: -0.61683989
    data: -0.4844524
    data: 0.18677372
    data: -0.24463473
    data: -0.30466524
    data: -0.029138649
    data: -1.2218839
    data: -1.2322112
    data: -0.073457129
    data: -0.22727257
    data: -0.45828164
    data: -0.10312132
    data: 0.0066032279
    data: 0.11718054
    data: 0.267186
    data: -1.1675049
    data: -0.42956364
    data: 0.24561688
    data: 0.18684523
    data: -0.033361722
    data: 0.21912596
    data: 0.43087286
    data: 0.11601681
    data: 0.13338554
    data: 0.65926927
    data: -0.017759658
    data: 0.079275779
    data: 0.42507696
    data: 0.017576955
    data: -0.31034827
    data: 0.024278166
    data: 0.19743492
    data: -0.11396605
    data: -0.50463974
    data: -0.16216204
    data: 0.16456246
    data: 0.15285505
    data: 0.45808107
    data: 0.0582997
    data: -0.073780358
    data: 0.1935145
    data: 0.13476822
    data: 0.5240798
    data: 0.23136714
    data: 0.40750009
    data: -0.027111841
    data: 0.1208828
    data: -0.082302086
    data: -0.0050848494
    data: -0.0061567114
    data: -0.048022967
    data: -0.023391334
    data: -0.074387915
    data: -0.020264041
    data: 0.078514732
    data: -0.10114142
    data: -0.069810405
    data: -0.1309554
    data: 0.17169383
    data: 0.12039221
    data: -0.26618114
    data: 0.24823646
    data: -0.89304793
    data: 0.026557298
    data: 0.03652893
    data: 0.10343406
    data: -0.059789643
    data: -0.067304179
    data: 0.0048162774
    data: 0.0026125473
    data: -0.25848594
    data: -0.19228911
    data: 0.091830105
    data: 0.1833898
    data: -0.11529397
    data: 0.23451601
    data: -0.052124441
    data: 0.33034834
    data: -0.080096483
    data: -0.53972483
    data: 1.6032103
    data: 0.054861903
    data: -0.586084
    data: -1.1064546
    data: 0.25297755
    data: -0.14239801
    data: 0.44036204
    data: 0.021093706
    data: -0.19943517
    data: -1.0988269
    data: -0.10189172
    data: 0.27901602
    data: -0.1702619
    data: -0.09721227
    data: -0.026919026
    data: 0.40776297
    data: 0.041942015
    data: -0.1853
    data: -0.35998479
    data: -0.019547923
    data: -0.17975192
    data: -0.3093915
    data: 0.15000214
    data: 0.1138083
    data: -0.029251605
    data: 0.20870009
    data: 0.45251489
    data: 1.3983263
    data: -0.3180798
    data: -0.051116642
    data: -0.17988619
    data: 0.067029044
    data: -0.0328498
    data: -0.22181627
    data: 0.2989746
    data: -0.62577236
    data: -0.033589635
    data: 0.03968665
    data: 0.010475476
    data: -0.27168119
    data: 0.068943948
    data: -0.299499
    data: -0.045204706
    data: 0.064592749
    data: -0.012876922
    data: 0.19889146
    data: -0.20380557
    data: 0.37034467
    data: -0.40592092
    data: -0.0041426765
    data: 0.027722068
    data: 0.08522065
    data: -0.37457448
    data: -0.68462831
    data: -0.7609309
    data: 0.27650207
    data: 0.12548079
    data: 0.14710787
    data: 0.051355768
    data: 0.26706254
    data: 0.20141624
    data: -0.13686731
    data: -0.48504585
    data: 0.48358157
    data: 0.085710317
    data: 0.053287394
    data: -0.31154814
    data: 0.13130008
    data: 0.039460402
    data: 0.26750469
    data: -0.11491089
    data: -0.1901454
    data: -0.25545308
    data: 0.1267532
    data: 0.027493034
    data: -0.18421282
    data: 0.2522839
    data: 0.15360641
    data: -0.12096766
    data: 0.15038188
    data: -0.33807576
    data: 0.054472633
    data: 0.29715008
    data: -0.12032767
    data: 0.27183285
    data: -0.085331261
    data: -0.22143015
    data: -0.27401415
    data: 0.29472256
    data: -0.40226135
    data: -0.17979422
    data: 0.71949768
    data: -0.0923147
    data: -0.054138463
    data: 0.551816
    data: 0.045540273
    data: -0.86007351
    data: -0.19597298
    data: -0.22744434
    data: 0.14673485
    data: -0.17511427
    data: -0.22135639
    data: 0.13810919
    data: 0.29985136
    data: 0.11964592
    data: -0.040457308
    data: 0.022767834
    data: 0.04138862
    data: -0.0665633
    data: -0.0089287208
    data: 0.11519226
    data: 0.097144462
    data: -0.045261297
    data: -0.14475171
    data: -0.016297085
    data: -0.094979174
    data: 0.12821162
    data: -0.035879537
    data: 0.19189341
    data: 0.43428266
    data: 0.091721125
    data: -0.094993867
    data: 0.014379037
    data: 0.16018642
    data: -0.66419792
    data: -0.52513081
    data: -0.15429573
    data: -0.67139834
    data: -0.510743
    data: 0.33316952
    data: 0.090069883
    data: -0.25787166
    data: 0.25968805
    data: 0.19893266
    data: 0.23017949
    data: 0.26804373
    data: 0.25257796
    data: 0.25171471
    data: 0.15191346
    data: 0.073606446
    data: -0.21777228
    data: -0.1236731
    data: -0.27488884
    data: -0.30339694
    data: -0.16536444
    data: -0.27397257
    data: -0.26541689
    data: -0.085688539
    data: -0.19766591
    data: -0.060144275
    data: 0.24335009
    data: 0.021698754
    data: -0.29711804
    data: 0.056454327
    data: 0.076609194
    data: -0.21477164
    data: 0.26496962
    data: 0.045648765
    data: -0.078036249
    data: 0.12899487
    data: 0.22275972
    data: -0.058673006
    data: 0.15414505
    data: 0.13290073
    data: 0.0791444
    data: 0.14917049
    data: 0.00067548675
    data: 0.35796788
    data: 0.22095741
    data: -0.19774102
    data: -0.77173036
    data: -0.3078365
    data: -0.24699697
    data: -0.38666132
    data: 0.19587022
    data: -0.075663015
    data: 0.017395934
    data: 0.28142133
    data: 0.55910844
    data: -0.41638494
    data: -0.5015201
    data: -0.38542154
    data: -0.17896879
    data: 0.30078021
    data: 0.54985321
    data: 0.071607046
    data: 0.50944805
    data: 0.82381344
    data: 0.21954887
    data: -0.13143373
    data: 0.13319749
    data: -0.17378941
    data: -0.16377759
    data: 0.068478651
    data: 0.23777932
    data: 0.18068729
    data: -0.38974038
    data: -0.41787186
    data: -0.12533349
    data: -0.74417084
    data: -0.18371187
    data: -0.065751009
    data: -0.078288376
    data: 0.021649074
    data: 0.11782921
    data: -0.29467502
    data: -0.17802039
    data: -0.10793523
    data: -0.070501655
    data: 0.03633488
    data: -0.025582137
    data: 0.13502495
    data: -0.17106785
    data: 0.055804681
    data: -0.52069467
    data: -0.0688851
    data: 0.061002374
    data: 0.081070513
    data: 0.056845017
    data: -0.091700919
    data: 0.07180278
    data: -0.370994
    data: -0.088649429
    data: 0.096751705
    data: -0.0152705
    data: -0.10519493
    data: 0.024464447
    data: -0.03992584
    data: -0.0090152742
    data: 0.038413119
    data: -0.16621366
    data: 0.08810129
    data: -0.3003982
    data: -0.23397237
    data: 0.095434867
    data: 0.19217515
    data: 0.18733519
    data: 0.064295262
    data: -0.127836
    data: -0.10839369
    data: -0.092370071
    data: 0.012477184
    data: -0.39084491
    data: -0.5817166
    data: -0.34790388
    data: -0.12467828
    data: 0.16097088
    data: -0.058860227
    data: -0.10126354
    data: 0.32960433
    data: -0.17731331
    data: 0.05080992
    data: 0.026080817
    data: -0.25406235
    data: 0.16663007
    data: 0.024473859
    data: -0.600058
    data: 0.099992275
    data: -0.15163541
    data: -0.48170891
    data: -0.14037909
    data: 0.34654009
    data: -0.10079626
    data: 0.1547168
    data: 0.47752219
    data: -0.11681484
    data: -0.22587389
    data: -0.49881715
    data: -0.30618951
    data: -0.060701329
    data: 0.0028789919
    data: 0.26774597
    data: 0.31942874
    data: 0.47229093
    data: 0.027846953
    data: -0.22367488
    data: -0.40625694
    data: -0.40857816
    data: 0.040122934
    data: 0.0038893006
    data: -0.3103444
    data: 0.17733313
    data: 0.033754859
    data: -0.48545069
    data: 0.21299732
    data: -0.17658311
    data: -0.78560662
    data: 0.012289478
    data: -0.069728009
    data: -0.99985576
    data: 0.043476779
    data: 0.059166875
    data: -0.64908743
    data: -0.20224255
    data: -0.019809313
    data: 0.11840649
    data: -0.031926472
    data: -0.043008659
    data: -0.0050256657
    data: -0.10688778
    data: 0.11034838
    data: 0.27225471
    data: -0.12360317
    data: 0.017797103
    data: 0.084649511
    data: 0.062894873
    data: 0.031283449
    data: -0.07029555
    data: -0.11636858
    data: 0.2262008
    data: 0.15632285
    data: -0.057103019
    data: 0.20933403
    data: 0.13743106
    data: -0.015217268
    data: -0.016393216
    data: 0.28041691
    data: -0.065932907
    data: -0.085552685
    data: 0.17750213
    data: -0.023977503
    data: -0.24648474
    data: 0.22031897
    data: 0.16145355
    data: 0.019406354
    data: 0.028604664
    data: -0.15781032
    data: -0.091189235
    data: -0.027970951
    data: 0.1148841
    data: 0.11868371
    data: -0.3744621
    data: -0.00259695
    data: -0.060202587
    data: -0.2144441
    data: 0.28612441
    data: 0.48091763
    data: -0.17257643
    data: -0.12449673
    data: -0.4522109
    data: 0.0315257
    data: 0.15541007
    data: 0.048897482
    data: -0.14197811
    data: 0.15250835
    data: 0.11873572
    data: -0.0072815293
    data: 0.14576857
    data: 0.047073722
    data: -0.050084267
    data: 0.094293408
    data: 0.075119436
    data: 0.097403176
    data: -0.0049402923
    data: 0.055207144
    data: 0.3514061
    data: 0.069282718
    data: -0.51792383
    data: -0.23545174
    data: -0.22759584
    data: -0.28489989
    data: 0.24947777
    data: -0.065014914
    data: 0.40551963
    data: 0.34567657
    data: -0.043944169
    data: -0.022435348
    data: -0.13552114
    data: -0.15844654
    data: -0.38989836
    data: -0.28424865
    data: -0.17180465
    data: -0.5042603
    data: 0.026913274
    data: -0.1577348
    data: -0.56245303
    data: 0.29503921
    data: -0.14125016
    data: -0.47207168
    data: 0.36617535
    data: -0.16707791
    data: -0.88691497
    data: 0.25266293
    data: -0.18124188
    data: -1.1582901
    data: -0.24262655
    data: -0.20262571
    data: -0.086893715
    data: -0.14177302
    data: -0.30896464
    data: 0.052051738
    data: -0.087949328
    data: -0.31445995
    data: -0.39719474
    data: 0.25611791
    data: 0.33595011
    data: 0.1527257
    data: 0.30185941
    data: 0.084315151
    data: 0.13277861
    data: 0.20606261
    data: 0.1843981
    data: 0.35399044
    data: -0.24780343
    data: -0.51246941
    data: -0.22204362
    data: -0.25814888
    data: -0.78361213
    data: -0.45950198
    data: -0.034777775
    data: -0.57297558
    data: -0.93043345
    data: 0.16165292
    data: 0.26637879
    data: 0.24703276
    data: 0.073752627
    data: 0.21617839
    data: 0.30539322
    data: 0.036367584
    data: 0.24849634
    data: 0.40721714
    data: 0.013405507
    data: -0.037243139
    data: -0.14371626
    data: 0.19139272
    data: -0.057785794
    data: 0.035519566
    data: 0.33094257
    data: -0.10145798
    data: -0.19599976
    data: 0.2016592
    data: -0.25700161
    data: 0.07045681
    data: 0.1364848
    data: -0.30608967
    data: -0.19199561
    data: 0.34737313
    data: 0.16093084
    data: 0.0051034451
    data: 0.32847387
    data: -0.12929548
    data: -0.47047839
    data: -0.12398907
    data: 0.082229741
    data: 0.18058859
    data: 0.20145889
    data: -0.0077559091
    data: -0.10694326
    data: 0.44372404
    data: -0.24967465
    data: 0.12865454
    data: -0.2536802
    data: 0.07401365
    data: -0.29621238
    data: -0.057863757
    data: -0.048333269
    data: 0.26784855
    data: 0.26034766
    data: 0.12593359
    data: -0.1871777
    data: -0.3106817
    data: 0.30918363
    data: -0.13941197
    data: -0.11633586
    data: 0.089116648
    data: -0.04368525
    data: -0.5173099
    data: 0.1232012
    data: 0.011013148
    data: -0.1618371
    data: 0.50648367
    data: -0.091798186
    data: -0.20649548
    data: 0.22801416
    data: -0.068327263
    data: -0.15002106
    data: -0.20883216
    data: 0.082753278
    data: 0.38055879
    data: 0.22269946
    data: -0.18572821
    data: -0.1334462
    data: -0.26696628
    data: 0.20496514
    data: -0.28258723
    data: 0.95112103
    data: -0.2140805
    data: -0.36859262
    data: 0.090354159
    data: -0.59227192
    data: -0.21460408
    data: 0.65792447
    data: -0.26299113
    data: -0.30795687
    data: -0.24584603
    data: 0.034444779
    data: 0.18863539
    data: 0.24361306
    data: -0.0897867
    data: 0.00773224
    data: -0.30927053
    data: 0.10844858
    data: 0.24131472
    data: 0.071683027
    data: -0.16268261
    data: -0.18597017
    data: -0.18842493
    data: 0.12602183
    data: 0.27616045
    data: 0.030750085
    data: -0.2653386
    data: 0.15173228
    data: 0.0017501342
    data: -0.30743894
    data: 0.078456804
    data: 0.061541654
    data: -0.22368732
    data: 0.06788262
    data: 0.11794782
    data: 0.01382849
    data: 0.021202378
    data: 0.59005231
    data: -0.26175705
    data: -0.15844955
    data: 0.15446234
    data: -0.72824633
    data: -0.037306767
    data: -0.12161688
    data: -0.441609
    data: 0.14624393
    data: -0.18532257
    data: 0.055408157
    data: -0.0047895024
    data: -0.35719591
    data: -0.18384634
    data: 0.047073137
    data: 0.28974366
    data: 0.041846294
    data: 0.025859568
    data: 0.53466809
    data: -0.15692949
    data: -0.10436931
    data: -0.55861813
    data: -0.27489039
    data: 0.2839554
    data: -0.089524731
    data: 0.57451969
    data: 0.1082038
    data: 0.46777686
    data: 0.69437611
    data: -0.35748443
    data: 0.02531261
    data: 0.35121685
    data: -0.18567781
    data: -0.33261403
    data: -0.042706929
    data: 0.11850623
    data: 0.099469088
    data: 0.47269377
    data: 0.034219742
    data: 0.14465149
    data: 0.21405096
    data: 0.20986941
    data: 0.18671221
    data: 0.30405968
    data: 0.042341977
    data: -0.50153387
    data: -0.58963722
    data: -0.16109042
    data: -0.046575241
    data: -0.3385244
    data: 0.01010828
    data: 0.36218545
    data: 0.24112909
    data: 0.083215669
    data: 0.11652137
    data: -0.0055601164
    data: -0.030532962
    data: 0.73689735
    data: 0.42436787
    data: 0.15469591
    data: 0.48630172
    data: 0.28418729
    data: -0.16494226
    data: 0.038787268
    data: -0.038569044
    data: -0.308833
    data: 0.011949259
    data: -0.17049876
    data: 0.16787645
    data: -0.11250985
    data: 0.17616999
    data: 0.036032215
    data: 0.017500181
    data: -1.160307
    data: 0.088867739
    data: -0.016814223
    data: -1.8242197
    data: 0.072448231
    data: -0.23689698
    data: -1.4640158
    data: 0.107722
    data: 0.24800734
    data: -0.027591372
    data: -0.10967243
    data: -0.097581938
    data: -0.37480706
    data: 0.026364733
    data: 0.2313896
    data: -0.099161558
    data: -0.13969412
    data: 0.46842766
    data: 0.29842505
    data: 0.023876073
    data: 0.30307189
    data: 0.25286034
    data: 0.55964905
    data: -0.012186025
    data: 0.52458811
    data: -0.27132773
    data: 0.12784389
    data: 0.1181792
    data: -0.029230569
    data: 0.19699599
    data: 0.31939784
    data: -0.31480774
    data: -0.12070905
    data: -0.13562191
    data: -0.12979959
    data: 0.20831689
    data: 0.10160488
    data: 0.40033403
    data: 0.46054846
    data: -0.017023558
    data: -0.16798286
    data: -0.25121483
    data: -0.54648578
    data: 0.10756285
    data: -0.18124838
    data: 0.079350084
    data: 0.27077758
    data: 0.47814357
    data: 0.267286
    data: 0.2325702
    data: 0.55232573
    data: 0.35606229
    data: 0.04850493
    data: -0.27312309
    data: -0.089202277
    data: -0.19040973
    data: -0.2371248
    data: -0.12866534
    data: -0.0031712297
    data: -0.29997137
    data: -0.2144558
    data: 0.14779699
    data: -0.17413069
    data: 0.25524265
    data: 0.55802119
    data: -0.44459674
    data: -0.10300247
    data: -0.20926018
    data: 0.045906704
    data: -0.26338121
    data: 0.539469
    data: 0.14429341
    data: 0.24734001
    data: -0.574536
    data: -0.097259074
    data: 0.014060393
    data: -0.66631097
    data: 0.053057004
    data: -0.19736394
    data: -0.032726288
    data: -0.11399425
    data: -0.020800123
    data: 0.32464615
    data: -0.022107197
    data: -0.23685995
    data: -0.14499204
    data: -0.33411077
    data: 0.4730714
    data: 0.24719453
    data: 0.32354194
    data: 0.040000875
    data: -0.51541638
    data: -0.18693247
    data: 0.0024099005
    data: -0.74536151
    data: -0.28365675
    data: -0.4948431
    data: 0.15583763
    data: -0.27429733
    data: 0.2168462
    data: -0.029316599
    data: -0.14728315
    data: -0.032463253
    data: -0.1075504
    data: -0.052195404
    data: -0.083264396
    data: -0.67088336
    data: -0.37830964
    data: -0.01497321
    data: -0.27189812
    data: -0.12821078
    data: 0.13418965
    data: -0.047369629
    data: -0.15036254
    data: 0.087171093
    data: -1.0557004
    data: -0.20215201
    data: 0.13221383
    data: -0.34646636
    data: -0.15178473
    data: 0.11953714
    data: 0.56650215
    data: 0.40556407
    data: 0.29869667
    data: -1.012233
    data: -0.59244776
    data: 0.11659909
    data: 0.63591707
    data: -0.051603686
    data: 0.36201492
    data: 0.1830052
    data: 0.22789781
    data: 0.077521689
    data: -1.1145403
    data: -0.21454966
    data: -0.12476552
    data: -0.17650361
    data: -0.11299805
    data: 0.024311733
    data: 0.096693791
    data: 0.12976371
    data: 0.22759321
    data: 0.10221016
    data: 0.092342474
    data: -0.021162493
    data: 0.48915106
    data: -0.034401141
    data: 0.15702569
    data: 0.012708703
    data: 0.10953791
    data: 0.10679105
    data: 0.22652747
    data: 0.29712608
    data: -0.19061011
    data: -0.099679895
    data: -0.014589522
    data: -0.20798188
    data: -0.33170149
    data: -0.026552025
    data: -0.27397138
    data: -0.15231177
    data: 0.024107561
    data: -0.067078032
    data: -0.14175864
    data: 0.13509922
    data: -0.19220345
    data: -0.10477135
    data: -0.099824339
    data: -0.051012855
    data: 0.035373677
    data: 0.11698665
    data: -0.092397831
    data: 0.23523471
    data: -0.14309675
    data: -0.0027010648
    data: -0.0091839824
    data: -0.064075947
    data: 0.10284861
    data: 0.16254734
    data: 0.20941897
    data: 0.23959111
    data: -0.04884069
    data: 0.19931737
    data: 0.00080853759
    data: 0.14187755
    data: 0.11508113
    data: -0.034461185
    data: -1.176526
    data: -0.1770592
    data: 0.079770885
    data: 0.27260464
    data: 0.10638905
    data: 0.28794211
    data: 0.039301407
    data: 0.32277498
    data: 0.25268397
    data: -0.01489239
    data: -0.29203686
    data: -0.32611686
    data: 0.45608908
    data: 0.3207
    data: -0.45295292
    data: 0.24644
    data: 0.52636909
    data: 0.1251806
    data: -0.26273397
    data: 0.16887453
    data: -0.19198161
    data: 0.045280423
    data: 0.32936335
    data: 0.41436049
    data: -0.052450523
    data: -0.12445468
    data: -0.26590344
    data: 0.5227403
    data: -0.75445569
    data: 0.57482195
    data: -0.28177106
    data: -0.20646301
    data: -0.064198755
    data: -0.18417907
    data: 0.15987
    data: 0.30209789
    data: 0.12585853
    data: 0.15577959
    data: 0.010712473
    data: -0.0019354617
    data: 0.54370737
    data: -0.26762712
    data: 0.1501164
    data: -0.53463465
    data: -0.30061349
    data: 0.011702768
    data: 0.11471487
    data: 0.25433141
    data: -0.021752521
    data: -0.16691254
    data: -0.23937275
    data: 0.072115913
    data: -0.92883945
    data: -0.36570144
    data: -0.45225188
    data: -0.092746347
    data: 0.51098841
    data: -0.34722832
    data: 0.0041616107
    data: 0.19673365
    data: -0.17881756
    data: -0.11858036
    data: 0.5430184
    data: -0.41359627
    data: -0.27593738
    data: -0.049345657
    data: -0.12719944
    data: -0.066986017
    data: 0.26482338
    data: 0.059962627
    data: 0.72815269
    data: 0.32294682
    data: 0.002094114
    data: 0.16805692
    data: -0.0055550942
    data: 0.21808238
    data: -0.24104582
    data: 0.22363059
    data: -0.076159842
    data: -0.2806128
    data: -0.0086005554
    data: -0.182442
    data: -0.54802632
    data: -0.21659315
    data: -0.11319352
    data: 0.25539225
    data: -0.021796752
    data: 0.19602932
    data: 0.63917047
    data: -0.0047048517
    data: -0.11531135
    data: -0.25079861
    data: 0.53719527
    data: -0.18589576
    data: -0.10698196
    data: -0.26052469
    data: 0.19303624
    data: -0.012575273
    data: 0.055521421
    data: -0.50734055
    data: -0.28404477
    data: 0.21953097
    data: -0.81919181
    data: -0.19172633
    data: 0.33633679
    data: 0.056609157
    data: 0.26029927
    data: -0.053617362
    data: -0.28930023
    data: 0.43233258
    data: 0.43799067
    data: -0.70470756
    data: 0.18584248
    data: 0.062590845
    data: -0.21896927
    data: 0.020529551
    data: 0.16827308
    data: -0.41415307
    data: 0.37302759
    data: 0.13684691
    data: -1.0500546
    data: 0.59663922
    data: 0.31509364
    data: -0.73806775
    data: 0.55063593
    data: 0.29975674
    data: 0.17856272
    data: -0.075166516
    data: -0.15852211
    data: -0.46187761
    data: -0.13929458
    data: -0.34731004
    data: 0.25545198
    data: -0.36032233
    data: -0.0069807735
    data: 0.15118684
    data: 0.14015821
    data: -0.087626837
    data: 0.24541166
    data: 0.077348411
    data: 0.027692843
    data: 0.20442834
    data: 0.070591353
    data: 0.026148953
    data: -0.055543445
    data: 0.51414317
    data: 0.095910259
    data: 0.0772611
    data: 0.38844052
    data: 0.13045433
    data: 0.13661961
    data: -0.1333103
    data: 0.0962068
    data: 0.29901427
    data: -0.0030925586
    data: 0.07104376
    data: -0.60367787
    data: 0.18081766
    data: 0.31007576
    data: -0.18782282
    data: -0.12278675
    data: -0.0750333
    data: 0.22464076
    data: 0.060056832
    data: -0.02003259
    data: -0.10711438
    data: 0.4345125
    data: -0.13670661
    data: 0.14023185
    data: 0.13214685
    data: -0.1124532
    data: 0.080100141
    data: -0.1993088
    data: -0.098792814
    data: -1.524274
    data: -0.076472424
    data: 0.26006126
    data: -0.076720767
    data: -0.1055069
    data: 0.064838968
    data: -0.19836672
    data: 0.055322893
    data: 0.095352188
    data: -0.063276149
    data: 0.11173577
    data: -0.16437966
    data: 0.12024505
    data: -0.095405318
    data: 0.016838895
    data: 0.20970246
    data: -0.070236325
    data: -0.27019373
    data: 0.013489276
    data: -0.04043505
    data: -0.18888158
    data: 0.051565155
    data: -0.11174791
    data: 0.00133452
    data: 0.057579122
    data: -0.25743318
    data: -0.76974875
    data: 0.19095969
    data: -0.33128434
    data: -0.993157
    data: 0.040052678
    data: 0.059358697
    data: -0.28581208
    data: 0.32960346
    data: 0.0052524884
    data: 0.38270494
    data: 0.29622936
    data: -0.0910781
    data: -0.60606259
    data: 0.43858129
    data: 0.13437614
    data: -0.41654432
    data: 0.058648817
    data: -0.01945552
    data: -0.033362191
    data: 0.19299184
    data: 0.25497618
    data: 0.080861941
    data: 0.14788365
    data: 0.1913026
    data: 0.21431711
    data: 0.025674973
    data: -0.010672737
    data: 0.080328032
    data: 0.05729511
    data: -0.16100611
    data: 0.06257648
    data: -0.054397788
    data: -0.13832052
    data: 0.019763345
    data: -0.13679625
    data: 0.048770346
    data: 0.2607995
    data: 0.0074616023
    data: -0.1437327
    data: -0.069751084
    data: -0.069546215
    data: -0.099097729
    data: -0.1038979
    data: -0.091306016
    data: 0.073826015
    data: 0.10473695
    data: -0.094693936
    data: 0.15766218
    data: 0.078255236
    data: 0.11248253
    data: 0.2190308
    data: -0.055639971
    data: -0.13670377
    data: 0.05276889
    data: -0.0022647514
    data: 0.082682088
    data: 0.054428916
    data: -0.082272641
    data: 0.079355225
    data: 0.014407838
    data: 0.064649872
    data: 0.089851171
    data: -0.043352261
    data: -0.023275044
    data: 0.057017595
    data: 0.073986612
    data: 0.052532963
    data: 0.073316619
    data: -0.0047729057
    data: -0.027927686
    data: 0.11545887
    data: 0.057810124
    data: 0.23113047
    data: -0.0041910466
    data: -0.48547605
    data: -0.9388274
    data: 0.0071121813
    data: -0.2307806
    data: -1.1300735
    shape {
      dim: 16
      dim: 10
      dim: 3
      dim: 3
    }
  }
  blobs {
    data: 1.0205368
    data: 2.4875836
    data: 2.3625851
    data: 0.42109942
    data: 1.0208588
    data: 1.5332694
    data: 2.4107158
    data: 2.399518
    data: 0.73819423
    data: 0.18999194
    data: 0.31878242
    data: 0.36088374
    data: 1.7095778
    data: -0.12023237
    data: 0.59946537
    data: 2.7174163
    shape {
      dim: 16
    }
  }
  phase: TRAIN
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "PReLU2"
  type: "PReLU"
  bottom: "conv2"
  top: "conv2"
  blobs {
    data: 0.067002393
    data: 0.20469856
    data: 0.25214297
    data: 0.041398451
    data: 0.194512
    data: 0.30079356
    data: 0.42497239
    data: 0.43376476
    data: 0.17539869
    data: -0.52597237
    data: 0.12982914
    data: 0.18990891
    data: -0.001037411
    data: -0.15794416
    data: -0.21194506
    data: -0.058352172
    shape {
      dim: 16
    }
  }
  phase: TRAIN
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  blobs {
    data: 0.0660219
    data: 0.13411468
    data: -0.12475339
    data: 0.46020421
    data: 0.36613876
    data: 0.20027189
    data: 0.39040023
    data: 0.2534391
    data: 0.34655082
    data: 0.13737181
    data: 0.0062584733
    data: 0.229078
    data: -0.052038535
    data: 0.048935216
    data: 0.10317655
    data: -0.18883549
    data: -0.089433782
    data: -0.074082278
    data: -0.42901888
    data: -0.13486288
    data: -0.57250482
    data: -0.33493519
    data: -0.091780938
    data: -0.052329224
    data: -0.23080285
    data: -0.06644588
    data: 0.041834872
    data: 0.05447327
    data: 0.0010965873
    data: 0.077510759
    data: -0.12205008
    data: -0.14300442
    data: -0.05356523
    data: 0.033869576
    data: -0.014516679
    data: -0.070755638
    data: 0.026616149
    data: 0.0655216
    data: -0.17070922
    data: 0.22076501
    data: 0.15678523
    data: 0.23495439
    data: 0.26238915
    data: 0.054191604
    data: 0.0862609
    data: 0.1066462
    data: -0.20105186
    data: 0.13675004
    data: 0.18288973
    data: -0.032682106
    data: -0.15350401
    data: 0.088472955
    data: 0.072029524
    data: -0.1540647
    data: 0.06847994
    data: 0.12541743
    data: 0.060607452
    data: 0.17809743
    data: -0.16616873
    data: -0.061337963
    data: 0.24961236
    data: -0.14242105
    data: 0.037908427
    data: 0.4018296
    data: 0.16296096
    data: 0.14844638
    data: -0.024138726
    data: 0.094198808
    data: 0.0701256
    data: -0.06132688
    data: -0.042804305
    data: -0.049810667
    data: 0.06570556
    data: 0.010435003
    data: 0.10319793
    data: -0.13004409
    data: -0.14361879
    data: -0.1198539
    data: -0.12258259
    data: 0.1444504
    data: -0.23431274
    data: -0.097853914
    data: -0.076451793
    data: 0.015987076
    data: -0.059360534
    data: -0.092615478
    data: 0.071082979
    data: -0.069414072
    data: 0.053317733
    data: 0.068122476
    data: 0.015103276
    data: -0.20886303
    data: -0.11545052
    data: 0.097288631
    data: 0.062341385
    data: -0.093959987
    data: -0.029677127
    data: 0.0094551519
    data: 0.17513812
    data: 0.0098848455
    data: -0.10836212
    data: 0.017712392
    data: -0.14988846
    data: -0.049547877
    data: -0.06052791
    data: 0.096563637
    data: 0.0720118
    data: 0.078513265
    data: 0.15122573
    data: -0.057337366
    data: -0.0091839619
    data: 0.04615574
    data: -0.17721996
    data: -0.12707724
    data: -0.014094613
    data: -0.20391154
    data: 0.095737189
    data: 0.11110594
    data: 0.027875
    data: 0.1014483
    data: 0.15509945
    data: 0.14572191
    data: 0.15414274
    data: 0.076846667
    data: 0.058301542
    data: 0.12578769
    data: 0.027494112
    data: -0.009174441
    data: 0.0274731
    data: 0.063844
    data: 0.061362732
    data: 0.037280317
    data: 0.25720814
    data: 0.14356478
    data: 0.089865252
    data: 0.20710176
    data: 0.2097223
    data: 0.27579385
    data: -0.085342743
    data: -0.16159889
    data: -0.018371139
    data: -0.1094102
    data: -0.07196369
    data: -0.24641235
    data: -0.010183448
    data: -0.029257249
    data: 0.021051571
    data: -0.015771499
    data: -0.016155116
    data: -0.03215047
    data: -0.07401339
    data: -0.087095156
    data: -0.13761795
    data: 0.053917509
    data: -0.053783972
    data: 0.033578962
    data: 0.065188274
    data: -0.029271152
    data: 0.090779662
    data: -0.22970493
    data: -0.15894468
    data: -0.23396936
    data: -0.13181253
    data: 0.10915761
    data: 0.11498893
    data: -0.055379968
    data: -0.011928865
    data: 0.069583848
    data: 0.046774305
    data: 0.069064729
    data: 0.049819328
    data: 0.052027825
    data: 0.013008787
    data: -0.046922453
    data: -0.044013459
    data: -0.02755877
    data: -0.089678824
    data: -0.14570408
    data: -0.11575571
    data: -0.66535896
    data: -0.066369534
    data: 0.0047682365
    data: 0.034845755
    data: -0.027298663
    data: -0.17169052
    data: -0.0042361785
    data: 0.056242842
    data: 0.1334528
    data: -0.11981358
    data: 0.067349516
    data: 0.053240631
    data: 0.069974944
    data: 0.10736044
    data: -0.051723119
    data: -0.24656291
    data: -0.086868435
    data: 0.14317772
    data: -0.0069769509
    data: 0.052812729
    data: 0.10840116
    data: -0.11217754
    data: 0.15624385
    data: 0.091361456
    data: -0.14800867
    data: 0.2607078
    data: 0.055214036
    data: -0.18447469
    data: -0.10124689
    data: -0.073726416
    data: 0.0098844124
    data: -0.023348646
    data: 0.066669635
    data: -0.13849266
    data: -0.0031198836
    data: 0.04143738
    data: 0.266755
    data: 0.190942
    data: 0.1342579
    data: 0.24052235
    data: -0.33496273
    data: -0.21755259
    data: -0.37110695
    data: 0.28549632
    data: 0.17144489
    data: 0.24568608
    data: -0.27856389
    data: -0.11478417
    data: -0.028474685
    data: -0.20656057
    data: -0.18845496
    data: -0.099923208
    data: -0.10975604
    data: -0.16689414
    data: -0.017919684
    data: 0.021054711
    data: -0.11954755
    data: 0.0020582022
    data: -0.055597689
    data: -0.13456263
    data: 0.017594919
    data: 0.055037994
    data: 0.078538105
    data: -0.0082143163
    data: -0.16562751
    data: -0.13077942
    data: -0.020428656
    data: -0.039421655
    data: 0.013450643
    data: 0.067458235
    data: -0.0503524
    data: -0.12330411
    data: -0.09779875
    data: 0.080944695
    data: 0.076640904
    data: -0.0888593
    data: 0.010595625
    data: -0.2449777
    data: -0.044024114
    data: 0.0088180844
    data: 0.038149919
    data: -0.2209008
    data: -0.095629312
    data: -0.13924082
    data: -0.041822024
    data: -0.1550826
    data: 0.021856172
    data: -0.11114044
    data: -0.027303459
    data: -0.010698083
    data: -0.021668304
    data: 0.0086881965
    data: 0.1780328
    data: 0.067576818
    data: 0.17805889
    data: 0.03334922
    data: -0.087926559
    data: 0.034345232
    data: 0.0056160809
    data: -0.052025147
    data: -0.14632459
    data: 0.069332331
    data: -0.071248144
    data: -0.21492961
    data: 0.083227478
    data: -0.097316869
    data: 0.21543778
    data: 0.16429187
    data: 0.066909604
    data: -0.037779797
    data: -0.0081365462
    data: 0.24365503
    data: 0.012253095
    data: -0.082713678
    data: 0.46623462
    data: 0.031089958
    data: -0.20598973
    data: 0.20763622
    data: -0.0051521757
    data: 0.0090829758
    data: -0.3212758
    data: 0.05412348
    data: -0.18474378
    data: 0.045812439
    data: -0.082804143
    data: 0.033453073
    data: 0.026130969
    data: -0.17499237
    data: -0.018419361
    data: 0.16903037
    data: -0.0050027757
    data: -0.05525
    data: -0.090120025
    data: 0.073399648
    data: -0.24514779
    data: -0.19231257
    data: -0.059243083
    data: -0.19243163
    data: -0.44921494
    data: -0.0093402406
    data: -0.0028575351
    data: -0.23142818
    data: 0.086102061
    data: 0.00031386115
    data: -0.32524836
    data: -0.16850796
    data: 0.010442673
    data: 0.301387
    data: 0.096427314
    data: -0.028830597
    data: 0.13194253
    data: 0.10490865
    data: -0.095318846
    data: -0.016508114
    data: 0.0849576
    data: -0.044193421
    data: -0.30256397
    data: 0.062830321
    data: 0.030537192
    data: -0.44729254
    data: 0.12804444
    data: 0.17482296
    data: -0.19989347
    data: -0.13587493
    data: 0.12213479
    data: -0.24749105
    data: 0.013917094
    data: 0.10515025
    data: 0.10952209
    data: -0.0058864262
    data: 0.038821075
    data: 0.31635693
    data: -0.013836918
    data: 0.12977175
    data: 0.18999961
    data: -0.13141207
    data: 0.13527669
    data: 0.30255556
    data: 0.051608581
    data: 0.2104205
    data: 0.093500078
    data: 0.10643371
    data: 0.12464998
    data: -0.33882567
    data: -0.071384713
    data: 0.078032769
    data: -0.066589125
    data: 0.099719964
    data: -0.036210641
    data: -0.20914812
    data: -0.067922637
    data: 0.066977926
    data: 0.11334069
    data: 0.026984595
    data: 0.11904231
    data: 0.31196734
    data: -0.079414509
    data: -0.021338236
    data: 0.055082
    data: 0.025482783
    data: -0.080989771
    data: -0.27497318
    data: 0.0046365238
    data: -0.076125778
    data: 0.0083828764
    data: 0.22108215
    data: 0.12258457
    data: -0.20217443
    data: -0.16767552
    data: -0.22504185
    data: -0.36937779
    data: 0.023178572
    data: -0.13291706
    data: -0.22731641
    data: 0.097366475
    data: -0.044156548
    data: -0.13779892
    data: -0.029055363
    data: -0.1294723
    data: -0.29295284
    data: -0.10376886
    data: 0.031803071
    data: -0.043579094
    data: -0.041422904
    data: -0.031767864
    data: -0.15774032
    data: -0.03510711
    data: -0.24222906
    data: -0.32658765
    data: 0.047273837
    data: -0.2073994
    data: -0.27376711
    data: 0.080955192
    data: -0.26636606
    data: -0.21766365
    data: -0.037608549
    data: -0.20483381
    data: -0.26812404
    data: 0.030276176
    data: -0.095658369
    data: -0.22501841
    data: 0.025549605
    data: 0.04882627
    data: -0.28603303
    data: 0.12782161
    data: 0.18536022
    data: 0.13287443
    data: -0.17696628
    data: -0.1467541
    data: 0.25432202
    data: -0.1032001
    data: -0.1059166
    data: 0.092641041
    data: 0.10769177
    data: 0.031411853
