name: "24Net"
layer {
  name: "data24"
  type: "HDF5Data"
  top: "label24"
  top: "data24"
  include {
    phase: TRAIN
  }
  phase: TRAIN
  hdf5_data_param {
    source: "/home_sdb/kpzhang/wider/data24-hnm8/train-24rgb.txt"
    batch_size: 420
  }
}
layer {
  name: "slicer_label"
  type: "Slice"
  bottom: "label24"
  top: "label1"
  top: "label2"
  top: "label3"
  phase: TRAIN
  slice_param {
    slice_point: 1
    slice_point: 5
    axis: 1
  }
}
layer {
  name: "label1_slicer_label_0_split"
  type: "Split"
  bottom: "label1"
  top: "label1_slicer_label_0_split_0"
  top: "label1_slicer_label_0_split_1"
  phase: TRAIN
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data24"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 1
  }
  blobs {
    data: -0.50315523
    data: -0.40888542
    data: -0.29232696
    data: 0.018869931
    data: 0.050603528
    data: 0.13554087
    data: 0.38067928
    data: 0.38602111
    data: 0.30795157
    data: -0.39909384
    data: -0.29660878
    data: -0.1840387
    data: -0.052070275
    data: -0.021748932
    data: 0.053204261
    data: 0.23890051
    data: 0.26442054
    data: 0.17145376
    data: -0.30383804
    data: -0.20137323
    data: -0.10062411
    data: -0.025409747
    data: 0.0049252892
    data: 0.099433996
    data: 0.21704096
    data: 0.25538656
    data: 0.17064406
    data: -0.058876716
    data: -0.41247311
    data: 0.1816916
    data: 0.40733403
    data: -0.47306195
    data: -0.32863659
    data: 0.45052311
    data: 0.31656733
    data: -0.12783068
    data: -0.15205367
    data: -0.2327479
    data: 0.41167483
    data: 0.22548176
    data: -0.40792471
    data: -0.10953198
    data: 0.13152753
    data: 0.15876782
    data: -0.067432836
    data: -0.10735033
    data: -0.1173566
    data: 0.5226227
    data: 0.20521328
    data: -0.37718639
    data: -0.056739368
    data: 0.016933147
    data: 0.032214858
    data: -0.16334173
    data: -0.35908765
    data: -0.060507823
    data: 0.276551
    data: -0.43405819
    data: -0.030373445
    data: 0.40060493
    data: -0.35572582
    data: -0.008122758
    data: 0.24744183
    data: -0.2925995
    data: 0.00057970075
    data: 0.24958803
    data: -0.30617136
    data: 0.08569514
    data: 0.39137092
    data: -0.23396002
    data: 0.064102285
    data: 0.20743632
    data: -0.25136068
    data: -0.011043297
    data: 0.17777593
    data: -0.25949192
    data: 0.073090151
    data: 0.31828991
    data: -0.1689844
    data: 0.066819608
    data: 0.16442223
    data: 0.38122734
    data: 0.15976506
    data: -0.043091625
    data: -0.32010579
    data: -0.64144236
    data: -0.10654292
    data: 0.035896517
    data: 0.29653454
    data: 0.23230442
    data: 0.34285548
    data: 0.1803647
    data: 0.0056352057
    data: -0.33486441
    data: -0.56963944
    data: -0.072418362
    data: -0.011291696
    data: 0.28828168
    data: 0.17740329
    data: 0.29665416
    data: 0.12311354
    data: -0.051201556
    data: -0.2991356
    data: -0.51295078
    data: -0.048344545
    data: -0.0054362486
    data: 0.31682771
    data: 0.20147133
    data: -0.043876756
    data: -0.071801364
    data: -0.026131552
    data: -0.069286086
    data: 0.033479024
    data: -0.058976695
    data: -0.13964094
    data: -0.069585815
    data: -0.042617086
    data: 0.29443979
    data: 0.22434989
    data: 0.26598993
    data: 0.27423212
    data: 0.30453396
    data: 0.22156908
    data: 0.25362736
    data: 0.25298333
    data: 0.27569219
    data: -0.18327111
    data: -0.24971865
    data: -0.17258228
    data: -0.21518894
    data: -0.2032229
    data: -0.24348541
    data: -0.14056593
    data: -0.18914309
    data: -0.16936311
    data: -0.0857151
    data: 0.40923655
    data: -0.29418308
    data: -0.17997953
    data: 0.48036036
    data: -0.34187406
    data: -0.091498047
    data: 0.29033086
    data: -0.1628945
    data: -0.15051182
    data: 0.37578982
    data: -0.2599712
    data: -0.25307229
    data: 0.45382422
    data: -0.28553835
    data: -0.13661669
    data: 0.28513381
    data: -0.10195025
    data: -0.10877349
    data: 0.35747948
    data: -0.20591052
    data: -0.19696648
    data: 0.44684365
    data: -0.22864087
    data: -0.14472111
    data: 0.23914871
    data: -0.12008759
    data: 0.10534695
    data: 0.22511238
    data: 0.37086493
    data: -0.14340745
    data: 0.070025317
    data: 0.23541789
    data: -0.47568268
    data: -0.00770967
    data: 0.15935025
    data: -0.043131139
    data: -0.098926619
    data: -0.078074664
    data: -0.0041801468
    data: -0.074126385
    data: -0.086951762
    data: -0.077186242
    data: 0.069290742
    data: -0.0018053441
    data: 0.0085949972
    data: -0.11411318
    data: -0.17361785
    data: 0.14869934
    data: -0.02870414
    data: -0.1715717
    data: 0.13669735
    data: 0.15610668
    data: -0.050675552
    data: -0.26233914
    data: -0.38928536
    data: -0.36228928
    data: 0.14159581
    data: -0.0041760388
    data: -0.1251357
    data: 0.41857159
    data: 0.21517941
    data: 0.080721341
    data: -0.22636931
    data: -0.31143236
    data: -0.31000984
    data: 0.18721625
    data: 0.082321823
    data: -0.061488543
    data: 0.42192277
    data: 0.23728941
    data: 0.080859832
    data: -0.14205158
    data: -0.22697003
    data: -0.2480882
    data: 0.196438
    data: 0.095428236
    data: -0.064611293
    data: 0.33035815
    data: 0.14818217
    data: 0.0038308126
    data: 0.25792059
    data: 0.36518267
    data: 0.04547355
    data: 0.33057722
    data: 0.032145396
    data: -0.31739557
    data: -0.04575463
    data: -0.31891495
    data: -0.26366952
    data: 0.23266967
    data: 0.36570013
    data: 0.097734295
    data: 0.24726135
    data: -0.025122026
    data: -0.28563124
    data: -0.17163013
    data: -0.38237414
    data: -0.19268999
    data: 0.25981137
    data: 0.29648429
    data: -0.049342029
    data: 0.29222062
    data: -0.034282796
    data: -0.3124176
    data: -0.10544807
    data: -0.31248397
    data: -0.10067712
    data: -0.31676286
    data: -0.21942805
    data: -0.33228338
    data: -0.28438851
    data: -0.32751036
    data: -0.34974211
    data: -0.34578758
    data: -0.38580364
    data: -0.31809318
    data: 0.21850716
    data: 0.23407458
    data: 0.17687416
    data: 0.28256586
    data: 0.1492227
    data: 0.1900004
    data: 0.24155307
    data: 0.11872807
    data: 0.23886225
    data: 0.045035295
    data: 0.10195388
    data: 0.0912092
    data: 0.16988394
    data: 0.083297424
    data: 0.15577561
    data: 0.16289522
    data: 0.079301238
    data: 0.23610583
    data: 0.12039311
    data: -0.29035386
    data: -0.27532765
    data: 0.2832596
    data: 0.073402263
    data: -0.28181738
    data: 0.20592685
    data: 0.28259313
    data: -0.064030975
    data: 0.0509582
    data: -0.36626208
    data: -0.33354637
    data: 0.29194614
    data: 0.072788909
    data: -0.2883921
    data: 0.20838329
    data: 0.30680689
    data: -0.025846142
    data: 0.099634372
    data: -0.28947407
    data: -0.23462893
    data: 0.3085824
    data: 0.091824181
    data: -0.28199822
    data: 0.20326516
    data: 0.26010683
    data: -0.12160687
    data: -0.17889054
    data: -0.023203263
    data: -0.19436796
    data: -0.33119285
    data: -0.16517137
    data: -0.21989828
    data: -0.081519507
    data: -0.030758765
    data: -0.12404117
    data: 0.38037735
    data: 0.3915374
    data: 0.21721776
    data: 0.1888323
    data: 0.21983191
    data: 0.164888
    data: 0.35994393
    data: 0.28124171
    data: 0.18425749
    data: -0.020197961
    data: 0.017987235
    data: -0.087586075
    data: -0.19486354
    data: -0.14383541
    data: -0.14538698
    data: -0.039552558
    data: -0.10586834
    data: -0.15682124
    data: 0.032065921
    data: 0.16298525
    data: 0.21100555
    data: 0.10594487
    data: 0.23571475
    data: 0.25813231
    data: 0.06026518
    data: 0.182688
    data: 0.20323481
    data: -0.17526747
    data: -0.35336345
    data: -0.31177869
    data: -0.19251294
    data: -0.38553002
    data: -0.37831318
    data: -0.22337213
    data: -0.36153772
    data: -0.29867685
    data: 0.16700719
    data: 0.10220242
    data: 0.089380585
    data: 0.16768561
    data: 0.099715658
    data: 0.051273558
    data: 0.16471829
    data: 0.12131327
    data: 0.09427233
    data: 0.054851
    data: 0.03709675
    data: -0.027975192
    data: 0.065630488
    data: 0.032690093
    data: -0.036153529
    data: 0.039748143
    data: -0.0065351189
    data: -0.09869843
    data: 0.14343578
    data: 0.124167
    data: 0.018257791
    data: 0.1693863
    data: 0.1343243
    data: 0.023932394
    data: 0.1086734
    data: 0.069722168
    data: -0.0585189
    data: 0.14567985
    data: 0.12412373
    data: 0.0107555
    data: 0.18293342
    data: 0.14812477
    data: 0.025156312
    data: 0.11191501
    data: 0.071442224
    data: -0.064073861
    data: 0.23810369
    data: -0.29947868
    data: 0.072116487
    data: 0.36335286
    data: -0.62054729
    data: 0.28486866
    data: 0.1670921
    data: -0.39230108
    data: 0.22245687
    data: 0.20861009
    data: -0.29852685
    data: 0.0773597
    data: 0.33823332
    data: -0.64943928
    data: 0.2698434
    data: 0.143444
    data: -0.39986381
    data: 0.23936233
    data: 0.13675664
    data: -0.22048739
    data: 0.068773888
    data: 0.29024261
    data: -0.49631745
    data: 0.30104479
    data: 0.07546705
    data: -0.32166255
    data: 0.23438369
    data: -0.44942728
    data: -0.1949458
    data: 0.081392147
    data: -0.036097188
    data: 0.2032631
    data: 0.00011465776
    data: 0.26231474
    data: 0.042949174
    data: -0.15979521
    data: -0.19155374
    data: 0.053519081
    data: 0.28087115
    data: 0.077479139
    data: 0.29519647
    data: 0.092419185
    data: 0.18822087
    data: 0.0019231176
    data: -0.14854957
    data: -0.23193383
    data: -0.021274256
    data: 0.17914574
    data: -0.03807747
    data: 0.16704296
    data: -0.032100022
    data: 0.051988885
    data: -0.12151803
    data: -0.249956
    data: -0.015181262
    data: 0.32351738
    data: 0.37596521
    data: -0.424904
    data: -0.029345812
    data: 0.33420169
    data: -0.3376379
    data: -0.31507635
    data: 0.10691907
    data: -0.048972789
    data: 0.25205711
    data: 0.2145845
    data: -0.3820726
    data: -0.077803232
    data: 0.18989213
    data: -0.11917385
    data: -0.24789977
    data: 0.031255461
    data: -0.061771493
    data: 0.28089967
    data: 0.27715394
    data: -0.33306083
    data: -0.045514833
    data: 0.2088813
    data: -0.077483349
    data: -0.22618081
    data: -0.0026668187
    data: -0.63856179
    data: -0.12297164
    data: 0.41953722
    data: -0.46555582
    data: 0.054878648
    data: 0.47152057
    data: -0.25854725
    data: 0.10700635
    data: 0.44797724
    data: -0.3363418
    data: -0.081005894
    data: 0.1967216
    data: -0.27273923
    data: 0.031914629
    data: 0.23597978
    data: -0.14954504
    data: 0.08192303
    data: 0.23214395
    data: -0.2262053
    data: -0.045143262
    data: 0.15155213
    data: -0.18890625
    data: 0.0694808
    data: 0.20088443
    data: -0.15388937
    data: 0.075374424
    data: 0.20276047
    data: -0.17546448
    data: -0.12370445
    data: -0.13664068
    data: -0.22889774
    data: -0.13899782
    data: -0.22829492
    data: -0.27665508
    data: -0.078021415
    data: -0.11448149
    data: 0.056564912
    data: 0.084011525
    data: 0.063935563
    data: 0.040588886
    data: 0.09907978
    data: 0.0058289994
    data: -0.0077680089
    data: 0.16087309
    data: 0.11661287
    data: 0.12265971
    data: 0.12955119
    data: 0.085651115
    data: 0.14628501
    data: 0.16836439
    data: 0.042195216
    data: 0.083142094
    data: 0.2122079
    data: 0.12965485
    data: 0.55790353
    data: 0.083301827
    data: -0.3740322
    data: 0.5515933
    data: -0.036917455
    data: -0.49665344
    data: 0.45405751
    data: -0.16028093
    data: -0.47396576
    data: -0.22748417
    data: -0.039573371
    data: 0.19128439
    data: -0.25032827
    data: -0.012398401
    data: 0.20328021
    data: -0.19649462
    data: -0.017944349
    data: 0.2303559
    data: -0.32175595
    data: -0.054508194
    data: 0.17601715
    data: -0.30255648
    data: 0.063015476
    data: 0.26857558
    data: -0.21786362
    data: 0.0811887
    data: 0.30054483
    data: 0.347486
    data: 0.1024916
    data: -0.27594227
    data: 0.38742551
    data: 0.035788458
    data: -0.3905687
    data: 0.3647157
    data: -0.12437797
    data: -0.37490889
    data: 0.22576666
    data: 0.07116773
    data: -0.21104608
    data: 0.27185291
    data: 0.035720613
    data: -0.30048382
    data: 0.27046934
    data: -0.1199213
    data: -0.28944391
    data: 0.18821259
    data: 0.03025849
    data: -0.17149664
    data: 0.23435467
    data: 0.010188119
    data: -0.22048683
    data: 0.21265875
    data: -0.12965214
    data: -0.2102219
    data: 0.40253899
    data: 0.32686734
    data: 0.32136834
    data: 0.097377293
    data: -0.022388944
    data: 0.03433286
    data: -0.49588674
    data: -0.34414703
    data: -0.26891828
    data: 0.23853302
    data: 0.19827203
    data: 0.17403591
    data: 0.022355739
    data: -0.059669688
    data: -0.0041116243
    data: -0.33271053
    data: -0.14277968
    data: -0.09970025
    data: 0.14470692
    data: 0.11473262
    data: 0.12736745
    data: 0.0066303713
    data: -0.066089854
    data: 0.00549803
    data: -0.23541822
    data: -0.047411591
    data: -0.010821262
    data: -0.31516588
    data: -0.20102684
    data: -0.055345744
    data: 0.57018924
    data: 0.49482945
    data: 0.18370384
    data: -0.20548575
    data: -0.30521464
    data: -0.10542048
    data: -0.31592852
    data: -0.19714369
    data: -0.079436429
    data: 0.49595076
    data: 0.42814213
    data: 0.099262387
    data: -0.20864959
    data: -0.23713292
    data: -0.069823578
    data: -0.3243385
    data: -0.18960436
    data: -0.049452636
    data: 0.43013877
    data: 0.37366056
    data: 0.094742656
    data: -0.18859406
    data: -0.20204546
    data: -0.0015692083
    data: 0.14890908
    data: -0.077285349
    data: -0.23783146
    data: 0.12084903
    data: 0.47375488
    data: 0.042259373
    data: -0.48536932
    data: -0.03160077
    data: 0.10798657
    data: 0.11860653
    data: -0.12050293
    data: -0.27966031
    data: 0.16361412
    data: 0.46924335
    data: -0.0076765022
    data: -0.35140783
    data: 0.047548633
    data: 0.10156961
    data: 0.0830096
    data: -0.12047051
    data: -0.23282917
    data: 0.11918881
    data: 0.41826561
    data: -0.031353448
    data: -0.32772371
    data: 0.028930239
    data: 0.04470668
    data: 0.052409008
    data: -0.17862752
    data: 0.11352116
    data: -0.2638512
    data: 0.18703473
    data: 0.09663333
    data: -0.17596067
    data: 0.4427928
    data: -0.28020069
    data: 0.11748125
    data: -0.16738771
    data: 0.066224083
    data: -0.22330573
    data: 0.20296364
    data: 0.0095826332
    data: -0.15078844
    data: 0.48042938
    data: -0.36655921
    data: 0.10990776
    data: -0.1752189
    data: 0.01191747
    data: -0.1898545
    data: 0.19512318
    data: 0.0062733027
    data: -0.14507028
    data: 0.46268731
    data: -0.32232782
    data: 0.32512429
    data: 0.2676588
    data: 0.27854398
    data: -0.13012907
    data: -0.031983666
    data: 0.0089502949
    data: -0.24941209
    data: -0.24881651
    data: -0.31992668
    data: 0.32187411
    data: 0.26687086
    data: 0.28174391
    data: -0.11453621
    data: 0.0035129942
    data: 0.039684981
    data: -0.24858882
    data: -0.21462573
    data: -0.26405102
    data: 0.26195821
    data: 0.18029295
    data: 0.18385978
    data: -0.10864939
    data: -0.0073062461
    data: 0.026888823
    data: -0.16960838
    data: -0.15216495
    data: -0.21380006
    data: -0.052442066
    data: -0.058925569
    data: -0.024163406
    data: -0.0835361
    data: -0.15077634
    data: -0.15426138
    data: 0.077920206
    data: 0.0025038535
    data: -0.068585455
    data: -0.13539267
    data: -0.11961661
    data: -0.079532839
    data: -0.1595937
    data: -0.19127066
    data: -0.18691033
    data: 0.0083094221
    data: -0.026925605
    data: -0.074353091
    data: -0.053474315
    data: 0.014904662
    data: 0.066475488
    data: -0.073947065
    data: -0.045510996
    data: -0.019194236
    data: 0.062478572
    data: 0.079511166
    data: 0.060301051
    data: 0.36327609
    data: 0.24727976
    data: 0.048539244
    data: 0.23974773
    data: -0.040413655
    data: -0.2329247
    data: -0.081333995
    data: -0.4239012
    data: -0.38773558
    data: 0.32775775
    data: 0.24822955
    data: 0.039583281
    data: 0.26063168
    data: 0.041643623
    data: -0.15739207
    data: -0.045826461
    data: -0.3242217
    data: -0.30318162
    data: 0.22116642
    data: 0.18399906
    data: 0.005383159
    data: 0.23793837
    data: 0.062099911
    data: -0.13779624
    data: 0.016365645
    data: -0.24235682
    data: -0.25710273
    shape {
      dim: 28
      dim: 3
      dim: 3
      dim: 3
    }
  }
  blobs {
    data: -0.35307598
    data: 0.056812536
    data: -0.37000194
    data: 0.010822841
    data: 0.07664489
    data: -0.0065514981
    data: -0.031521756
    data: -0.24418317
    data: 0.00069607439
    data: 0.49110442
    data: 0.009181519
    data: 0.4126676
    data: -0.31488669
    data: -0.08050286
    data: 0.027027847
    data: 0.10753667
    data: -0.4272992
    data: 0.10672962
    data: 0.41831046
    data: 0.073638387
    data: -0.00050130114
    data: 0.13836658
    data: 0.018391866
    data: 0.1294641
    data: 0.0048547
    data: -0.06891343
    data: -0.56729811
    data: -0.29254776
    shape {
      dim: 28
    }
  }
  phase: TRAIN
  convolution_param {
    num_output: 28
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "prelu1"
  type: "PReLU"
  bottom: "conv1"
  top: "conv1"
  blobs {
    data: 1.2957295
    data: 0.090654
    data: -0.12666987
    data: 0.024778163
    data: -0.29429224
    data: 0.064689443
    data: 0.010410221
    data: -0.19272511
    data: 0.4298884
    data: 0.82758981
    data: 0.12819117
    data: -0.15820393
    data: 0.00014605754
    data: 0.096176848
    data: 0.10252927
    data: 0.13980727
    data: 1.2625945
    data: -0.1993653
    data: -0.35730359
    data: -0.39996937
    data: 0.18831784
    data: 0.10027734
    data: 0.069785096
    data: 0.076378182
    data: 0.04540512
    data: -0.65118682
    data: 0.074833423
    data: -0.08944089
    shape {
      dim: 28
    }
  }
  phase: TRAIN
  propagate_down: false
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  phase: TRAIN
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 1
  }
  blobs {
    data: 0.057015039
    data: -0.057944704
    data: 0.0099071367
    data: -0.080850817
    data: -0.017630018
    data: -0.0073029273
    data: -0.10296592
    data: -0.02346109
    data: -0.030635748
    data: -0.12680408
    data: 0.079980075
    data: 0.0618438
    data: -0.1888587
    data: -0.024775295
    data: 0.028912105
    data: -0.055196635
    data: -0.042608943
    data: 0.040017564
    data: -0.26047441
    data: -0.0047660512
    data: 0.05084455
    data: -0.24460754
    data: -0.060843103
    data: -0.060844772
    data: -0.25602841
    data: 0.0071551981
    data: 0.014280225
    data: 0.071137317
    data: 0.00843179
    data: 0.022927534
    data: -0.032722458
    data: -0.00869606
    data: 0.0036072792
    data: -0.12867868
    data: 0.042239927
    data: 0.041392896
    data: 0.030250531
    data: 0.0025705413
    data: 0.0095402244
    data: 0.020921282
    data: -0.010673088
    data: -0.018529154
    data: 0.021896906
    data: -0.00525295
    data: -0.019048892
    data: -0.083414517
    data: 0.00078187906
    data: 0.033319324
    data: -0.12923992
    data: -0.024127223
    data: 0.044317067
    data: -0.10395282
    data: -0.024835855
    data: 0.026460422
    data: -0.043456443
    data: 0.0060742362
    data: -0.020177461
    data: -0.0025623275
    data: 0.034694444
    data: -0.0076809847
    data: 0.026724124
    data: 0.030420303
    data: -0.0019415669
    data: 0.0034581129
    data: 0.090692878
    data: -0.014190652
    data: 0.039867975
    data: 0.065102763
    data: 0.01803283
    data: 0.13317023
    data: 0.071193129
    data: 0.040739369
    data: -0.097046666
    data: -0.060260978
    data: -0.0040598591
    data: -0.14913358
    data: -0.07902813
    data: -0.00080451067
    data: -0.14718504
    data: -0.059591744
    data: 0.031900428
    data: -0.023811551
    data: 0.0042442749
    data: 0.013107907
    data: -0.052796636
    data: 0.0028784405
    data: 0.0038089629
    data: -0.013223997
    data: -0.0082034767
    data: 0.010652821
    data: -0.13500221
    data: -0.024353633
    data: 0.040325433
    data: -0.062526584
    data: -0.10946593
    data: -0.038628057
    data: 0.072187133
    data: -0.013756769
    data: -0.0018770216
    data: 0.0094947685
    data: -0.0089156553
    data: 0.040771879
    data: -0.053516526
    data: -0.058099806
    data: -0.034045178
    data: -0.011270953
    data: -0.0456443
    data: -0.025129016
    data: -0.039756011
    data: 0.0020614068
    data: 0.015100525
    data: -0.036502514
    data: 0.017529551
    data: 0.0092746885
    data: -0.029204251
    data: 0.021358477
    data: 0.00843086
    data: -0.0023041226
    data: 0.0036141274
    data: -0.006266817
    data: -0.0014191042
    data: -0.018067786
    data: -0.01727706
    data: -0.019337801
    data: -0.0076188613
    data: 0.016116066
    data: -0.069930613
    data: -0.028049586
    data: 0.0077734413
    data: -0.14432944
    data: -0.044285692
    data: 0.02771589
    data: -0.15096895
    data: -0.0058715455
    data: 0.062242635
    data: 0.063943557
    data: 0.037572373
    data: 0.011170218
    data: -0.030206755
    data: -0.0004608797
    data: 0.018553756
    data: -0.019428477
    data: -0.040110763
    data: -0.027474809
    data: 0.10786401
    data: -0.06353683
    data: 0.0085537443
    data: 0.1429351
    data: -0.13006867
    data: -0.00418679
    data: 0.1924624
    data: -0.036824606
    data: -0.0041733049
    data: 0.26209828
    data: 0.0066159843
    data: -0.017678583
    data: 0.22558406
    data: -0.036139183
    data: -0.012405289
    data: 0.23357587
    data: -0.081258096
    data: -0.034942448
    data: 0.0085346987
    data: -0.0097635873
    data: 0.024530724
    data: -0.0013901616
    data: -0.019343931
    data: -0.0034657165
    data: 0.041056853
    data: 0.0022236537
    data: 0.019693801
    data: -0.17067654
    data: -0.0082240235
    data: -0.020750307
    data: -0.15894286
    data: 0.029238671
    data: -0.01997517
    data: -0.18781814
    data: 0.02685572
    data: 0.0083975233
    data: -0.041830093
    data: -0.058735136
    data: -0.036274176
    data: -0.016973207
    data: -0.061688248
    data: -0.025608974
    data: -0.11566371
    data: -0.098617285
    data: -0.051018294
    data: -0.14766081
    data: 0.019219954
    data: -0.0027887044
    data: -0.10329719
    data: 0.0011001348
    data: -0.012808732
    data: 0.054826543
    data: 0.059751939
    data: 0.034865942
    data: 0.0097952923
    data: 0.025709458
    data: -0.003553431
    data: -0.003629386
    data: 0.0081648985
    data: 0.014054908
    data: -0.010865244
    data: 0.041215658
    data: -0.02067245
    data: -0.059910741
    data: 0.041109443
    data: 0.031842332
    data: -0.019176805
    data: -0.0451456
    data: -0.018099358
    data: 0.027208023
    data: 0.016686669
    data: 0.0087320516
    data: 0.023660405
    data: 0.0018478603
    data: 0.012126959
    data: -0.011095267
    data: -0.022250896
    data: -0.0036837684
    data: 0.030135944
    data: -0.025132535
    data: 0.030774241
    data: 0.050332718
    data: 0.005491022
    data: 0.010615357
    data: -0.092344508
    data: -0.0068349042
    data: -0.025530441
    data: -0.078036241
    data: 0.051852521
    data: 0.012419263
    data: 0.079797171
    data: -0.018221671
    data: -0.011634539
    data: 0.098504543
    data: 0.026406946
    data: 0.0013542452
    data: 0.08697889
    data: 0.0070149251
    data: 0.0055570919
    data: 0.13143234
    data: 0.064872362
    data: 0.045198642
    data: 0.081465974
    data: 0.077116579
    data: 0.020196022
    data: 0.031806357
    data: 0.081679352
    data: 0.0088947276
    data: -0.036901366
    data: 0.035299066
    data: 0.021871628
    data: -0.0674051
    data: 0.012240612
    data: 0.013019074
    data: -0.049902987
    data: 0.011235078
    data: 0.0052871415
    data: -0.055869009
    data: -0.001005185
    data: 0.0574903
    data: -0.0041889
    data: -0.0010625216
    data: 0.012145145
    data: -0.043413755
    data: -0.050829761
    data: -0.037522119
    data: -0.043267451
    data: -0.054554969
    data: -0.0087015238
    data: -0.028813938
    data: -0.089122996
    data: -0.012102943
    data: -0.04219139
    data: -0.074278422
    data: -0.030199498
    data: -0.037736394
    data: -0.0082716644
    data: 0.034668885
    data: -0.049356032
    data: 0.0039506583
    data: 0.015828434
    data: -0.021883886
    data: 0.0093844552
    data: 0.039326165
    data: 0.025266975
    data: -0.11669578
    data: -0.16183698
    data: 0.012005061
    data: -0.11030732
    data: -0.15416998
    data: 0.068078972
    data: -0.0868503
    data: -0.13027702
    data: 0.0035498757
    data: 0.0027899148
    data: 0.027364288
    data: 0.00064812542
    data: 0.0042737829
    data: 0.031129716
    data: 0.00073467492
    data: -0.03523222
    data: 0.029565789
    data: -0.10784013
    data: -0.052989535
    data: -0.046690192
    data: -0.069015138
    data: -0.0064937691
    data: 0.032446302
    data: -0.033349991
    data: 0.0030699952
    data: -0.0022963337
    data: -0.020731822
    data: 0.0062239938
    data: 0.011259822
    data: 0.00036530555
    data: -0.028627597
    data: -0.072982557
    data: 0.061804712
    data: -0.044214904
    data: -0.0082685864
    data: 0.0089419428
    data: 0.047164928
    data: 0.01615594
    data: -0.046108525
    data: 0.00033698088
    data: 0.014399386
    data: -0.067474991
    data: 0.022099644
    data: 0.0041123475
    data: 0.24057454
    data: -0.060458168
    data: -0.2575137
    data: 0.15793566
    data: -0.12290805
    data: -0.3323181
    data: 0.25775221
    data: -0.0039163209
    data: -0.13069674
    data: -0.019021722
    data: -0.053027287
    data: -0.031499773
    data: 0.01366103
    data: 0.016380312
    data: 0.01116945
    data: 0.067974731
    data: 0.061697088
    data: 0.02064994
    data: 0.20301573
    data: 4.9960967e-05
    data: -0.13629726
    data: 0.12551315
    data: -0.048669934
    data: -0.22818133
    data: 0.20289953
    data: 0.0035373212
    data: -0.15229574
    data: -0.087467037
    data: -0.087964647
    data: -0.056270014
    data: -0.072475016
    data: -0.082647532
    data: -0.05558072
    data: -0.070171617
    data: -0.098203793
    data: -0.085432477
    data: -0.10103468
    data: -0.011012474
    data: 0.015036735
    data: -0.094099648
    data: -0.021680567
    data: -0.041940968
    data: -0.0765492
    data: -0.016664566
    data: 0.00026373379
    data: 0.03344794
    data: -0.029580288
    data: 0.0013782239
    data: 0.034061581
    data: -0.0046441834
    data: 0.030752251
    data: 0.0208356
    data: 0.00076754956
    data: -0.0054716035
    data: 0.044214517
    data: 0.0006751467
    data: -0.023036063
    data: -0.035593517
    data: -0.053875
    data: -0.022010885
    data: -0.058979176
    data: -0.054954667
    data: -0.046796225
    data: -0.023772541
    data: -0.0003670234
    data: 0.011475682
    data: 0.0067727952
    data: 0.00088841375
    data: -0.025147956
    data: 0.010535283
    data: 0.0305058
    data: -0.037607867
    data: 0.0784071
    data: 0.058001716
    data: 0.010636975
    data: 0.069952957
    data: 0.057577178
    data: 0.0633651
    data: 0.027954701
    data: 0.043148518
    data: 0.012156384
    data: -0.0013993762
    data: -0.0521729
    data: -0.055863257
    data: -0.028669443
    data: -0.093758628
    data: -0.13446753
    data: 0.054077368
    data: -0.023024455
    data: -0.036839865
    data: -0.34965158
    data: -0.16570528
    data: -0.062949039
    data: -0.32093263
    data: -0.13091135
    data: 0.0079611987
    data: -0.31833714
    data: -0.11892752
    data: 0.018340824
    data: 0.027410423
    data: 0.0051107151
    data: -0.030208027
    data: 0.040681481
    data: -0.0089361975
    data: 0.0080129309
    data: -0.017352097
    data: -0.019877214
    data: 0.0058348416
    data: -0.010984779
    data: 0.016827079
    data: 0.0091565354
    data: -0.014186522
    data: 0.0032938353
    data: 0.025072983
    data: 0.035523936
    data: 0.050495878
    data: 0.068908222
    data: 0.043311011
    data: 0.057849858
    data: 0.08748585
    data: -0.043708798
    data: -0.016555203
    data: 0.039272565
    data: -0.037720472
    data: 0.022811767
    data: 0.039466355
    data: -0.057984754
    data: -0.028976621
    data: 0.05795626
    data: 0.0066805035
    data: -0.04342078
    data: 0.059175428
    data: 0.08277341
    data: 0.0090160947
    data: 0.024596673
    data: 0.047143135
    data: -0.020604271
    data: -0.019355852
    data: 0.035974342
    data: -0.025167247
    data: -0.033678278
    data: -0.01476376
    data: -0.021697314
    data: -0.034060519
    data: -0.0040120604
    data: 0.024708642
    data: 0.00652767
    data: -0.0075604212
    data: 0.063275807
    data: -0.03401592
    data: -0.035278797
    data: 0.0032687944
    data: -0.0063507608
    data: -0.011241996
    data: 0.011790246
    data: -0.042774148
    data: 0.014285596
    data: 0.031673376
    data: -0.065992095
    data: -0.012414438
    data: 0.0036146359
    data: -0.04865681
    data: 0.023790589
    data: -0.0601639
    data: -0.054802425
    data: -0.0025049406
    data: -0.0030318985
    data: -0.056696441
    data: -0.040290531
    data: 0.0071419873
    data: 0.014253194
    data: 0.15816815
    data: 0.0469307
    data: 0.079326563
    data: 0.036324441
    data: 0.004903581
    data: 0.0099672135
    data: 0.048042782
    data: 0.031384341
    data: 0.02646324
    data: -0.026666882
    data: -0.045678459
    data: -0.10876292
    data: -0.096771114
    data: -0.076403327
    data: -0.13141754
    data: -0.0027785157
    data: -0.027671183
    data: -0.06184566
    data: -0.026190262
    data: -0.02358927
    data: -0.045413524
    data: -0.078343272
    data: -0.041376211
    data: -0.012919726
    data: -0.028697988
    data: 0.0040714233
    data: 0.037264433
    data: 0.053557795
    data: 0.026607551
    data: 0.078754507
    data: 0.037615627
    data: 0.030707791
    data: 0.08169996
    data: 0.072291523
    data: 0.056402732
    data: 0.1312393
    data: -0.014472432
    data: 0.038215354
    data: 0.033967115
    data: -0.039281491
    data: 0.015188022
    data: 0.014440638
    data: -0.056244276
    data: 0.011358669
    data: 0.025392229
    data: -0.023906738
    data: -0.048292644
    data: -0.23652683
    data: -0.058344234
    data: -0.054498147
    data: -0.2206658
    data: -0.061264664
    data: -0.099764675
    data: -0.20625204
    data: 0.0068126125
    data: 0.018859155
    data: 0.029238317
    data: 0.0090347193
    data: 0.0078644268
    data: 0.0091918977
    data: 0.031951517
    data: 0.025394255
    data: -0.0014994027
    data: -0.039506897
    data: -0.011606982
    data: 0.036435384
    data: -0.022050925
    data: -0.015251633
    data: 0.028782237
    data: 0.022434978
    data: -0.0053273626
    data: 0.0068955421
    data: 0.080489255
    data: 0.026382968
    data: 0.020698685
    data: 0.083845749
    data: 0.077575319
    data: 0.094702654
    data: 0.059214327
    data: 0.025232339
    data: 0.024836674
    data: 0.08804936
    data: 0.075985946
    data: 0.0030033169
    data: -0.058934886
    data: -0.0372005
    data: -0.065872081
    data: -0.036636379
    data: 0.060344175
    data: 0.04048318
    data: -0.11050381
    data: -0.10986996
    data: -0.11359125
    data: -0.10519473
    data: -0.054557979
    data: -0.064612731
    data: -0.019453786
    data: -0.024119262
    data: -0.051603023
    data: -0.0068264632
    data: 0.031597108
    data: -0.0011403501
    data: -0.06928166
    data: -0.020361135
    data: -0.038290773
    data: -0.067448713
    data: -0.019662587
    data: -0.011216706
    data: 0.050358284
    data: 0.032562573
    data: -0.00093203963
    data: 0.032907613
    data: 0.028345117
    data: 0.0069424533
    data: 0.036468714
    data: 0.038134258
    data: 0.020867899
    data: -0.020971838
    data: -0.0074792197
    data: -0.009111478
    data: -0.0077838688
    data: -0.0079898117
    data: -0.021960266
    data: 0.0074254866
    data: -0.0074584261
    data: -0.010712413
    data: 0.00407637
    data: -0.0805898
    data: -0.12217985
    data: -0.056273047
    data: -0.10172041
    data: -0.12181332
    data: -0.0748213
    data: -0.12722757
    data: -0.1707783
    data: 0.049467441
    data: 0.045643792
    data: -0.0053969645
    data: -0.031747151
    data: 1.9948866e-05
    data: -0.027116461
    data: -0.043224629
    data: -0.017419454
    data: -0.020062
    data: -0.091439344
    data: -0.10960446
    data: -0.10295418
    data: -0.067133129
    data: -0.06361533
    data: -0.056754559
    data: -0.05488104
    data: -0.096653685
    data: -0.093248107
    data: -0.042757869
    data: -0.00801156
    data: -0.046732992
    data: -0.066975407
    data: -0.034558479
    data: -0.0013538139
    data: -0.10302711
    data: -0.03705243
    data: -0.092814066
    data: 0.046819728
    data: 0.044563994
    data: -0.0058489614
    data: -0.020402079
    data: -0.0042907442
    data: -0.032940783
    data: -0.034124192
    data: 0.0095354281
    data: -0.0055736629
    data: -0.00027667402
    data: -0.021523125
    data: -0.080722041
    data: -0.036757793
    data: -0.018499402
    data: -0.048140518
    data: -0.0057299971
    data: 0.020600688
    data: -0.025144663
    data: -0.12959085
    data: -0.080419816
    data: -0.18146373
    data: -0.13864823
    data: -0.11677582
    data: -0.15338272
    data: -0.10357735
    data: -0.079749458
    data: -0.16266409
    data: 0.0056763431
    data: 0.015601484
    data: 0.11538603
    data: 0.041576196
    data: 0.0595813
    data: 0.11004826
    data: 0.11314293
    data: 0.11534546
    data: 0.13816628
    data: 0.099621654
    data: 0.049360018
    data: 0.064990029
    data: 0.050887261
    data: 0.019428413
    data: 0.065681957
    data: 0.041255411
    data: 0.0059390962
    data: 0.05294247
    data: -0.032235887
    data: -0.015893167
    data: -0.02647958
    data: -0.040538326
    data: -0.050752547
    data: -0.067622416
    data: -0.001718489
    data: 0.026010662
    data: -0.035341226
    data: -0.035595868
    data: -0.0071142372
    data: -0.10765921
    data: -0.057040155
    data: -0.036392305
    data: -0.086623378
    data: -0.037875924
    data: -0.030674398
    data: -0.078542523
    data: 0.055152759
    data: 0.029169425
    data: 0.14911598
    data: 0.056757156
    data: -0.015244947
    data: 0.042175628
    data: 0.11502625
    data: 0.060376562
    data: 0.14152524
    data: 0.038964141
    data: 0.0014551497
    data: -0.021373348
    data: -0.018979752
    data: -0.032532834
    data: -0.055275485
    data: 0.090904556
    data: 0.080781192
    data: 0.075546518
    data: 0.012094601
    data: -0.023991076
    data: 0.063995734
    data: -0.1212487
    data: -0.14504144
    data: -0.069577463
    data: -0.08031933
    data: -0.084203921
    data: -0.016891629
    data: -0.015578075
    data: -0.025158048
    data: -0.089110024
    data: 0.0339222
    data: 0.034568213
    data: -0.058705762
    data: 0.022988979
    data: 0.020105731
    data: 0.013523537
    data: 0.0019965696
    data: -0.015224989
    data: -0.063130721
    data: 0.064572781
    data: -0.033086065
    data: -0.13595003
    data: -0.04803976
    data: -0.14094189
    data: -0.18517542
    data: -0.055027619
    data: -0.17518929
    data: -0.082142092
    data: -0.0013688771
    data: -0.058548924
    data: 0.013398166
    data: 0.019216167
    data: -0.0091563417
    data: -0.041346133
    data: 0.057691321
    data: 0.023240227
    data: -0.017490609
    data: 0.052566841
    data: 0.019696232
    data: 0.086433791
    data: 0.056097522
    data: 0.048671424
    data: 0.12574932
    data: -0.14555651
    data: -0.08258678
    data: -0.041208938
    data: -0.045181703
    data: -0.00901312
    data: 0.017973879
    data: -0.022217369
    data: 0.014547567
    data: 0.026229002
    data: 0.11038109
    data: 0.088907249
    data: 0.084098853
    data: -0.0022776206
    data: -0.087887906
    data: 0.0072547
    data: -0.086774945
    data: -0.18893449
    data: -0.081787206
    data: 0.071850255
    data: 0.072414823
    data: 0.0070764753
    data: 0.021349026
    data: -0.015338079
    data: -0.099938028
    data: -0.045235004
    data: -0.045888592
    data: -0.081984125
    data: 0.0058498266
    data: 0.055135824
    data: 0.10446701
    data: -0.048055466
    data: 0.0023414632
    data: -0.031481907
    data: 0.001853794
    data: 0.058513835
    data: -0.066761196
    data: 0.0087432917
    data: 0.015135491
    data: 0.0047199652
    data: 0.004899872
    data: 0.052545968
    data: 0.12448718
    data: 0.024049543
    data: 0.13958743
    data: 0.14860681
    data: -0.17500666
    data: -0.10634597
    data: 0.0010265048
    data: -0.1214451
    data: -0.038338583
    data: 0.099923983
    data: -0.047745973
    data: 0.061423331
    data: 0.2112308
    data: 0.072422504
    data: 0.029110193
    data: -0.08251182
    data: 0.043907348
    data: -0.03677091
    data: -0.19939807
    data: -0.0987994
    data: -0.2021323
    data: -0.26196635
    data: -0.12753205
    data: -0.034095626
    data: 0.0014950471
    data: -0.031269033
    data: 0.024181027
    data: 0.0375005
    data: -0.012101531
    data: 0.013141175
    data: 0.0092237033
    data: 0.10210439
    data: 0.033949975
    data: -0.096904993
    data: -0.040978115
    data: -0.089604177
    data: -0.11135784
    data: -0.12119862
    data: -0.0684364
    data: 0.045847993
    data: 0.056702327
    data: 0.052863613
    data: -0.013817723
    data: 0.021904398
    data: -0.034097556
    data: -0.058441795
    data: -0.076886289
    data: -0.074918956
    data: -0.035770707
    data: 0.055223141
    data: 0.070117913
    data: -0.01317653
    data: 0.025140546
    data: 2.9529216e-05
    data: -0.004918748
    data: -0.063502543
    data: -0.087857313
    data: 0.0075666746
    data: 0.010312777
    data: -0.011146078
    data: 0.030337116
    data: 0.055516854
    data: 0.053029928
    data: 0.11476246
    data: 0.030690625
    data: 0.069781832
    data: 0.10583226
    data: 0.022842012
    data: 0.020471867
    data: -0.040290702
    data: 0.008578795
    data: -0.048309948
    data: -0.21039163
    data: -0.14988717
    data: -0.19444969
    data: -0.2066071
    data: -0.034245569
    data: 0.0089571336
    data: 0.073243275
    data: -0.018949077
    data: -0.0042636571
    data: 0.0381778
    data: -0.062883705
    data: -0.031282283
    data: 0.095683776
    data: -0.034427244
    data: -0.041473962
    data: -0.040466789
    data: -0.038573559
    data: -0.032508697
    data: -0.028037928
    data: -0.036912512
    data: 0.017956914
    data: 0.0847152
    data: 0.043212
    data: -0.129082
    data: 0.12111793
    data: 0.033937018
    data: -0.13334979
    data: 0.13613792
    data: 0.0030096066
    data: -0.097521126
    data: 0.1253863
    data: -0.0086734183
    data: -0.038473234
    data: 0.0826665
    data: -0.0086655281
    data: -0.0015743973
    data: 0.19588538
    data: -0.032984976
    data: -0.017253743
    data: -0.0053459243
    data: 0.044916589
    data: 0.063707367
    data: -0.016780755
    data: 0.01022527
    data: 0.020751026
    data: -0.082155891
    data: 0.033453088
    data: 0.068071172
    data: 0.044023842
    data: 0.037088
    data: -0.028237319
    data: -0.045425665
    data: 0.044733688
    data: 0.00043972392
    data: -0.062209334
    data: 0.079357758
    data: 0.028248038
    data: 0.0031259274
    data: -0.0074955467
    data: -0.0079837469
    data: -0.055843197
    data: -0.021502182
    data: -0.039690979
    data: -0.14433682
    data: -0.039502252
    data: -0.064688861
    data: -0.071205631
    data: 0.050367806
    data: 0.043876942
    data: 0.026489895
    data: 0.019851334
    data: 0.0042365375
    data: 0.059954539
    data: -0.079562105
    data: -0.010142153
    data: 0.079047695
    data: -0.077699721
    data: -0.026841765
    data: -0.046635021
    data: -0.054674275
    data: -0.016242048
    data: -0.026965214
    data: 0.01338686
    data: 0.024584396
    data: 0.05675786
    data: -0.025638102
    data: -0.031195929
    data: -0.0761004
    data: -0.053500108
    data: -0.02010121
    data: -0.042145621
    data: -0.013483951
    data: 0.065410107
    data: 0.034803934
    data: -0.068021372
    data: -0.018581063
    data: -0.023165848
    data: -0.037647091
    data: -0.073207192
    data: -0.070366323
    data: -0.019311093
    data: -0.043136064
    data: -0.04949769
    data: -0.031941861
    data: -0.032628439
    data: -0.053165566
    data: 0.087891936
    data: 0.023934586
    data: 0.0038081808
    data: -0.076547779
    data: -0.070401691
    data: -0.076631479
    data: -0.037379637
    data: 0.010288655
    data: -0.097791761
    data: 0.0215655
    data: 0.031624731
    data: -0.028165909
    data: -0.08243268
    data: -0.039639074
    data: -0.11963656
    data: -0.0028420014
    data: -0.078557976
    data: -0.00406653
    data: -0.01491492
    data: -0.10302833
    data: 0.025238298
    data: 0.053891286
    data: -0.11493386
    data: -0.014504326
    data: -0.11186814
    data: -0.084987789
    data: -0.076350324
    data: 0.061111219
    data: 0.070675194
    data: 0.081183612
    data: -0.26489496
    data: -0.2445965
    data: -0.26184607
    data: -0.024794649
    data: 0.0094516668
    data: 0.012331242
    data: -0.026658433
    data: 0.0073351497
    data: -0.0073489072
    data: -0.08250495
    data: -0.018713433
    data: -0.025424803
    data: 0.0018106719
    data: 0.1237781
    data: -0.16567351
    data: -0.070339806
    data: 0.036331
    data: -0.10711363
    data: -0.045176756
    data: 0.10274418
    data: -0.084247217
    data: -0.0048939115
    data: 0.015208298
    data: -0.039534438
    data: -0.035545122
    data: 0.015007026
    data: -0.038467009
    data: -0.0848979
    data: -0.028072534
    data: -0.071091771
    data: -0.0079460321
    data: -0.044542678
    data: 0.071415842
    data: 0.018761102
    data: -0.063377969
    data: -0.015256863
    data: 0.031264544
    data: 0.0691843
    data: 0.068804868
    data: 0.0099749845
    data: -0.0049092253
    data: -0.00081579748
    data: 0.035590425
    data: -0.00029285435
    data: 0.019056549
    data: -0.037509609
    data: -0.043515615
    data: -0.10937437
    data: -0.056859963
    data: -0.055581816
    data: 0.024071887
    data: -0.0042264955
    data: 0.0059540397
    data: 0.05741106
    data: -0.1863284
    data: -0.085811876
    data: -0.011645822
    data: 0.026301056
    data: 0.01185465
    data: -0.027522337
    data: 0.035051424
    data: 0.01118147
    data: 0.057410397
    data: -0.033262372
    data: -0.02916568
    data: -0.0020106651
    data: -0.097972333
    data: -0.042490948
    data: -0.0062288446
    data: -0.033148549
    data: 0.0080031967
    data: 0.058804091
    data: -0.12769151
    data: -0.058963206
    data: -0.016355259
    data: -0.019895963
    data: 0.0048142294
    data: -0.058862753
    data: 0.0028263654
    data: 0.031333562
    data: -0.048516963
    data: -0.05111856
    data: -0.0347758
    data: -0.1232133
    data: 0.0009222051
    data: 0.012833371
    data: -0.012254535
    data: -0.017880689
    data: -0.017527258
    data: -0.0068672504
    data: 0.0001229294
    data: -0.0040834798
    data: 0.0096408147
    data: -0.050072931
    data: 0.12968387
    data: -0.11482642
    data: -0.031949919
    data: 0.09268824
    data: -0.070195481
    data: -0.040619239
    data: 0.16246179
    data: -0.13070685
    data: -0.073100507
    data: -0.011675135
    data: -0.020952819
    data: 0.0040804381
    data: 0.0441238
    data: 0.010551821
    data: -0.033514343
    data: -0.0054378402
    data: -0.067715272
    data: -0.048406444
    data: -0.012849513
    data: -0.0630918
    data: -0.025085172
    data: -0.0024412845
    data: -0.01196634
    data: -0.087161228
    data: -0.0027998344
    data: -0.085994475
    data: 0.065167569
    data: 0.073353916
    data: 0.060507175
    data: -0.010454576
    data: 0.024207789
    data: 0.037306204
    data: 0.092456415
    data: 0.15169688
    data: 0.097585216
    data: -0.013480969
    data: 0.0034322897
    data: 0.076525934
    data: 0.0071911272
    data: 0.015298991
    data: 0.077229947
    data: -0.10564382
    data: -0.060487758
    data: -0.018177936
    data: -0.019569669
    data: -0.022535594
    data: -0.0093041779
    data: -0.01046534
    data: -0.032387678
    data: -0.032772325
    data: -0.024091631
    data: -0.061432675
    data: -0.11291214
    data: -0.023909023
    data: 0.064836882
    data: 0.029124552
    data: -0.0049731475
    data: 0.025284577
    data: 0.015637428
    data: 0.060825951
    data: 0.044560455
    data: 0.0056759352
    data: 0.035392996
    data: 0.014876815
    data: 0.0017239242
    data: 0.046695441
    data: 0.020721002
    data: 0.053380545
    data: -0.090575963
    data: 0.01801526
    data: -0.004635802
    data: -0.10176931
    data: -0.089649506
    data: -0.040725961
    data: 0.13281085
    data: 0.0883929
    data: 0.10526098
    data: -0.34417406
    data: -0.32769284
    data: -0.37575471
    data: -0.029581655
    data: -0.0052724378
    data: -0.039506629
    data: 0.047878474
    data: 0.073805973
    data: 0.009103016
    data: -0.20280875
    data: -0.02996878
    data: -0.10376611
    data: -0.093880676
    data: 0.062754944
    data: -0.16363423
    data: -0.1083755
    data: 0.075833648
    data: -0.13660307
    data: -0.12162157
    data: 0.0805718
    data: -0.17674643
    data: -0.031041354
    data: -0.0082903709
    data: 0.070644595
    data: 0.023578197
    data: 0.0018751586
    data: 0.057596337
    data: 0.066547744
    data: 0.043801472
    data: 0.08833655
    data: 0.025574312
    data: 0.041983705
    data: -0.029483827
    data: 0.052583344
    data: 0.072270036
    data: -0.006789892
    data: -0.038621869
    data: 0.031795561
    data: -0.074464619
    data: -0.01340576
    data: 0.0034651547
    data: 0.025475267
    data: -0.044715676
    data: -0.11752339
    data: -0.021123735
    data: 0.036531251
    data: -0.038940027
    data: 0.072741777
    data: -0.013818742
    data: -0.032403152
    data: -0.0055191373
    data: 0.0072809896
    data: 0.0088938177
    data: 0.072551727
    data: -0.02247417
    data: 0.060037971
    data: 0.072209179
    data: 0.037256423
    data: 0.017819896
    data: -0.055861648
    data: 0.16820398
    data: 0.11071562
    data: -0.059392735
    data: 0.0051584626
    data: -0.026636239
    data: -0.13800061
    data: -0.042794947
    data: -0.066445887
    data: -0.26061666
    data: 0.0081983646
    data: -0.029908402
    data: -0.15567099
    data: 0.11445966
    data: 0.034936763
    data: -0.094620481
    data: -0.037880126
    data: -0.035685919
    data: 0.096396014
    data: -0.13679497
    data: 0.0427553
    data: 0.0846655
    data: -0.09919858
    data: 0.00024379077
    data: 0.05218016
    data: 0.034877539
    data: -0.012149451
    data: -0.060755689
    data: 0.023309765
    data: 0.017504774
    data: 0.0016332405
    data: 0.015959963
    data: 0.026828414
    data: -0.0010283703
    data: 0.00786186
    data: 0.1169592
    data: 0.042474966
    data: -0.026730752
    data: 0.018512936
    data: -0.058024831
    data: -0.10005146
    data: -0.14161198
    data: -0.14160781
    data: 0.0085199205
    data: 0.023595789
    data: 0.099637806
    data: -0.0035245861
    data: -0.028649438
    data: 0.0018000066
    data: 0.031254318
    data: -0.01753339
    data: -0.055400822
    data: -0.072177507
    data: -0.058090758
    data: 0.0852937
    data: -0.11188063
    data: -0.10537541
    data: -0.12041755
    data: -0.0375945
    data: -0.00088387058
    data: -0.0021438627
    data: -0.012948632
    data: 0.058301546
    data: 0.029112875
    data: -0.094895832
    data: 0.0031917114
    data: 0.062236603
    data: -0.041401945
    data: -0.020452945
    data: 0.077198379
    data: 0.00060825859
    data: 0.0021979667
    data: 0.017378567
    data: -0.06188811
    data: -0.041444637
    data: 0.00090193248
    data: -0.025193103
    data: -0.011727717
    data: 0.040269542
    data: 0.028699035
    data: 0.01893029
    data: -0.0936457
    data: 0.16605686
    data: 0.13720635
    data: -0.085743457
    data: 0.048132014
    data: 0.032702915
    data: -0.11843769
    data: 0.020066462
    data: -0.018927401
    data: -0.023304526
    data: -0.009814769
    data: -0.025830036
    data: -0.0061355089
    data: 0.0095852129
    data: 0.029297855
    data: 0.066351414
    data: -0.025296602
