name: "12Net"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 12
input_dim: 12
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  blobs {
    data: 0.212529
    data: 0.824803
    data: -0.339511
    data: 0.063358
    data: 0.321269
    data: -0.928086
    data: -0.081583
    data: -0.229980
    data: 0.101266
    data: 0.191454
    data: 0.793518
    data: -0.927173
    data: 0.424005
    data: 0.619422
    data: -1.368299
    data: 0.448846
    data: -0.062616
    data: -0.171741
    data: 1.513360
    data: 1.014900
    data: -1.632902
    data: 1.523224
    data: 0.272786
    data: -2.251633
    data: 0.977547
    data: -0.540536
    data: -0.969641
    data: -0.412764
    data: -0.180893
    data: -0.577036
    data: -0.655719
    data: -0.408944
    data: -0.800556
    data: -0.590510
    data: -0.281691
    data: -0.613378
    data: 0.935396
    data: 1.564395
    data: 0.819074
    data: 1.213662
    data: 2.117297
    data: 1.504675
    data: 0.660701
    data: 1.841329
    data: 1.109009
    data: -0.391466
    data: -1.282313
    data: 0.042934
    data: -0.476944
    data: -1.711989
    data: -0.566778
    data: 0.099766
    data: -1.415111
    data: -0.369710
    data: -0.530790
    data: -1.149119
    data: -0.395462
    data: -1.074239
    data: -0.166444
    data: 0.863782
    data: 0.121031
    data: 0.955337
    data: 0.744384
    data: 0.313570
    data: -0.259900
    data: 0.544605
    data: -0.742166
    data: 0.127994
    data: 1.003928
    data: -0.428140
    data: 0.158664
    data: -0.051327
    data: -2.952749
    data: -3.287673
    data: -2.477835
    data: -1.203237
    data: 0.290539
    data: 1.128240
    data: 2.081056
    data: 3.294843
    data: 3.114779
    data: 1.010386
    data: 0.625260
    data: 0.323167
    data: 0.243982
    data: 0.128853
    data: -0.844915
    data: 0.112061
    data: -0.950990
    data: -1.051939
    data: 0.631876
    data: -0.222687
    data: -0.252046
    data: 0.205405
    data: 0.460510
    data: -0.564375
    data: 0.332788
    data: -0.027415
    data: -0.411227
    data: -0.623214
    data: -1.509614
    data: 0.527528
    data: -1.243246
    data: 0.313077
    data: 0.897730
    data: -0.320943
    data: 0.781099
    data: 1.435424
    data: 1.416883
    data: 0.675461
    data: 0.247160
    data: 1.684130
    data: 1.377452
    data: 0.242068
    data: 0.879822
    data: 1.126154
    data: 0.291773
    data: 1.527561
    data: 0.523745
    data: -0.641756
    data: 2.021507
    data: 1.631116
    data: 0.125983
    data: 1.339930
    data: 1.656600
    data: 0.581337
    data: 1.310149
    data: 0.265154
    data: -0.842348
    data: 1.696401
    data: 1.585959
    data: 0.323310
    data: 1.426305
    data: 2.224943
    data: 1.725387
    data: -1.461431
    data: -1.538719
    data: -0.682612
    data: -0.647695
    data: -1.947126
    data: -1.191363
    data: 0.474650
    data: -1.232382
    data: -1.386444
    data: -0.848319
    data: -0.748050
    data: 0.134858
    data: 0.065258
    data: -1.145201
    data: 0.070801
    data: 1.169617
    data: -0.232622
    data: -0.265821
    data: -1.060220
    data: -1.069089
    data: 0.327045
    data: -1.097079
    data: -2.527074
    data: -1.253847
    data: -1.057516
    data: -3.002239
    data: -2.631845
    data: -0.120792
    data: -0.887740
    data: 0.025574
    data: 0.772256
    data: -1.134991
    data: 0.463214
    data: 0.453308
    data: -0.743024
    data: 0.162095
    data: 0.752137
    data: -0.889244
    data: 0.757873
    data: 0.688292
    data: -1.299056
    data: 0.846273
    data: 0.347314
    data: -1.431880
    data: 0.136778
    data: 0.259297
    data: -1.976867
    data: 0.327868
    data: 0.646661
    data: -1.788117
    data: 1.136910
    data: 1.368766
    data: -0.732255
    data: 1.640567
    data: 0.439168
    data: 0.834102
    data: 0.681029
    data: -1.085364
    data: -2.014307
    data: -0.579979
    data: 0.835444
    data: 0.683071
    data: 0.261992
    data: 0.651215
    data: 1.160992
    data: 0.979909
    data: -1.248490
    data: -2.518203
    data: -0.925379
    data: 0.710523
    data: 0.607154
    data: 0.247938
    data: 0.508150
    data: 1.301155
    data: 0.805000
    data: -1.849842
    data: -2.889851
    data: -1.584271
    data: 1.565027
    data: 1.555547
    data: 0.791571
    data: 0.244793
    data: 0.415845
    data: 0.430143
    data: 0.546821
    data: 0.770065
    data: 0.246726
    data: -0.312143
    data: -0.266835
    data: 0.151304
    data: -0.110922
    data: 0.302159
    data: 0.353879
    data: 0.830280
    data: 1.160862
    data: 0.269343
    data: 0.392299
    data: 0.491694
    data: 0.643122
    data: -1.366295
    data: -1.268512
    data: -1.012500
    data: -0.118888
    data: -0.279662
    data: -1.188833
    data: -0.669814
    data: -1.079390
    data: -0.895377
    data: -0.289962
    data: 0.637326
    data: 0.137989
    data: -0.632182
    data: 0.630682
    data: 0.380338
    data: 0.632510
    data: 0.607630
    data: 0.675375
    data: -0.189272
    data: 0.955100
    data: 0.597616
    data: -0.636840
    data: 0.521981
    data: 0.641667
    data: -0.573194
    data: -0.118386
    data: 0.277022
    data: -1.639685
    data: -0.034370
    data: 0.440079
    data: -2.065139
    data: -0.474643
    data: 0.656833
    data: -1.239644
    data: -0.823962
    data: 0.334224
    shape {
      dim: 10
      dim: 3
      dim: 3
      dim: 3
    }
  }
  blobs {
    data: 0.03092519
    data: 2.05748963
    data: 0.17851782
    data: -0.03855684
    data: 1.93974984
    data: 1.62505305
    data: -0.40252161
    data: -0.13384552
    data: -0.08407294
    data: -2.02305245
    shape {
      dim: 10
    }
  }
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 10
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "PReLU1"
  type: "PReLU"
  bottom: "conv1"
  top: "conv1"
  blobs {
    data: -0.31997186
    data: -0.77842945
    data: -0.69040948
    data: -1.37045574
    data: 1.01516080
    data: 1.02347422
    data: 0.20969199
    data: -0.77049941
    data: 0.69301826
    data: 2.02458405
    shape {
      dim: 10
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  blobs {
    data: 0.883097
    data: 1.107982
    data: 1.863162
    data: -0.614719
    data: 0.500789
    data: -0.003255
    data: -0.476458
    data: 0.891602
    data: -1.081757
    data: 0.306824
    data: 0.070301
    data: 0.934579
    data: -1.013847
    data: -0.905352
    data: 0.259398
    data: -0.964641
    data: 0.858675
    data: 1.098686
    data: -0.054527
    data: -0.315065
    data: -0.549992
    data: 0.226671
    data: 0.270317
    data: 0.121371
    data: -0.218122
    data: 0.027904
    data: -0.348662
    data: 1.550155
    data: 0.563000
    data: 1.063026
    data: -0.176391
    data: -0.546902
    data: -0.245364
    data: 0.179099
    data: 0.452815
    data: -0.151625
    data: 0.700811
    data: 0.280058
    data: 0.263200
    data: -0.263169
    data: -0.428918
    data: -0.063858
    data: -0.515693
    data: -0.547501
    data: 0.031999
    data: -0.642589
    data: -0.141244
    data: -0.261276
    data: 0.050097
    data: 0.164903
    data: 0.238092
    data: -0.164743
    data: 0.342054
    data: 0.104386
    data: -0.127312
    data: -0.233015
    data: -0.185572
    data: 0.602906
    data: 0.006005
    data: 0.409531
    data: -0.257848
    data: 0.041425
    data: -0.399428
    data: 0.880149
    data: 0.831880
    data: 0.482332
    data: -0.300798
    data: 0.029959
    data: -0.145616
    data: -0.192875
    data: 0.053987
    data: 0.270705
    data: 0.612294
    data: 0.459429
    data: -0.900531
    data: 0.035089
    data: 0.466549
    data: 0.620709
    data: -0.910326
    data: -0.759859
    data: -0.952268
    data: 0.623545
    data: 0.486116
    data: 0.823902
    data: -0.215439
    data: -0.243736
    data: -0.167692
    data: -0.496948
    data: 0.323904
    data: -0.077177
    data: -1.159389
    data: 0.309967
    data: 0.932662
    data: -0.443268
    data: -0.219748
    data: -0.178010
    data: 0.355238
    data: 0.075383
    data: 0.265490
    data: -2.440703
    data: 0.415076
    data: 0.813978
    data: 0.044629
    data: 0.150703
    data: -0.081012
    data: 2.819046
    data: -0.422461
    data: 0.413287
    data: -0.835112
    data: -0.581125
    data: -0.074560
    data: 0.140183
    data: 0.311060
    data: 0.283956
    data: -0.206844
    data: -0.394772
    data: -0.181319
    data: -0.828291
    data: 1.002715
    data: 1.992043
    data: 0.444688
    data: 0.433039
    data: 0.578548
    data: 1.161003
    data: 0.362724
    data: 0.197041
    data: 0.270337
    data: 0.381506
    data: -0.741315
    data: 0.000029
    data: 0.092001
    data: -0.263790
    data: 0.125387
    data: 0.081652
    data: 0.136043
    data: 0.043823
    data: 0.038706
    data: -0.199248
    data: -0.107338
    data: -0.130744
    data: -0.286942
    data: 0.356330
    data: 0.375359
    data: 0.028449
    data: 0.987771
    data: 2.447843
    data: 1.909967
    data: -0.324738
    data: 0.989768
    data: 0.721068
    data: -0.364744
    data: -1.216078
    data: -0.926028
    data: 1.844961
    data: -0.008235
    data: -0.463577
    data: 0.843147
    data: -0.424217
    data: -0.223919
    data: -0.077489
    data: 0.081645
    data: 0.029130
    data: -2.318766
    data: -1.215257
    data: -0.655789
    data: -0.185211
    data: 0.522601
    data: 0.432425
    data: 0.511377
    data: 0.091265
    data: 0.616308
    data: -0.081695
    data: 1.106287
    data: 0.475411
    data: -0.363490
    data: 0.387921
    data: 0.318110
    data: 0.304008
    data: -0.105319
    data: -0.113278
    data: -0.367858
    data: 0.441747
    data: 0.972132
    data: 1.619591
    data: -0.042344
    data: 0.986444
    data: 0.687716
    data: 0.030402
    data: 0.303855
    data: -0.383066
    data: 0.537597
    data: 0.012296
    data: -0.324689
    data: 0.538799
    data: 0.303691
    data: -0.155454
    data: 1.083189
    data: -0.038809
    data: 0.104424
    data: -0.417165
    data: -0.565972
    data: -0.445045
    data: -0.856089
    data: -0.544496
    data: 0.792443
    data: -0.429737
    data: -0.402793
    data: 0.023583
    data: 0.987899
    data: 0.982681
    data: 1.271786
    data: 1.814723
    data: 1.505263
    data: 0.426748
    data: -3.498960
    data: -2.524213
    data: 0.046529
    data: 0.128133
    data: 0.214622
    data: -0.428170
    data: -1.026325
    data: -0.421678
    data: 0.104447
    data: 0.451130
    data: 0.549511
    data: 0.077020
    data: -0.108717
    data: -0.279315
    data: 0.373934
    data: 1.069861
    data: 0.214000
    data: -0.415955
    data: -0.964274
    data: -0.498423
    data: -0.213360
    data: -1.121362
    data: -0.368698
    data: 0.080858
    data: 1.010578
    data: 0.665978
    data: 0.542103
    data: 0.421748
    data: 0.724582
    data: 0.961608
    data: 1.021926
    data: 0.751305
    data: 0.034420
    data: -1.164994
    data: 0.150163
    data: -1.156522
    data: -3.043877
    data: 0.002432
    data: 0.047977
    data: 0.240395
    data: 0.131379
    data: 1.652643
    data: 0.967887
    data: 1.695942
    data: -0.424105
    data: -1.192893
    data: -0.727316
    data: 0.259165
    data: -0.437993
    data: -0.467154
    data: -0.047910
    data: -0.425956
    data: 0.450627
    data: -0.044281
    data: -0.346215
    data: 0.034892
    data: -0.836019
    data: -0.788473
    data: 0.366744
    data: -0.413871
    data: -0.074687
    data: 0.003282
    data: -0.414109
    data: -0.183597
    data: 0.414207
    data: 1.126987
    data: -0.216664
    data: -0.748591
    data: 0.292967
    data: 0.712155
    data: 0.083160
    data: -0.390532
    data: -0.174910
    data: 0.011459
    data: 0.532545
    data: 0.202935
    data: -0.004905
    data: 0.892704
    data: -0.198625
    data: 0.090086
    data: 0.887809
    data: 0.299649
    data: 0.058923
    data: 0.594971
    data: 0.023051
    data: -0.769242
    data: 2.282060
    data: 0.112400
    data: 0.522590
    data: 0.779705
    data: -0.034289
    data: 0.628729
    data: 0.234899
    data: -0.011734
    data: -0.074257
    data: 0.296243
    data: 0.338525
    data: 0.077667
    data: -0.137605
    data: -0.174282
    data: -0.188065
    data: 0.572999
    data: 0.280916
    data: 0.090843
    data: -0.078288
    data: -0.127949
    data: -0.125705
    data: -0.415995
    data: 0.066031
    data: 0.286410
    data: -0.213769
    data: -0.084301
    data: -0.042818
    data: -0.540304
    data: -0.291622
    data: -0.082478
    data: 0.277120
    data: 0.402469
    data: -0.172633
    data: 0.814929
    data: 0.108690
    data: -0.332699
    data: 0.353684
    data: -0.152521
    data: -0.571241
    data: -0.136549
    data: -0.414160
    data: -0.352440
    data: 0.775419
    data: -0.640551
    data: 0.101216
    data: -0.645964
    data: -1.187152
    data: -0.864564
    data: 0.097257
    data: -0.324835
    data: -0.280971
    data: 0.460505
    data: 0.167877
    data: 0.290243
    data: 0.017721
    data: -0.072580
    data: 0.203382
    data: -0.263938
    data: 0.545948
    data: 0.239075
    data: -0.120073
    data: -0.474997
    data: 1.066194
    data: -0.048717
    data: -0.465054
    data: 0.079550
    data: 0.732666
    data: 0.441519
    data: -0.199600
    data: 0.591249
    data: 1.035798
    data: 2.598166
    data: 0.502785
    data: 1.921721
    data: 0.792897
    data: -2.991929
    data: -0.702838
    data: -2.209891
    data: -0.251020
    data: -0.044704
    data: -0.134858
    data: 0.694544
    data: 0.027633
    data: 0.153530
    data: 0.174400
    data: -0.053900
    data: -0.862525
    data: 0.019813
    data: 0.279520
    data: 0.598017
    data: 0.534048
    data: 0.420260
    data: -0.449786
    data: -0.564657
    data: 0.396671
    data: -1.323679
    data: -0.131395
    data: 0.499874
    data: 0.016031
    data: -0.288095
    data: 0.171906
    data: 0.043250
    data: -0.834647
    data: -0.073484
    data: -0.212649
    data: -0.100595
    data: 0.325148
    data: 0.513150
    data: -0.397990
    data: 0.030281
    data: 0.015791
    data: -0.811110
    data: -0.457635
    data: 0.001971
    data: 0.005773
    data: -0.725920
    data: -0.694486
    data: 0.060751
    data: 0.517038
    data: 0.090555
    data: 0.675318
    data: 1.668875
    data: 0.739277
    data: 0.545883
    data: -0.272447
    data: -0.560874
    data: 0.422886
    data: -0.493045
    data: 0.338531
    data: 0.429804
    data: -0.122363
    data: 0.688699
    data: -0.027032
    data: -0.858186
    data: 1.019546
    data: 1.449205
    data: 0.611329
    data: -0.382634
    data: 0.269758
    data: -0.409126
    data: -1.321821
    data: -0.271147
    data: 0.415615
    data: 0.409414
    data: -0.229044
    data: 0.360102
    data: 0.153001
    data: -0.785677
    data: 0.123212
    data: 0.286195
    data: 0.174600
    data: 0.121595
    data: -0.342203
    data: -0.024561
    data: 0.530095
    data: -0.033036
    data: -0.238669
    data: -0.066842
    data: -0.327617
    data: 0.107542
    data: 0.231390
    data: 0.430027
    data: -0.228508
    data: 0.404542
    data: -0.568619
    data: -0.419772
    data: 0.781297
    data: -0.453500
    data: 0.065340
    data: -0.032353
    data: 0.017000
    data: 0.078786
    data: -0.201757
    data: -0.072809
    data: -0.057540
    data: 0.598223
    data: 0.163078
    data: -0.236452
    data: -0.136855
    data: -0.381483
    data: 0.257480
    data: 0.780618
    data: 0.525375
    data: -1.259218
    data: -0.190227
    data: -0.740841
    data: -0.027496
    data: -0.100434
    data: 0.098321
    data: -0.060835
    data: -0.373794
    data: -0.252383
    data: 0.066252
    data: -0.106167
    data: 0.064843
    data: -0.052874
    data: -0.297519
    data: 0.161055
    data: -0.052757
    data: -0.183692
    data: 0.003126
    data: 0.011214
    data: -0.191503
    data: -0.063602
    data: -0.422818
    data: 0.030851
    data: -0.390561
    data: 0.336515
    data: 0.732990
    data: 0.451199
    data: -0.195036
    data: -0.310061
    data: -0.322501
    data: 0.417972
    data: -0.168774
    data: 0.126610
    data: 0.145018
    data: 1.010200
    data: 0.615398
    data: -0.184828
    data: 1.849915
    data: 0.846152
    data: 0.042093
    data: -0.334682
    data: 0.088503
    data: 0.084419
    data: 0.206153
    data: -0.459215
    data: -0.322377
    data: 0.970882
    data: 0.121272
    data: -0.127499
    data: 0.091443
    data: 0.126672
    data: 0.018944
    data: 0.131989
    data: -0.023548
    data: -0.056542
    data: -0.050280
    data: -0.081754
    data: 0.396623
    data: 0.539093
    data: 0.731803
    data: -0.767618
    data: -0.462693
    data: -0.511266
    data: 0.249643
    data: 0.662013
    data: 1.131484
    data: -0.242672
    data: 0.010660
    data: -1.015767
    data: 0.200175
    data: 0.683105
    data: -0.545348
    data: -0.143659
    data: -0.165125
    data: -1.106297
    data: -0.064669
    data: -0.900719
    data: 0.685550
    data: 0.274406
    data: 0.833994
    data: -0.142642
    data: -0.650988
    data: 0.093436
    data: -1.268227
    data: -0.006977
    data: -0.496784
    data: -2.599236
    data: -1.067039
    data: -1.943970
    data: -4.831177
    data: -1.742145
    data: -1.577633
    data: -2.878602
    data: 0.355906
    data: 0.051185
    data: -0.137621
    data: 0.211928
    data: -0.594419
    data: 1.527445
    data: 0.216169
    data: -0.003236
    data: -0.004315
    data: 0.058998
    data: 0.273290
    data: 0.799547
    data: -0.295948
    data: 0.216080
    data: -0.647579
    data: -0.035465
    data: 0.521612
    data: 0.929774
    data: 0.770403
    data: 0.805565
    data: 0.592945
    data: 0.324473
    data: -1.152612
    data: 0.036239
    data: 0.623999
    data: -0.718918
    data: -0.502777
    data: 0.939000
    data: -0.064054
    data: -0.965807
    data: 0.355939
    data: 0.136724
    data: -2.405941
    data: 1.269636
    data: 0.671991
    data: -0.006155
    data: 0.667811
    data: -0.647266
    data: -0.044024
    data: 0.606517
    data: -0.804592
    data: -2.765464
    data: -0.557823
    data: -0.887183
    data: 0.176275
    data: 0.633325
    data: 0.265474
    data: -0.303091
    data: -0.491905
    data: 0.418301
    data: -0.035083
    data: 0.449228
    data: 0.183758
    data: -0.410284
    data: -0.396057
    data: 0.010505
    data: 0.260790
    data: -0.213110
    data: 0.882875
    data: -0.224088
    data: -0.094951
    data: 0.021613
    data: -1.309693
    data: -5.283017
    data: -2.737125
    data: -1.839032
    data: -0.500232
    data: 1.092379
    data: 0.076897
    data: 0.490576
    data: 1.296640
    data: 0.327849
    data: -1.207274
    data: -0.209326
    data: -0.308298
    data: 0.414239
    data: -0.689380
    data: 0.724416
    data: 0.484859
    data: -0.193395
    data: 0.151971
    data: -7.255194
    data: -5.463521
    data: -3.467464
    data: 1.463929
    data: 0.318008
    data: 0.463300
    data: 0.686816
    data: -0.168153
    data: -0.842484
    data: 0.275341
    data: 0.810254
    data: 0.396593
    data: -0.052744
    data: 0.812171
    data: 0.217207
    data: 0.151556
    data: 0.161704
    data: 0.210864
    data: 0.124318
    data: 0.258256
    data: 0.275537
    data: 1.153448
    data: 0.630229
    data: 0.958038
    data: -0.265359
    data: 0.003714
    data: 0.146202
    data: -4.082418
    data: -2.571345
    data: -4.761666
    data: 1.958319
    data: 1.447715
    data: 0.696931
    data: -0.188918
    data: -0.091185
    data: -1.295521
    data: 1.625100
    data: -0.359932
    data: 0.686578
    data: 0.380380
    data: -2.179834
    data: 0.763396
    data: -0.049027
    data: -0.465438
    data: 0.464546
    data: -2.757157
    data: -3.139073
    data: -0.572935
    data: 0.502924
    data: -0.193237
    data: 1.167224
    data: 0.075648
    data: 0.502013
    data: 1.305550
    data: -1.354125
    data: -0.700920
    data: -0.463851
    data: 1.054953
    data: 0.665545
    data: 0.578324
    data: -0.420229
    data: 0.235874
    data: 0.317303
    data: -0.744248
    data: 0.642275
    data: 1.132407
    data: -0.244178
    data: 0.655024
    data: -0.699994
    data: 2.014026
    data: 0.475087
    data: -0.097509
    data: -0.965842
    data: 0.378078
    data: 0.427013
    data: 0.363104
    data: 1.331767
    data: 0.440176
    data: -1.004012
    data: -1.144517
    data: -1.090468
    data: 0.226627
    data: -0.422343
    data: 0.031909
    data: 1.046487
    data: 0.460860
    data: 0.011775
    data: -1.970809
    data: 0.685033
    data: -0.661139
    data: -3.466900
    data: -1.871729
    data: -1.278798
    data: -4.924439
    data: -1.817517
    data: -0.182156
    data: -4.728069
    data: -2.503965
    data: -0.082532
    data: -0.195318
    data: 0.020898
    data: -0.174730
    data: 0.631726
    data: -0.051640
    data: -0.183655
    data: -0.296186
    data: -0.146309
    data: 0.363101
    data: 0.583090
    data: -0.586659
    data: -0.012048
    data: -0.080029
    data: -0.063299
    data: 0.052504
    data: 0.994500
    data: -0.220170
    data: -0.398107
    data: -0.914292
    data: 1.301129
    data: 0.880103
    data: -0.366360
    data: -0.078160
    data: 0.667603
    data: -1.242746
    data: -1.455882
    data: 0.467135
    data: 0.609143
    data: -0.822000
    data: 1.746085
    data: -2.008866
    data: 0.306217
    data: 1.397724
    data: -3.512010
    data: 1.563538
    data: 2.302121
    data: 0.996359
    data: -1.431746
    data: -1.275044
    data: -1.801115
    data: -0.707707
    data: 0.302508
    data: -0.198911
    data: -0.590208
    data: -0.659358
    data: 0.437584
    data: 1.005391
    data: 0.335572
    data: -0.360644
    data: -0.467690
    data: 0.403469
    data: 0.576926
    data: -1.207287
    data: 0.299746
    data: 0.875369
    data: -0.178351
    data: 0.308139
    data: -0.291930
    data: 0.087362
    data: -0.282421
    data: 0.638544
    data: 0.042473
    data: -0.738850
    data: 2.310905
    data: 0.083605
    data: 2.235725
    data: 0.164578
    data: -1.515231
    data: -0.418532
    data: 1.982925
    data: -0.854277
    data: -2.851436
    data: -0.088272
    data: -0.288248
    data: -0.853220
    data: 0.185697
    data: 0.180785
    data: -0.254395
    data: -0.093133
    data: -0.192324
    data: -0.276173
    data: 1.622327
    data: 0.768713
    data: 0.477377
    data: 0.726811
    data: 0.553294
    data: -0.192284
    data: 1.109779
    data: 0.468731
    data: -1.738378
    data: -0.216559
    data: -0.054876
    data: 0.520493
    data: 0.125236
    data: -0.018419
    data: 0.195041
    data: 0.380967
    data: 0.080549
    data: 0.038951
    data: 0.034409
    data: 0.164596
    data: 0.472815
    data: 0.036469
    data: -0.067967
    data: 0.162774
    data: 0.249814
    data: 0.212666
    data: -0.002257
    data: -0.212749
    data: -0.663102
    data: -0.638744
    data: 0.224856
    data: 0.411634
    data: 0.450729
    data: 0.652832
    data: 0.538862
    data: -0.188417
    data: -0.761226
    data: 0.221509
    data: -0.298181
    data: -0.214804
    data: 0.159701
    data: 0.011635
    data: -0.658919
    data: 0.193127
    data: 0.553311
    data: 1.022279
    data: -0.027631
    data: 0.880889
    data: -0.204198
    data: -1.336790
    data: -0.663742
    data: -0.166020
    data: -1.681502
    data: -1.477954
    data: 0.075701
    data: -0.211032
    data: 0.458467
    data: 0.187956
    data: 0.100602
    data: 0.306633
    data: 0.780012
    data: 0.365592
    data: -0.101715
    data: 0.582454
    data: -0.815721
    data: 1.828240
    data: 0.097903
    data: -1.102107
    data: 2.137286
    data: 0.173833
    data: 0.770153
    data: -0.468343
    data: 1.120348
    data: 0.502484
    data: -0.300711
    data: -0.197613
    data: -2.157956
    data: -0.300174
    data: 0.152092
    data: -0.601113
    data: 1.906395
    data: -0.977691
    data: -2.250939
    data: -1.559430
    data: -1.405156
    data: -4.149423
    data: 0.287160
    data: 1.067687
    data: 0.208830
    data: 0.268306
    data: 2.671182
    data: 0.025559
    data: 1.128393
    data: -0.013634
    data: -3.006831
    data: 0.800888
    data: 1.315109
    data: 0.458043
    data: 1.055037
    data: -0.081207
    data: 0.311195
    data: 0.402797
    data: 1.035192
    data: 0.511760
    data: -0.225024
    data: -0.058752
    data: -0.220794
    data: 0.217526
    data: 0.206541
    data: -0.780125
    data: -0.673744
    data: 0.966801
    data: -0.056285
    data: 0.188670
    data: -0.117353
    data: 1.522985
    data: 0.618621
    data: -0.621187
    data: -0.601867
    data: -0.474800
    data: 0.444418
    data: -2.119740
    data: 1.122596
    data: 0.040306
    data: 0.297552
    data: 1.057952
    data: -0.015291
    data: 0.424827
    data: -0.912265
    data: 0.140644
    data: -2.096567
    data: -2.748501
    data: 0.988241
    data: -0.512159
    data: 0.548684
    data: -0.257457
    data: -1.125624
    data: -1.764543
    data: 0.833850
    data: 0.261623
    data: 0.570515
    data: 0.829782
    data: 1.584542
    data: -0.387981
    data: 0.570212
    data: -1.026997
    data: -0.444236
    data: 0.868855
    data: -0.634408
    data: -0.293591
    data: -0.836050
    data: -0.593972
    data: 0.791888
    data: -1.357398
    data: 0.113234
    data: 0.241465
    data: -0.205580
    data: 0.462410
    data: 0.727782
    data: 0.174270
    data: 0.382321
    data: 1.339561
    data: -0.491961
    data: 0.357467
    data: 1.029338
    data: 0.408163
    data: 0.105187
    data: 0.197004
    data: -0.251458
    data: -0.431266
    data: -0.683862
    data: 0.295536
    data: -0.893431
    data: -1.154802
    data: -0.007333
    data: -0.506572
    data: -0.669582
    data: 0.320325
    data: 0.159499
    data: -0.440906
    data: -0.304660
    data: -0.891726
    data: 0.426964
    data: -0.114159
    data: -0.355310
    data: 1.145789
    data: -0.591122
    data: -0.452767
    data: 1.002487
    data: 0.483923
    data: 1.102857
    data: -0.251296
    data: 0.385839
    data: -0.448499
    data: 0.188572
    data: -0.262955
    data: -0.273430
    data: 0.237389
    data: 0.065914
    data: 0.532988
    data: 1.048720
    data: -0.199894
    data: 0.223624
    data: 0.606403
    data: -0.057918
    data: -0.549437
    data: -0.304527
    data: -0.742027
    data: -0.085735
    data: 2.799662
    data: -0.639540
    data: -0.783451
    data: -0.671127
    data: -0.132302
    data: 0.761122
    data: 0.661461
    data: 0.603177
    data: 0.363916
    data: -0.841230
    data: 0.438433
    data: -0.033434
    data: -1.059766
    data: 0.381764
    data: -0.004745
    data: -0.137727
    data: 0.665353
    data: 0.538553
    data: -2.476604
    data: -0.024460
    data: 0.786247
    data: 0.173841
    data: 0.506293
    data: -0.818703
    data: -1.580903
    data: -0.595381
    data: 0.231832
    data: 0.676878
    data: 0.187925
    data: -0.088674
    data: 0.096950
    data: 0.268273
    data: -0.116380
    data: 0.204244
    data: 0.310818
    data: -0.048872
    data: -2.460264
    data: -1.111154
    data: -2.667130
    data: -3.010589
    data: -4.179685
    data: -2.429997
    data: -1.341021
    data: -1.121359
    data: 0.927163
    data: -1.022510
    data: -0.512201
    data: 0.778569
    data: 0.159537
    data: -1.084364
    data: 0.825836
    data: -0.502482
    data: -0.282634
    data: 0.528148
    data: -0.380953
    data: -0.532970
    data: 0.751437
    data: 0.158009
    data: 0.493139
    data: 1.041341
    data: 1.176879
    data: 1.139962
    data: 3.530321
    data: 1.531279
    data: -2.485158
    data: -0.043759
    data: -0.522872
    data: -3.093477
    data: -4.459408
    data: -4.884986
    data: 0.123211
    data: -0.124759
    data: 0.155463
    data: 0.728343
    data: 0.062470
    data: -0.180017
    data: -0.119234
    data: 0.537975
    data: -0.537601
    data: 0.151772
    data: 0.839517
    data: -0.544910
    data: 0.153791
    data: 0.181345
    data: -0.274677
    data: 0.112116
    data: -0.317486
    data: 0.150473
    data: 0.215607
    data: 0.878880
    data: 0.774803
    data: -1.067729
    data: -1.766985
    data: -0.415355
    data: -3.960121
    data: -2.969383
    data: -3.930153
    data: -0.206289
    data: 2.086221
    data: -0.954577
    data: 1.184450
    data: 1.819200
    data: -0.224884
    data: 0.766264
    data: 0.006824
    data: 0.258308
    data: 0.640711
    data: 1.868604
    data: -0.417806
    data: -0.792114
    data: 0.058336
    data: -1.415660
    data: -0.033434
    data: 1.177694
    data: 0.471440
    data: -0.718325
    data: -0.536569
    data: 0.867372
    data: -1.452384
    data: -0.390013
    data: 0.486328
    data: -0.125229
    data: -0.033153
    data: -1.254434
    data: 2.502580
    data: 0.145730
    data: 2.073211
    data: 0.568821
    data: -0.990789
    data: 1.198866
    data: 0.889003
    data: 0.765859
    data: 0.512245
    data: 1.119808
    data: -0.754871
    data: -0.480218
    data: 1.041622
    data: -1.249365
    data: -0.784257
    data: 2.369530
    data: 0.167273
    data: 0.262016
    data: -1.302947
    data: 0.034910
    data: -0.315388
    data: -1.454047
    data: -0.432148
    data: 0.073056
    data: 0.270990
    data: -0.143127
    data: 0.124392
    data: 2.221684
    data: 0.331088
    data: 1.589064
    data: 0.728504
    data: -1.171941
    data: 1.336013
    data: 1.800354
    data: 0.465726
    data: 3.148916
    data: -0.127622
    data: -0.218297
    data: -0.365245
    data: 0.276221
    data: -0.042931
    data: -0.587768
    data: -0.110337
    data: -0.067945
    data: 0.369805
    data: 0.582680
    data: -0.061004
    data: -0.465827
    data: 0.436711
    data: -0.296509
    data: -0.191624
    data: -0.368914
    data: -0.038493
    data: -0.210356
    data: 2.766625
    data: 0.388308
    data: 2.552483
    data: -0.177102
    data: -2.629067
    data: -0.496203
    data: 1.819659
    data: 2.766800
    data: 1.900794
    data: -0.879969
    data: 0.437978
    data: -1.036883
    data: -0.283986
    data: -0.295165
    data: -0.128815
    data: -0.396367
    data: -0.290851
    data: 0.756745
    data: -0.399125
    data: -0.282711
    data: -0.101046
    data: 0.028247
    data: -0.238673
    data: 0.480498
    data: 0.878619
    data: 0.190677
    data: -0.365891
    data: 1.232846
    data: 0.013000
    data: 0.192843
    data: 0.499758
    data: -0.799838
    data: -0.426080
    data: 0.347959
    data: 0.308508
    data: 0.326103
    data: 1.442936
    data: 1.814213
    data: 2.029754
    data: 0.921888
    data: 0.388011
    data: -0.059175
    data: 0.737129
    data: -0.269419
    data: 0.654010
    data: -0.563648
    data: -0.567009
    data: -2.017072
    data: 1.413819
    data: 1.069119
    data: -0.016071
    data: 0.485364
    data: -0.743047
    data: -0.388819
    data: -0.949364
    data: -0.279020
    data: 0.670285
    data: -0.232203
    data: 0.012908
    data: 0.544583
    data: -0.565241
    data: 0.122659
    data: 0.136841
    data: -1.366317
    data: -0.007030
    data: -1.227826
    data: -1.098209
    data: -0.012827
    data: -0.983961
    data: -1.410147
    data: -0.573688
    data: -0.768972
    data: 0.332280
    data: -0.166264
    data: -0.187638
    data: 0.076671
    data: -0.077803
    data: -0.122591
    data: 0.036485
    data: 0.166897
    data: -0.156766
    data: 0.337438
    data: -0.066287
    data: -0.517397
    data: 0.159876
    data: 0.085912
    data: -0.162841
    data: 0.224141
    data: 0.084571
    data: -0.149874
    data: 0.245242
    data: 0.030652
    data: -0.354933
    data: 0.732779
    data: 0.280782
    data: 0.013197
    data: -0.544386
    data: -1.008949
    data: -0.427759
    data: -0.148989
    data: -0.088693
    data: -0.359485
    data: 0.241468
    data: 0.119559
    data: 0.033948
    data: -0.095652
    data: 0.373248
    data: -0.397624
    data: -0.718569
    data: -0.939265
    data: -0.886420
    data: 0.043864
    data: -0.080139
    data: -0.604312
    data: 0.013287
    data: -0.114855
    data: 0.135011
    data: 0.723358
    data: 0.290293
    data: -0.125223
    data: 0.220901
    data: 0.399321
    data: 0.111833
    data: 0.249160
    data: -0.357380
    data: -0.240555
    data: 0.219783
    data: 0.213538
    data: -0.892437
    data: -0.093618
    data: 0.673110
    data: 0.047242
    data: 0.274409
    data: 0.199906
    data: -1.558732
    data: 1.223079
    data: 0.949028
    data: -2.433770
    data: 0.734790
    data: 1.201930
    data: -1.332330
    data: 1.795356
    data: 1.166696
    data: -2.678492
    data: -0.092702
    data: 0.240114
    data: 0.922333
    data: 0.216355
    data: -0.078161
    data: 0.285176
    data: 0.177282
    data: -0.458832
    data: -0.678148
    data: 1.168155
    data: 0.337326
    data: -1.210969
    data: 0.239125
    data: 0.399377
    data: -0.753790
    data: 1.922701
    data: 1.208690
    data: -1.186592
    data: -0.034083
    data: -0.251091
    data: -0.340912
    data: 0.074077
    data: -0.050878
    data: 0.206277
    data: -0.176883
    data: 0.159207
    data: -0.051512
    data: 0.107127
    data: -0.236010
    data: -0.395201
    data: -0.020156
    data: -0.140899
    data: 0.117501
    data: -0.168056
    data: 0.132469
    data: 0.082951
    data: 1.051583
    data: 1.007721
    data: -0.630182
    data: -1.320361
    data: -0.507954
    data: -0.027690
    data: 1.093995
    data: 1.152492
    data: 0.078583
    data: -0.407726
    data: -0.582742
    data: 0.764909
    data: -0.264900
    data: -0.669085
    data: 0.606664
    data: -0.295578
    data: -0.094495
    data: 1.491114
    data: 0.327758
    data: 0.239382
    data: -2.083935
    data: 0.682795
    data: 1.216635
    data: -0.286119
    data: 0.847080
    data: 0.910149
    data: -1.545068
    data: 0.393833
    data: 0.568762
    data: -0.374844
    data: -0.172154
    data: -0.153663
    data: -0.198077
    data: 0.040069
    data: 0.485844
    data: -0.189416
    shape {
      dim: 16
      dim: 10
      dim: 3
      dim: 3
    }
  }
  blobs {
    data: -0.63868260
    data: 0.36137414
    data: 2.78458142
    data: -2.00654221
    data: 0.43264145
    data: -1.98133457
    data: 1.41004562
    data: 1.51064241
    data: 2.63653994
    data: -1.05169225
    data: 3.25590920
    data: -0.92377758
    data: -0.45777321
    data: 0.09363179
    data: 1.11079407
    data: -1.38973999
    shape {
      dim: 16
    }
  }
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
     weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "PReLU2"
  type: "PReLU"
  bottom: "conv2"
  top: "conv2"
  blobs {
    data: -0.62307668
    data: 3.26529837
    data: -0.31753567
    data: 5.54309034
    data: 2.76136518
    data: 7.35200167
    data: -0.42119730
    data: 0.01960424
    data: -0.09174401
    data: 2.67235804
    data: -0.10204073
    data: -1.16325223
    data: -0.05661410
    data: 0.28471014
    data: 3.46506190
    data: 2.39230633
    shape {
      dim: 16
    }
  }
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  blobs {
    data: 0.005404
    data: 0.007374
    data: 0.007970
    data: -0.004946
    data: -0.005523
    data: -0.006785
    data: -0.007564
    data: -0.008982
    data: -0.009256
    data: -0.017611
    data: -0.008177
    data: -0.008705
    data: -0.008133
    data: -0.005711
    data: -0.002440
    data: -0.011469
    data: -0.006243
    data: -0.002014
    data: 0.004882
    data: 0.002266
    data: -0.000361
    data: -0.002532
    data: -0.000798
    data: 0.001756
    data: -0.002578
    data: 0.002358
    data: -0.003346
    data: -0.002940
    data: 0.001735
    data: -0.000446
    data: 0.008916
    data: 0.012447
    data: 0.007129
    data: 0.002057
    data: 0.004518
    data: 0.009363
    data: -0.003666
    data: -0.003749
    data: 0.007455
    data: 0.002720
    data: 0.005155
    data: 0.008209
    data: -0.000147
    data: 0.006811
    data: 0.008028
    data: 0.006456
    data: 0.003152
    data: 0.003142
    data: 0.005954
    data: 0.008434
    data: 0.008626
    data: -0.006308
    data: -0.005748
    data: -0.004251
    data: 0.002696
    data: 0.001740
    data: -0.004537
    data: 0.005954
    data: 0.008549
    data: 0.000736
    data: 0.006495
    data: 0.011584
    data: 0.010923
    data: -0.010933
    data: -0.007268
    data: -0.004387
    data: -0.002253
    data: 0.004613
    data: 0.004723
    data: 0.001501
    data: 0.012057
    data: 0.010056
    data: -0.009357
    data: -0.004510
    data: -0.002650
    data: -0.001851
    data: 0.003025
    data: 0.001779
    data: 0.019842
    data: 0.018000
    data: 0.009770
    data: 0.006297
    data: 0.009558
    data: 0.010946
    data: 0.006732
    data: 0.003374
    data: 0.006846
    data: 0.010555
    data: -0.003503
    data: -0.000195
    data: 0.001976
    data: 0.002650
    data: -0.001902
    data: -0.001181
    data: -0.006774
    data: -0.005842
    data: -0.013327
    data: -0.018154
    data: -0.010276
    data: 0.003143
    data: 0.009641
    data: 0.008468
    data: 0.004178
    data: 0.006839
    data: 0.001298
    data: -0.009292
    data: -0.013710
    data: -0.007396
    data: -0.004555
    data: 0.000063
    data: -0.002908
    data: -0.007027
    data: -0.007239
    data: -0.005272
    data: -0.013884
    data: -0.010308
    data: -0.007283
    data: -0.004962
    data: 0.002269
    data: 0.001547
    data: -0.008676
    data: -0.003485
    data: -0.001477
    data: -0.004840
    data: -0.012367
    data: -0.005592
    data: -0.007858
    data: -0.010063
    data: -0.011856
    data: 0.003477
    data: 0.002882
    data: 0.002075
    data: 0.009076
    data: 0.009040
    data: 0.007040
    data: -0.001573
    data: -0.005684
    data: -0.006518
    data: 0.000963
    data: -0.000380
    data: -0.005219
    data: -0.001869
    data: 0.001565
    data: -0.009547
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.010000
    data: -0.005719
    data: -0.006844
    data: -0.006806
    data: -0.003955
    data: -0.004137
    data: -0.008928
    data: -0.004799
    data: -0.002734
    data: -0.011908
    data: -0.001572
    data: 0.009026
    data: 0.001473
    data: 0.002868
    data: 0.002713
    data: 0.005252
    data: 0.004811
    data: 0.002509
    data: -0.004784
    data: -0.001294
    data: -0.007221
    data: -0.012109
    data: -0.011930
    data: -0.011670
    data: -0.007522
    data: -0.007698
    data: -0.007578
    data: 0.005410
    data: 0.010278
    data: -0.000565
    data: 0.001325
    data: 0.000149
    data: -0.005896
    data: -0.004846
    data: -0.000009
    data: -0.001019
    data: -0.004910
    data: 0.008462
    data: 0.006819
    data: -0.004430
    data: 0.003282
    data: 0.002419
    data: -0.005354
    data: -0.005794
    data: -0.003186
    data: 0.000305
    data: -0.002552
    data: 0.001695
    data: 0.000333
    data: -0.002890
    data: 0.001631
    data: 0.001420
    data: -0.002778
    data: -0.003261
    data: 0.002448
    data: 0.013739
    data: 0.007370
    data: -0.000119
    data: 0.007977
    data: 0.003900
    data: 0.001987
    data: 0.005442
    data: 0.000241
    data: -0.007632
    data: 0.005003
    data: 0.001387
    data: -0.007488
    data: 0.006593
    data: 0.005186
    data: -0.004119
    data: 0.002843
    data: 0.000913
    data: 0.005504
    data: 0.007240
    data: 0.000176
    data: 0.004458
    data: 0.008909
    data: 0.003346
    data: 0.003240
    data: 0.003248
    data: -0.001493
    data: 0.003659
    data: -0.000249
    data: 0.008287
    data: -0.000479
    data: -0.002718
    data: 0.000841
    data: 0.008128
    data: -0.001951
    data: -0.005587
    data: -0.007237
    data: -0.008249
    data: -0.007040
    data: -0.004564
    data: -0.003165
    data: -0.000607
    data: 0.001651
    data: 0.005537
    data: 0.002057
    data: 0.003262
    data: 0.003401
    data: 0.003597
    data: -0.000677
    data: -0.003436
    data: -0.001485
    data: -0.000871
    data: -0.001638
    data: 0.000660
    data: -0.010283
    data: -0.009447
    data: -0.010726
    data: -0.009800
    data: -0.008531
    data: -0.008381
    data: -0.007072
    data: -0.008239
    data: -0.011313
    data: 0.000937
    data: -0.000148
    data: 0.002505
    data: -0.002601
    data: -0.003608
    data: 0.001428
    data: -0.001076
    data: 0.000904
    data: -0.000329
    data: 0.015691
    data: 0.005553
    data: 0.006247
    data: 0.005474
    data: 0.004128
    data: 0.004660
    data: 0.000291
    data: 0.004177
    data: -0.003965
    data: 0.007995
    data: -0.005759
    data: -0.015279
    data: 0.004777
    data: -0.004819
    data: -0.010357
    data: -0.001043
    data: -0.012957
    data: -0.016896
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: 0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
    data: -0.000000
