name: "24Net"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 24
input_dim: 24
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  blobs {
    data: 0.437248
    data: -0.552477
    data: -0.322165
    data: -0.477984
    data: -0.280752
    data: 0.809440
    data: 0.398663
    data: 1.209498
    data: 1.112535
    data: -1.212613
    data: -1.892516
    data: -0.975502
    data: -2.219022
    data: -1.553099
    data: 0.636540
    data: -1.348647
    data: 0.289201
    data: 1.045061
    data: -1.530407
    data: 0.208409
    data: 2.914520
    data: -3.926624
    data: -0.760846
    data: 2.589272
    data: -2.194267
    data: 1.059342
    data: 2.481836
    data: 0.058392
    data: 0.568778
    data: 0.238469
    data: -0.405664
    data: 0.108203
    data: 0.291726
    data: 0.361669
    data: -0.905801
    data: -0.519001
    data: -0.752487
    data: 0.652092
    data: 0.622262
    data: -1.284599
    data: 0.037317
    data: 1.527854
    data: -0.300955
    data: -0.932463
    data: 0.830709
    data: -1.277318
    data: 0.758813
    data: 0.869967
    data: -2.344231
    data: 0.453841
    data: 1.496586
    data: -1.490361
    data: -0.417119
    data: 1.442235
    data: 0.582853
    data: 0.667075
    data: -0.044361
    data: 0.689352
    data: 0.344939
    data: 0.395747
    data: 0.662801
    data: 0.490160
    data: 0.077626
    data: -0.562821
    data: -0.108417
    data: -0.998860
    data: -1.023496
    data: -1.128430
    data: -1.098893
    data: -1.100058
    data: -1.013377
    data: -1.499078
    data: 0.025052
    data: 0.757156
    data: 0.343143
    data: 0.100375
    data: 0.580408
    data: 0.949659
    data: 0.625524
    data: 1.124042
    data: 1.085770
    data: 0.048426
    data: 0.482245
    data: 0.358129
    data: 0.090450
    data: 0.464787
    data: 0.388079
    data: 0.647378
    data: 1.177619
    data: 1.143202
    data: 1.228494
    data: 1.381045
    data: 1.195711
    data: 0.910238
    data: 0.915992
    data: 0.796709
    data: 0.882616
    data: 1.009870
    data: 0.912812
    data: -1.453145
    data: -2.169422
    data: -1.911586
    data: -0.662169
    data: -1.354696
    data: -1.200023
    data: -1.537165
    data: -2.217391
    data: -2.000694
    data: -0.495226
    data: 0.359598
    data: 1.639093
    data: 0.063848
    data: -1.859348
    data: -0.864993
    data: 1.489910
    data: 1.192651
    data: -0.414606
    data: -0.606630
    data: 0.415160
    data: 1.630370
    data: -0.317932
    data: -2.563958
    data: -1.163196
    data: 1.162814
    data: 0.874615
    data: -0.417343
    data: -0.719734
    data: 0.917471
    data: 1.882076
    data: -0.343273
    data: -2.611186
    data: -0.990426
    data: 0.748348
    data: 0.895017
    data: -0.121692
    data: -0.013892
    data: -1.256958
    data: -0.179034
    data: 1.793535
    data: 1.173566
    data: 0.566404
    data: -0.709979
    data: -0.473303
    data: -1.014342
    data: -0.829173
    data: -2.429748
    data: -0.736394
    data: 1.840496
    data: 0.993080
    data: 0.861914
    data: -0.292456
    data: -0.120110
    data: -0.071315
    data: -2.687525
    data: -5.142717
    data: -1.847850
    data: 1.298176
    data: 0.233402
    data: 1.715011
    data: 1.190267
    data: 1.255999
    data: 2.522635
    data: -0.427488
    data: 0.096312
    data: -0.462757
    data: -0.357611
    data: 0.720282
    data: -0.949809
    data: 0.213642
    data: 0.229827
    data: -0.123577
    data: 1.240465
    data: 1.210003
    data: 0.948906
    data: 0.661275
    data: 1.443708
    data: 0.276163
    data: 0.869197
    data: 0.712105
    data: 1.024813
    data: -1.819369
    data: -0.734965
    data: -0.385439
    data: -1.625438
    data: -0.169688
    data: -0.571892
    data: -1.854952
    data: -0.962639
    data: -0.065612
    data: 0.152207
    data: 0.213160
    data: -0.033890
    data: -0.516203
    data: -1.030462
    data: 1.801128
    data: -1.197023
    data: -1.622973
    data: 2.487327
    data: 0.488889
    data: 0.300947
    data: -0.169224
    data: -0.571866
    data: -1.019384
    data: 1.629818
    data: -1.579086
    data: -1.688344
    data: 2.399025
    data: 1.110418
    data: 1.376837
    data: 0.460894
    data: -1.186731
    data: -0.841559
    data: 1.730639
    data: -2.545493
    data: -1.746406
    data: 2.364254
    data: -0.440021
    data: -0.497168
    data: -0.281297
    data: 0.829964
    data: 1.025617
    data: 0.597550
    data: -0.587590
    data: -0.390722
    data: -0.505773
    data: -0.765242
    data: -0.745992
    data: -0.326837
    data: 1.244275
    data: 1.485388
    data: 0.932283
    data: -0.248705
    data: -0.610000
    data: -0.415387
    data: -0.477483
    data: -0.463944
    data: -0.004321
    data: 0.992846
    data: 1.030571
    data: 0.626202
    data: -0.422255
    data: -1.035097
    data: -0.495922
    data: -0.592816
    data: -0.537564
    data: -0.639847
    data: -0.938901
    data: -0.638925
    data: -0.802983
    data: -0.876716
    data: -0.504908
    data: -0.306218
    data: 1.607750
    data: 1.733387
    data: 1.280126
    data: 1.283462
    data: 1.491776
    data: 1.099340
    data: 1.391425
    data: 1.493526
    data: 1.038728
    data: -0.965501
    data: -1.272604
    data: -0.320159
    data: -0.119417
    data: -0.884852
    data: -0.283196
    data: -0.092961
    data: -1.023925
    data: -0.414860
    data: -0.029420
    data: -0.196951
    data: -0.503286
    data: 0.746982
    data: -0.557210
    data: -1.532281
    data: 1.376935
    data: 1.195488
    data: 0.179065
    data: 0.104242
    data: -0.748843
    data: -1.499376
    data: 0.957805
    data: -0.730731
    data: -2.370002
    data: 1.744878
    data: 1.397398
    data: 0.207248
    data: -1.083590
    data: -2.914763
    data: -3.937082
    data: 1.599441
    data: -1.067459
    data: -2.678502
    data: 3.889768
    data: 3.618965
    data: 2.844991
    data: 0.665805
    data: -0.628143
    data: 0.164047
    data: 0.423545
    data: -0.610874
    data: -0.158228
    data: 0.432816
    data: -0.003140
    data: -0.269917
    data: 1.534202
    data: -1.009798
    data: -1.569920
    data: 1.630707
    data: -0.562901
    data: -1.186565
    data: 1.680725
    data: 0.416896
    data: -0.685430
    data: 2.684569
    data: -0.667902
    data: -3.246440
    data: 2.818207
    data: -0.489846
    data: -2.549868
    data: 2.619637
    data: 0.608784
    data: -1.531236
    data: 1.407612
    data: 0.563640
    data: 0.861307
    data: 1.792603
    data: 1.957324
    data: 0.839601
    data: 2.667181
    data: 1.909784
    data: 1.401264
    data: 1.793406
    data: 0.574860
    data: 1.328140
    data: 0.676213
    data: 0.314333
    data: 0.205426
    data: 0.903427
    data: -0.063438
    data: 0.072292
    data: -2.095062
    data: -2.453392
    data: -0.442634
    data: -1.759379
    data: -1.631035
    data: -0.539553
    data: -2.629793
    data: -2.998435
    data: -2.060361
    data: 1.046912
    data: 1.599733
    data: -0.186345
    data: -1.750192
    data: -0.334290
    data: 0.124085
    data: 0.634519
    data: -0.086795
    data: 0.299371
    data: 0.615275
    data: 1.819411
    data: 0.366445
    data: -3.310553
    data: -1.042429
    data: 0.245790
    data: -0.977012
    data: -0.933094
    data: 0.450253
    data: 4.847539
    data: 5.683537
    data: 4.289145
    data: -4.306818
    data: -1.420344
    data: 1.076229
    data: -3.941755
    data: -3.582466
    data: -0.862929
    data: 1.811499
    data: 2.029848
    data: 0.783512
    data: 1.414761
    data: -0.234393
    data: -1.072966
    data: -1.629080
    data: -2.509015
    data: -0.277147
    data: 2.014589
    data: 1.725302
    data: 0.044058
    data: 1.835701
    data: -0.375912
    data: -1.965122
    data: -0.898390
    data: -2.292405
    data: -1.058602
    data: 6.918104
    data: 4.666981
    data: 1.319806
    data: 3.830895
    data: -0.244095
    data: -3.063408
    data: -3.468123
    data: -4.914742
    data: -3.919534
    data: 1.607327
    data: 0.846578
    data: -1.045928
    data: 0.844824
    data: -0.950730
    data: -1.133939
    data: 0.809035
    data: -0.392132
    data: -1.019555
    data: 2.389962
    data: 1.079307
    data: -1.647109
    data: 1.562776
    data: -0.967024
    data: -1.673423
    data: 1.691345
    data: -0.322732
    data: -1.364855
    data: 4.475574
    data: 1.660408
    data: -2.977811
    data: 2.344985
    data: -1.807418
    data: -3.782222
    data: 2.752349
    data: -0.872260
    data: -2.770351
    data: -3.484224
    data: -1.305612
    data: -2.175893
    data: -2.649533
    data: -1.965189
    data: -1.720330
    data: -1.696293
    data: -1.679197
    data: -1.929183
    data: -0.383292
    data: 1.873463
    data: 1.016663
    data: -0.481355
    data: 0.299591
    data: 0.797888
    data: -0.063739
    data: -0.104017
    data: -0.097426
    data: -2.697508
    data: 0.444690
    data: 0.114344
    data: -3.282233
    data: -1.826602
    data: -0.608968
    data: -3.442429
    data: -3.279431
    data: -2.919669
    data: 2.355049
    data: 2.116436
    data: 1.941518
    data: 1.022737
    data: 0.180479
    data: 1.151328
    data: 0.091877
    data: 0.207606
    data: -0.471892
    data: 1.675915
    data: 1.358291
    data: 1.409465
    data: 0.528025
    data: -0.539089
    data: 0.886325
    data: -0.945411
    data: -0.891077
    data: -1.230381
    data: -1.738069
    data: -1.571161
    data: -1.324574
    data: -0.574058
    data: -1.218613
    data: 0.566363
    data: 0.339206
    data: 0.645522
    data: 0.494267
    data: 2.178436
    data: 1.823451
    data: -0.256098
    data: 1.860446
    data: -0.698722
    data: -1.359695
    data: -0.003664
    data: -1.541729
    data: 0.432055
    data: 1.627757
    data: 0.906294
    data: -2.082034
    data: 1.830052
    data: -1.966161
    data: -3.476177
    data: 0.538635
    data: -2.097271
    data: -0.723882
    data: 2.185242
    data: 2.282207
    data: -0.721641
    data: 2.345988
    data: -0.823507
    data: -3.554595
    data: 1.507959
    data: -0.726616
    data: 0.204784
    data: -1.303088
    data: -0.648088
    data: -0.410885
    data: -0.738086
    data: -0.809344
    data: 0.227329
    data: -0.707008
    data: -0.916867
    data: -0.027714
    data: -0.392728
    data: -0.699255
    data: -0.525564
    data: -0.032780
    data: -1.245860
    data: -0.014755
    data: -0.128061
    data: -1.439139
    data: -0.428766
    data: 1.457241
    data: 1.435342
    data: 0.736599
    data: 1.722418
    data: 0.435968
    data: 0.957833
    data: 1.952582
    data: 0.458607
    data: 0.705368
    data: -0.272508
    data: -0.225696
    data: 0.075324
    data: 0.234952
    data: 0.156456
    data: 0.167849
    data: -0.033309
    data: -0.065916
    data: -0.099292
    data: 0.561716
    data: -0.153862
    data: -0.493400
    data: 0.613021
    data: 0.265329
    data: -0.151608
    data: 0.013548
    data: -0.029010
    data: -0.256151
    data: 1.320790
    data: 0.009616
    data: -1.710659
    data: 0.473538
    data: 0.396454
    data: -1.388090
    data: 0.218101
    data: 0.656547
    data: -0.232992
    data: -0.012569
    data: 0.062927
    data: 0.458024
    data: -0.023848
    data: 0.503716
    data: 1.179190
    data: -0.186479
    data: -0.208115
    data: -0.303461
    data: -0.180785
    data: 0.289218
    data: 0.028869
    data: -0.611571
    data: 0.137518
    data: 0.603106
    data: -1.085769
    data: -0.937068
    data: -1.133390
    data: -0.606030
    data: -0.913997
    data: -1.480787
    data: 0.305012
    data: 0.316561
    data: 0.364604
    data: 0.732315
    data: 0.488823
    data: 0.007069
    data: 0.234853
    data: 0.167019
    data: -0.138290
    data: 0.080109
    data: 0.201807
    data: -0.305960
    data: -0.177830
    data: -0.114459
    data: 0.266059
    data: 0.681636
    data: 0.550791
    data: 0.005557
    data: 0.489664
    data: 0.040738
    data: -0.760638
    data: 0.152159
    data: -0.622536
    data: -0.540492
    data: 0.170056
    data: 0.853255
    data: 1.112268
    data: 0.253758
    data: 0.168131
    data: -0.594982
    data: -0.018062
    data: -0.950762
    data: -1.378001
    data: -0.867013
    data: -1.563414
    data: -0.443716
    data: -0.896321
    data: -0.897581
    data: -0.806534
    data: -0.286406
    data: -0.762575
    data: -1.190409
    data: 1.803158
    data: 1.413975
    data: 3.192499
    data: 1.167843
    data: 1.486699
    data: 2.212622
    data: 2.279495
    data: 2.136206
    data: 2.317613
    data: -1.139584
    data: -1.111114
    data: 0.140015
    data: -1.234556
    data: -0.348253
    data: 0.158402
    data: -0.570425
    data: -0.485390
    data: -0.849073
    data: 1.491176
    data: 0.569048
    data: 0.085694
    data: 3.129352
    data: 2.050566
    data: 0.918903
    data: 1.415587
    data: 1.200534
    data: -0.061387
    data: 1.338165
    data: 1.008047
    data: -0.047407
    data: 2.371053
    data: 2.052501
    data: 0.414818
    data: 0.009889
    data: 0.222171
    data: -1.279859
    data: 1.571046
    data: 1.557618
    data: 1.397001
    data: 2.822709
    data: 2.726784
    data: 2.356452
    data: 3.744335
    data: 3.817454
    data: 3.292876
    data: -1.243443
    data: 0.585557
    data: -0.844798
    data: -0.228225
    data: 0.905313
    data: -0.304342
    data: 0.961975
    data: 1.216322
    data: 1.442120
    data: -0.900684
    data: 1.044644
    data: -0.153388
    data: -0.863966
    data: 0.248360
    data: -0.549352
    data: 0.256721
    data: 0.556580
    data: 1.211482
    data: -0.076579
    data: 1.176421
    data: -0.492330
    data: -2.407854
    data: -2.341650
    data: -3.426437
    data: -1.792988
    data: -3.293364
    data: -2.956909
    data: -0.440995
    data: 0.756917
    data: -0.474147
    data: -0.176130
    data: 0.773515
    data: -0.440122
    data: 0.141730
    data: -0.060283
    data: 0.099441
    data: -0.530040
    data: 1.105238
    data: -0.658962
    data: -0.358222
    data: 1.022490
    data: -0.633929
    data: 0.037197
    data: -0.136879
    data: -0.145653
    data: -1.310356
    data: 1.620053
    data: -0.314051
    data: -0.831236
    data: 1.361659
    data: -0.631974
    data: 0.147655
    data: 0.069862
    data: -0.077637
    data: 0.903920
    data: 0.144122
    data: -0.410552
    data: -0.444967
    data: -0.177532
    data: 0.267651
    data: -0.577007
    data: 0.020609
    data: 0.343031
    data: 0.653566
    data: -0.278849
    data: -0.136394
    data: -0.618949
    data: -0.605745
    data: 0.518370
    data: -0.021850
    data: 0.280228
    data: 0.436071
    data: -1.318168
    data: -1.513862
    data: -0.802199
    data: -1.022808
    data: -0.590033
    data: 0.698701
    data: 1.050718
    data: 1.258362
    data: 1.730639
    shape {
      dim: 28
      dim: 3
      dim: 3
      dim: 3
    }
  }
  blobs {
    data: 0.17818686
    data: -1.42141080
    data: -0.65516728
    data: 3.55196309
    data: -1.44518399
    data: 1.34315062
    data: -0.32474214
    data: 0.69474566
    data: -0.83165348
    data: 1.68668318
    data: 0.08892389
    data: 0.73305690
    data: 4.95462036
    data: 0.17213076
    data: 0.80676806
    data: -0.90513188
    data: -6.70925093
    data: 0.52245814
    data: -0.17777203
    data: -3.51484442
    data: -0.56375587
    data: -1.62620080
    data: -0.60650736
    data: 0.05167315
    data: -1.95048726
    data: -0.63814884
    data: -0.62910044
    data: -0.92773044
    shape {
      dim: 28
    }
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 28
    kernel_size: 3
    stride: 1
     weight_filler {
      type: "xavier"
	}
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "prelu1"
  type: "PReLU"
  bottom: "conv1"
  top: "conv1"
  blobs {
    data: 0.60117036
    data: 7.82325983
    data: 1.40137661
    data: 0.83184278
    data: 4.25333929
    data: -0.30434102
    data: 1.82166922
    data: -1.08160758
    data: 8.34667873
    data: -2.85609007
    data: -0.21730746
    data: -1.13310790
    data: 0.36172289
    data: 0.06383084
    data: -0.92477810
    data: -0.70842034
    data: 1.07675350
    data: 1.08169615
    data: -0.02896804
    data: 1.20598960
    data: 7.19777393
    data: 3.03213048
    data: 6.04501915
    data: 2.16544676
    data: 1.05528390
    data: -0.68490243
    data: 5.27353764
    data: 7.99427080
    shape {
      dim: 28
    }
  }
  propagate_down: true
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  blobs {
    data: -0.996707
    data: 0.326031
    data: 1.045396
    data: -1.615920
    data: -0.833629
    data: 0.593738
    data: -1.425355
    data: -2.689135
    data: -2.060071
    data: -0.177451
    data: -0.424274
    data: 0.039847
    data: 1.543864
    data: 0.018241
    data: -0.095486
    data: 1.567989
    data: 0.777435
    data: 0.241219
    data: -0.386346
    data: 0.604784
    data: 0.446575
    data: -0.299847
    data: -0.207726
    data: 0.058633
    data: -0.544541
    data: -1.065997
    data: -0.779886
    data: -0.157205
    data: -1.999023
    data: -1.357066
    data: 1.419440
    data: -0.890216
    data: -1.723138
    data: 1.409214
    data: -0.631927
    data: -1.417774
    data: 0.289461
    data: 0.319311
    data: 0.385311
    data: 0.665033
    data: -0.112236
    data: 0.749646
    data: 1.352048
    data: 0.134694
    data: -0.180616
    data: 0.027183
    data: 1.491704
    data: 0.185298
    data: -0.385360
    data: 1.017790
    data: 0.352116
    data: -1.948972
    data: -0.108027
    data: 1.031733
    data: 0.628555
    data: -1.108122
    data: -1.909886
    data: 1.674385
    data: -0.126480
    data: -0.588008
    data: 1.863693
    data: -1.045247
    data: -0.205086
    data: -0.618416
    data: 0.291881
    data: -0.621426
    data: -0.407288
    data: 0.899198
    data: -0.890304
    data: 0.650034
    data: 0.169976
    data: -0.302693
    data: -1.293552
    data: 0.051909
    data: 0.043625
    data: -1.741843
    data: -0.045815
    data: 0.351217
    data: -0.694805
    data: 0.198669
    data: -0.140951
    data: -2.610732
    data: 0.398419
    data: 1.197651
    data: -0.358157
    data: -1.107055
    data: 0.322315
    data: 3.202874
    data: -1.713920
    data: -1.167794
    data: -0.172172
    data: 0.495158
    data: -0.341997
    data: 0.030291
    data: -0.050738
    data: 0.653388
    data: 1.751348
    data: 1.368095
    data: 1.715208
    data: 2.180126
    data: -0.834454
    data: -0.043661
    data: 1.300519
    data: -0.683500
    data: -0.151057
    data: 2.822765
    data: -0.043989
    data: -0.713633
    data: -0.383251
    data: -0.672433
    data: 0.075381
    data: 0.049720
    data: -0.716007
    data: 0.203218
    data: 1.539110
    data: -0.710624
    data: -0.409826
    data: -0.465397
    data: 0.872497
    data: 0.043706
    data: -1.088135
    data: -0.674176
    data: 0.324617
    data: 0.214148
    data: -0.344524
    data: 0.647311
    data: -1.662756
    data: 0.684794
    data: -0.204392
    data: -2.398536
    data: 0.291000
    data: -0.922971
    data: -1.380212
    data: -0.826221
    data: -0.139651
    data: -0.785852
    data: 0.102920
    data: 0.621215
    data: -0.644628
    data: -0.211015
    data: 0.321552
    data: -1.091902
    data: -0.459210
    data: 0.511960
    data: 0.256857
    data: -0.755199
    data: -0.727184
    data: 1.733200
    data: -0.257319
    data: -0.823678
    data: 0.944441
    data: -0.348199
    data: -0.268472
    data: -0.224261
    data: -0.158049
    data: 0.499921
    data: -0.104151
    data: -0.287482
    data: 0.464738
    data: 0.087355
    data: -0.271148
    data: -0.644899
    data: 0.990135
    data: 0.149117
    data: -0.000158
    data: 0.643472
    data: 0.301589
    data: 0.709181
    data: -1.144177
    data: -1.047428
    data: -0.844908
    data: -0.424617
    data: 0.201850
    data: 0.126497
    data: -1.689452
    data: -1.027363
    data: -0.307201
    data: -1.579364
    data: -1.326820
    data: -1.266257
    data: -0.135027
    data: 0.469620
    data: 0.132427
    data: 0.609681
    data: 0.574179
    data: 0.563719
    data: 0.714905
    data: 0.843471
    data: -0.341271
    data: -0.166699
    data: 0.349640
    data: 0.741771
    data: -0.057209
    data: 0.362797
    data: 1.080997
    data: -1.485694
    data: -0.254153
    data: -0.906745
    data: -1.073072
    data: -0.200269
    data: -0.349418
    data: -0.996562
    data: -0.034333
    data: -0.722803
    data: 0.637237
    data: -0.491588
    data: -1.498768
    data: -0.229063
    data: -0.843312
    data: -0.980577
    data: 0.600369
    data: 0.281016
    data: -0.117305
    data: 0.772166
    data: -0.015387
    data: -0.307000
    data: -0.150674
    data: -0.092510
    data: 0.525957
    data: -0.374447
    data: -0.099376
    data: 0.458839
    data: -0.572851
    data: -0.451743
    data: -0.071825
    data: -0.170561
    data: -0.223796
    data: 0.554945
    data: 0.611527
    data: 0.011984
    data: -0.018605
    data: -0.571796
    data: -0.815773
    data: -0.340135
    data: 1.541056
    data: -0.261430
    data: 0.280806
    data: 2.039682
    data: 0.145929
    data: -0.042603
    data: 1.178643
    data: -0.808721
    data: -1.215856
    data: -1.431428
    data: -0.364240
    data: -0.131447
    data: -1.003014
    data: -0.256511
    data: 0.202720
    data: -1.884368
    data: -0.821923
    data: -0.227180
    data: 0.647803
    data: 0.276827
    data: 1.217974
    data: -0.072383
    data: 0.240889
    data: -1.041135
    data: 1.528828
    data: 0.887412
    data: -0.727457
    data: -0.271401
    data: -0.100185
    data: 0.127516
    data: -0.133333
    data: -0.092583
    data: 0.777932
    data: -0.400898
    data: -0.187218
    data: 0.675337
    data: -0.728262
    data: -0.307712
    data: -0.578315
    data: -0.601625
    data: -0.910492
    data: -0.962804
    data: -0.989519
    data: -2.039749
    data: -1.379447
    data: -1.498078
    data: -1.461593
    data: 0.123743
    data: 0.935446
    data: -0.432557
    data: -0.354221
    data: -1.031510
    data: -1.648341
    data: 0.035416
    data: -0.186603
    data: -0.290771
    data: 0.373734
    data: -0.243947
    data: 0.013739
    data: -0.203234
    data: -0.440524
    data: 0.206548
    data: 0.887515
    data: 0.032295
    data: 0.708375
    data: -0.240886
    data: -0.793876
    data: 0.118427
    data: -0.212272
    data: -0.027635
    data: -0.818199
    data: -0.611898
    data: 2.870101
    data: 0.136129
    data: -0.000724
    data: 2.699227
    data: 0.070546
    data: -0.858184
    data: 0.745737
    data: -0.178308
    data: 0.163231
    data: -0.402113
    data: 0.198458
    data: -0.170022
    data: -1.003946
    data: 0.123532
    data: 0.418312
    data: -0.087618
    data: 0.457316
    data: -0.144246
    data: 0.434900
    data: -0.385878
    data: 0.119193
    data: 0.198845
    data: -0.390926
    data: -0.104274
    data: 0.014460
    data: -0.041460
    data: 0.071495
    data: -0.642976
    data: -0.056812
    data: -1.747877
    data: 0.138859
    data: 1.401558
    data: -0.327336
    data: -1.031838
    data: -0.040385
    data: -0.177052
    data: -0.026067
    data: -0.627523
    data: 0.164899
    data: 0.344523
    data: 0.471555
    data: 0.536353
    data: 0.004386
    data: -1.052375
    data: 0.560191
    data: 1.714227
    data: 0.934465
    data: -1.056764
    data: 0.150709
    data: -0.190259
    data: -2.165223
    data: -0.843839
    data: 0.116560
    data: 0.598747
    data: -1.306726
    data: -0.650150
    data: 0.394650
    data: -1.007985
    data: -0.175785
    data: -1.433746
    data: 0.018189
    data: 0.711715
    data: 1.107450
    data: 0.331080
    data: -0.132033
    data: 0.155648
    data: -0.428460
    data: 0.516788
    data: 0.613432
    data: 0.351344
    data: -0.574861
    data: 0.109191
    data: -0.116448
    data: -0.046678
    data: 0.050407
    data: 0.364420
    data: -0.440989
    data: 0.485476
    data: 0.813216
    data: -0.741355
    data: 0.121303
    data: -1.841132
    data: 0.437103
    data: 0.716321
    data: -1.821923
    data: -0.796243
    data: 0.963500
    data: -0.851569
    data: 0.500563
    data: -0.809632
    data: -0.247618
    data: 0.553477
    data: -0.066936
    data: -0.467121
    data: 0.672920
    data: -0.635873
    data: -0.613046
    data: -0.260430
    data: -0.355707
    data: 0.484170
    data: 0.167622
    data: 1.171642
    data: -0.559955
    data: -1.026150
    data: -0.808690
    data: -1.462534
    data: -1.423496
    data: -1.358503
    data: 1.123149
    data: 0.481322
    data: 0.186688
    data: -0.195973
    data: 0.722640
    data: -0.219273
    data: 0.431509
    data: 0.750753
    data: -0.681387
    data: 0.178363
    data: -1.613562
    data: -1.073567
    data: -1.664838
    data: -0.592337
    data: -0.432491
    data: -0.797510
    data: 1.235376
    data: -0.740594
    data: 0.142546
    data: -0.720101
    data: 0.093987
    data: 1.998710
    data: -0.952376
    data: 0.083317
    data: 1.046766
    data: -0.228160
    data: -0.255789
    data: -0.373141
    data: -0.450803
    data: -0.876886
    data: 0.691851
    data: -0.768867
    data: 0.586375
    data: 1.107149
    data: 1.731629
    data: 1.241238
    data: -0.188206
    data: -0.562693
    data: -0.884390
    data: 0.054927
    data: 0.468132
    data: -1.391633
    data: 1.114183
    data: 0.543991
    data: -0.042497
    data: 0.296053
    data: -0.580248
    data: -0.604078
    data: -2.492995
    data: -1.415135
    data: 0.543315
    data: 0.448671
    data: -0.323405
    data: 0.211024
    data: 0.091827
    data: -0.627024
    data: -0.066965
    data: 1.283279
    data: 0.120465
    data: 0.627683
    data: 0.252999
    data: -0.183674
    data: -0.066129
    data: -0.174899
    data: 1.345447
    data: -0.625867
    data: -0.107117
    data: 0.296957
    data: -1.083330
    data: 0.304747
    data: 0.132437
    data: -0.068043
    data: 1.866774
    data: -0.280320
    data: 1.804895
    data: -1.820085
    data: -0.013967
    data: -1.259446
    data: -0.601289
    data: 1.152209
    data: 0.699428
    data: 0.424235
    data: 0.144122
    data: 0.044122
    data: -0.087172
    data: -0.300376
    data: -0.170987
    data: -0.194114
    data: -0.307879
    data: -0.375221
    data: -2.205103
    data: -1.760127
    data: -2.612392
    data: 0.114018
    data: -0.893611
    data: -2.154712
    data: -1.271975
    data: 0.648522
    data: -0.158819
    data: -0.186966
    data: -0.458129
    data: -0.180043
    data: -0.285733
    data: -0.891710
    data: -1.091480
    data: 0.219218
    data: 0.189270
    data: -0.107937
    data: 0.173852
    data: 0.273280
    data: 0.333004
    data: -0.415617
    data: -0.329420
    data: -0.268384
    data: -0.052421
    data: 0.195082
    data: 0.051936
    data: 2.498487
    data: -0.404425
    data: 2.357952
    data: -0.082064
    data: -1.480162
    data: 0.707193
    data: -0.687280
    data: -1.068821
    data: -0.676859
    data: 0.089650
    data: 0.105490
    data: -0.386218
    data: 0.750289
    data: -0.083819
    data: -0.785363
    data: 0.359107
    data: -0.667720
    data: 0.925456
    data: -0.065516
    data: 0.477195
    data: -0.079553
    data: -0.178823
    data: -1.127725
    data: -1.205019
    data: 0.531180
    data: -1.622083
    data: 0.108557
    data: 1.406009
    data: 0.063405
    data: 0.262387
    data: 0.541988
    data: -1.181897
    data: -1.113792
    data: 0.046174
    data: 0.463838
    data: 1.056179
    data: -1.948127
    data: -1.281950
    data: 0.010629
    data: -0.012421
    data: -0.841712
    data: -1.714472
    data: 0.681986
    data: 1.379193
    data: -0.538405
    data: -0.552224
    data: -0.057974
    data: -0.539987
    data: 0.368163
    data: -0.094838
    data: 1.151367
    data: 1.707573
    data: -0.727605
    data: 0.863701
    data: 1.205989
    data: -1.381765
    data: -0.210985
    data: 0.432954
    data: -1.123276
    data: 0.230413
    data: -0.241034
    data: -0.196536
    data: 0.228908
    data: 0.382297
    data: -0.133340
    data: 0.443383
    data: 0.361128
    data: -2.207881
    data: 0.490353
    data: 0.001566
    data: -0.425020
    data: 0.923464
    data: -0.124604
    data: -0.612741
    data: -1.309070
    data: 0.381025
    data: 0.095754
    data: -0.557156
    data: -1.896586
    data: -0.452889
    data: -0.234660
    data: 0.951906
    data: -2.519889
    data: -0.554586
    data: -0.822777
    data: -1.811992
    data: 0.639049
    data: 0.915960
    data: 0.768824
    data: 1.423388
    data: -1.707405
    data: 0.310079
    data: 0.743675
    data: -0.040212
    data: 0.735961
    data: 0.912032
    data: 0.961378
    data: -0.209348
    data: 0.772205
    data: 0.493833
    data: 0.402415
    data: 0.759824
    data: 0.962283
    data: -0.394537
    data: 0.607475
    data: 0.383180
    data: -0.130240
    data: -0.181421
    data: 1.028765
    data: -1.491839
    data: -0.695660
    data: 0.028401
    data: 0.483959
    data: 0.414676
    data: -0.007411
    data: 0.820995
    data: 0.542867
    data: 0.621616
    data: 0.278611
    data: -0.094711
    data: 0.244046
    data: -0.512917
    data: -0.868078
    data: -0.260457
    data: 0.343432
    data: -0.029202
    data: 1.492673
    data: 0.893124
    data: 1.706171
    data: -1.135374
    data: -1.718190
    data: -0.644313
    data: 0.558324
    data: 1.198688
    data: 1.441011
    data: 0.467749
    data: -1.347034
    data: -1.641323
    data: -1.295267
    data: -1.417815
    data: -0.053728
    data: -0.479957
    data: -0.139500
    data: 0.760985
    data: -1.364283
    data: 0.183171
    data: -0.285510
    data: 1.205829
    data: 1.597185
    data: 1.655907
    data: 1.095269
    data: 0.830021
    data: 1.013094
    data: -1.230002
    data: -0.933552
    data: -0.868772
    data: -1.309104
    data: -1.530841
    data: -1.859590
    data: -0.282466
    data: -0.206757
    data: -0.484867
    data: 1.380697
    data: 1.021569
    data: 1.791961
    data: 0.536716
    data: -0.822963
    data: 0.487998
    data: 0.002338
    data: -0.664631
    data: 0.990951
    data: 0.750592
    data: -0.312215
    data: -1.012216
    data: -0.490422
    data: 0.219066
    data: -0.048180
    data: 2.447175
    data: 2.304521
    data: 3.465392
    data: 0.240587
    data: -1.081568
    data: 1.069205
    data: -0.132991
    data: -1.287627
    data: -0.117714
    data: 0.038905
    data: 0.469136
    data: -0.701031
    data: 0.481116
    data: 0.263761
    data: 0.041655
    data: 0.000495
    data: -0.776878
    data: -0.412063
    data: -0.087630
    data: -0.281745
    data: -0.249715
    data: 0.944912
    data: 0.072180
    data: 0.731850
    data: -0.144366
    data: -0.983852
    data: -0.515860
    data: 0.290143
    data: -0.132330
    data: -0.140155
    data: 0.761176
    data: 0.795579
    data: 0.369204
    data: -1.049445
    data: -0.161786
    data: -1.040341
    data: -0.826582
    data: 0.322295
    data: 0.179197
    data: -0.651189
    data: -0.122674
    data: 0.053452
    data: -0.431213
    data: -0.650509
    data: 0.057408
    data: 0.474209
    data: -0.186838
    data: 0.208583
    data: 0.010245
    data: -0.276560
    data: 0.236487
    data: -0.000292
    data: -0.548384
    data: -1.427519
    data: -0.869897
    data: -0.047866
    data: -0.164142
    data: 0.116800
    data: 0.830284
    data: 0.495431
    data: -0.630342
    data: -0.263797
    data: 0.102661
    data: 0.380884
    data: -0.122753
    data: -0.144135
    data: 0.923982
    data: 0.085450
    data: 0.067988
    data: 0.419951
    data: 0.531834
    data: 0.464385
    data: 0.596554
    data: 0.982141
    data: 1.139101
    data: 1.064593
    data: -0.489793
    data: -1.168242
    data: 0.234311
    data: -0.236248
    data: 0.162223
    data: 1.097704
    data: 0.774337
    data: 1.577178
    data: 0.732210
    data: 0.728666
    data: 0.096731
    data: -0.197267
    data: 0.270377
    data: 0.392219
    data: 0.417376
    data: 0.150122
    data: 0.329273
    data: 0.339002
    data: 0.247329
    data: 0.519556
    data: -0.122960
    data: 0.214468
    data: 0.168017
    data: -1.038193
    data: -0.679697
    data: -0.150717
    data: 0.513012
    data: 0.061241
    data: 0.326915
    data: 0.086761
    data: -0.277944
    data: -0.272510
    data: 0.724680
    data: 0.719129
    data: -1.222083
    data: -0.560894
    data: 0.089116
    data: 0.611606
    data: -0.829344
    data: 0.059801
    data: 0.010838
    data: 0.707630
    data: -0.167889
    data: 1.393936
    data: -0.056660
    data: -0.524940
    data: -0.027916
    data: -0.490015
    data: 0.065027
    data: -0.763640
    data: 1.326719
    data: 0.247009
    data: -1.059272
    data: 0.997665
    data: 0.339811
    data: 1.316182
    data: -0.191215
    data: -0.624828
    data: 0.335264
    data: 0.200461
    data: -0.728538
    data: 0.248100
    data: 0.703214
    data: 0.393640
    data: 1.408702
    data: 0.163285
    data: 0.623950
    data: 1.933114
    data: 0.615952
    data: 0.253787
    data: 0.700585
    data: -0.035489
    data: -0.238529
    data: 1.290831
    data: -0.889760
    data: -1.819770
    data: 0.858211
    data: 0.434242
    data: -0.941879
    data: -0.339338
    data: 0.495745
    data: -1.216904
    data: -1.561483
    data: -0.708749
    data: -0.620857
    data: 0.760816
    data: 0.004013
    data: -0.455012
    data: 1.289804
    data: 1.073447
    data: 0.035272
    data: 0.823545
    data: 1.155848
    data: -0.143490
    data: -0.111257
    data: 0.979371
    data: -0.597105
    data: 0.216811
    data: 0.156640
    data: -0.888894
    data: -1.387586
    data: -0.414120
    data: -0.039500
    data: -1.795904
    data: -0.206623
    data: -0.624578
    data: -0.691002
    data: -1.617603
    data: -1.930548
    data: -0.992159
    data: -1.072664
    data: 0.276900
    data: 0.134912
    data: -1.030422
    data: 0.461344
    data: 0.324807
    data: 0.803001
    data: -0.561246
    data: -0.010812
    data: 0.178251
    data: 0.672128
    data: 0.299667
    data: 0.205136
    data: 0.284275
    data: 0.400486
    data: 1.142976
    data: 0.292234
    data: -0.652153
    data: -0.816259
    data: -0.524231
    data: -0.539518
    data: -1.198764
    data: -1.101590
    data: -0.119385
    data: -0.075825
    data: -0.563000
    data: -0.763423
    data: -0.935503
    data: -0.031229
    data: -1.282507
    data: 0.261395
    data: 0.222964
    data: 0.333026
    data: -2.727062
    data: -2.065199
    data: 0.091818
    data: 1.377223
    data: -1.899928
    data: -0.858182
    data: 1.616810
    data: -0.287349
    data: 0.145254
    data: -0.393161
    data: -0.102896
    data: -0.107687
    data: 0.944923
    data: 0.748663
    data: 2.838948
    data: -0.477367
    data: -0.018512
    data: 1.167680
    data: 1.091111
    data: 0.748702
    data: 0.553222
    data: 0.030913
    data: 0.030785
    data: 0.407859
    data: 0.268453
    data: 0.732021
    data: 0.702426
    data: -1.009817
    data: 0.664718
    data: 0.021260
    data: -0.587579
    data: -0.544460
    data: 0.840688
    data: 1.026263
    data: -0.714834
    data: -0.830884
    data: 0.654764
    data: 0.378309
    data: 1.521811
    data: -0.391525
    data: -1.049231
    data: 0.347790
    data: -0.271927
    data: -0.170704
    data: -0.766735
    data: 0.229018
    data: 0.362820
    data: -0.068283
    data: 0.596266
    data: 0.537410
    data: 0.281492
    data: 0.204058
    data: 0.233365
    data: 0.258107
    data: 0.408672
    data: 0.447727
    data: -1.583119
    data: -0.277940
    data: 0.768431
    data: 0.625024
    data: -0.801778
    data: 0.072056
    data: 0.913244
    data: -1.388571
    data: -1.071636
    data: -1.418347
    data: -2.200577
    data: -1.976670
    data: -1.890347
    data: -1.540009
    data: 0.113809
    data: -0.730733
    data: -0.296207
    data: 0.115293
    data: -0.525671
    data: -0.817628
    data: -0.574475
    data: -0.798208
    data: -0.556513
    data: 0.312266
    data: -0.254114
    data: -0.641614
    data: -1.155022
    data: -0.199999
    data: 0.563839
    data: 0.503581
    data: 0.253383
    data: -0.139463
    data: 0.751839
    data: 0.909384
    data: -0.377858
    data: 0.288181
    data: -0.473949
    data: -0.208134
    data: 0.423993
    data: 0.825307
    data: -0.041462
    data: 0.074057
    data: 0.386154
    data: 0.127072
    data: -0.101570
    data: -0.845594
    data: 0.258891
    data: 0.134999
    data: -0.662317
    data: 0.449304
    data: 0.268691
    data: -0.074366
    data: 2.136016
    data: 0.178639
    data: -0.133308
    data: -0.254924
    data: -1.689000
    data: -1.943345
    data: 0.478498
    data: 0.483309
    data: 0.416895
    data: 1.384452
    data: 0.356344
    data: -0.872177
    data: 0.710603
    data: -0.278032
    data: -0.331147
    data: 1.095339
    data: -0.629147
    data: -0.627103
    data: 0.013901
    data: 0.332188
    data: -0.026466
    data: 0.593563
    data: 0.141828
    data: 0.151907
    data: 1.051234
    data: -0.441345
    data: 0.018066
    data: 0.744824
    data: -0.024638
    data: 0.726807
    data: 0.521028
    data: -0.346236
    data: -0.933888
    data: 0.220175
    data: -0.603242
    data: -0.898697
    data: -0.807440
    data: 0.320418
    data: 1.618540
    data: 0.429685
    data: -0.328930
    data: 0.405659
    data: 0.022086
    data: -0.094325
    data: 1.411779
    data: 1.210980
    data: -0.472544
    data: -0.414526
    data: 2.144437
    data: -0.461716
    data: -0.460535
    data: 0.570596
    data: -0.438036
    data: -0.566451
    data: -0.570171
    data: -1.387545
    data: -2.611813
    data: 0.340712
    data: 0.757111
    data: 0.450479
    data: -0.556795
    data: 0.105855
    data: 0.658328
    data: 0.136026
    data: 0.490351
    data: -0.151680
    data: 0.394432
    data: 0.951051
    data: -0.561182
    data: 0.115185
    data: -0.647765
    data: -0.521086
    data: -0.628153
    data: -0.578057
    data: -0.247395
    data: -0.826290
    data: -0.541623
    data: -0.658214
    data: -0.571641
    data: -1.707038
    data: -1.702608
    data: -1.412684
    data: -0.887549
    data: -0.764004
    data: -2.010309
    data: -1.375829
    data: -0.456781
    data: 0.506428
    data: 1.485443
    data: 1.524860
    data: 0.740047
    data: 1.257097
    data: 0.402732
    data: 0.358413
    data: -0.633111
    data: -0.035839
    data: 0.435689
    data: -0.019156
    data: 0.029541
    data: 0.247374
    data: -0.586939
    data: 0.230396
    data: -0.131571
    data: -0.079289
    data: -0.759462
    data: -0.349492
    data: -0.097795
    data: 0.214169
    data: 0.477094
    data: -0.671335
    data: -0.751485
    data: 0.177351
    data: -0.430255
    data: 0.307791
    data: -0.472727
    data: 0.103318
    data: 1.405137
    data: -0.490945
    data: 0.144178
    data: -0.072283
    data: -0.568785
    data: 0.498521
    data: 0.440048
    data: -0.003288
    data: 0.108530
    data: 0.089712
    data: 0.623222
    data: 0.588128
    data: -1.692410
    data: 0.251416
    data: -0.175314
    data: -0.381935
    data: -0.521842
    data: -0.213494
    data: -0.938537
    data: -2.057297
    data: -0.965462
    data: -2.818533
    data: 0.065471
    data: 0.193253
    data: -1.520804
    data: 0.085055
    data: -0.166506
    data: 0.060984
    data: -1.143893
    data: 0.523022
    data: 0.292070
    data: -1.705125
    data: -1.013504
    data: -1.691543
    data: -1.224531
    data: -0.917156
    data: -0.821152
    data: 0.100414
    data: 0.311382
    data: 0.207970
    data: -0.746512
    data: 0.353674
    data: 0.314005
    data: -0.557665
    data: 0.376250
    data: 0.639040
    data: 0.562056
    data: -0.125159
    data: -0.487073
    data: 0.733581
    data: -0.468007
    data: -0.633758
    data: 0.567466
    data: -0.745179
    data: -1.448280
    data: 1.155811
    data: -0.547898
    data: -0.565030
    data: 0.965900
    data: -0.172763
    data: 0.189425
    data: -0.029631
    data: 0.409986
    data: -0.199765
    data: -0.739587
    data: -1.012975
    data: -1.467999
    data: -0.473295
    data: -0.018674
    data: -0.042344
    data: 0.268236
    data: 0.834732
    data: 0.571122
    data: 0.129795
    data: 0.511711
    data: 0.491042
    data: -0.122467
    data: -0.026258
    data: -0.037985
    data: -0.137245
    data: 0.077542
    data: -0.252535
    data: -0.307674
    data: 0.187178
    data: -0.824143
    data: -0.378732
    data: -0.262095
    data: -0.547385
    data: -0.093745
    data: 0.281956
    data: 0.397312
    data: -2.242402
    data: -1.465475
    data: -0.693006
    data: 0.459134
    data: 0.011686
    data: -0.690388
    data: 0.908924
    data: 0.698046
    data: 1.581980
    data: -0.420156
    data: -0.069709
    data: -0.399986
    data: -0.048608
    data: -0.084383
    data: -0.294506
    data: 1.485957
    data: 1.116797
    data: -0.647475
    data: -0.183635
    data: 0.152788
    data: 0.693002
    data: 0.656549
    data: -0.942068
    data: 0.713782
    data: 0.074611
    data: -1.092619
    data: 0.439114
    data: -0.034587
    data: 0.499450
    data: -0.686641
    data: 0.973611
    data: -0.614294
    data: 0.409558
    data: 0.382325
    data: -0.175168
    data: -0.138751
    data: 0.240686
    data: 1.308288
    data: 1.221852
    data: 0.469550
    data: 1.359607
    data: 1.029358
    data: 0.857178
    data: 1.127597
    data: 1.103967
    data: -0.800354
    data: 1.019340
    data: 0.876148
    data: 0.172622
    data: 0.366965
    data: 1.178799
    data: 0.120621
    data: 0.664118
    data: 1.672051
    data: -1.031838
    data: 0.090721
    data: -1.557030
    data: -0.780465
    data: -0.389084
    data: -0.815971
    data: -0.274775
    data: -0.499346
    data: -0.098886
    data: -0.781645
    data: 0.362276
    data: 0.063363
    data: 0.644992
    data: 0.301503
    data: -1.119410
    data: -1.051463
    data: -0.180941
    data: 0.145103
    data: 1.255893
    data: 1.672644
    data: -1.096426
    data: 0.453071
    data: -0.442938
    data: -1.887225
    data: 0.920370
    data: 0.259472
    data: -1.863763
    data: 1.130109
    data: 0.411158
    data: 0.419597
    data: 0.053983
    data: 1.460539
    data: 0.448341
    data: 1.174616
    data: 0.647138
    data: 0.648375
    data: -1.828552
    data: 0.445557
    data: 0.460129
    data: -0.916376
    data: -0.099678
    data: 0.234124
    data: -0.598636
    data: 0.360746
    data: 0.581603
    data: 2.468194
    data: -0.546222
    data: -0.430261
    data: 0.130081
    data: -0.970326
    data: -0.247115
    data: 0.001480
    data: 0.273990
    data: 0.636652
    data: -2.428693
    data: 0.454554
    data: -0.153927
    data: -0.581196
    data: 0.343331
    data: -0.162839
    data: 0.041840
    data: -0.344341
    data: 0.542056
    data: -1.219106
    data: -1.731303
    data: -2.301957
    data: 0.631132
    data: -0.305474
    data: -1.229967
    data: 0.485759
    data: 0.623926
    data: -0.270101
    data: -0.968358
    data: -1.253689
    data: 0.687728
    data: -1.130038
    data: -1.748870
    data: -0.667209
    data: 0.727071
    data: -0.141485
    data: 0.785166
    data: -3.509195
    data: -1.721063
    data: -0.368304
    data: -2.959963
    data: -0.298733
    data: -1.383457
    data: -2.089770
    data: 0.509950
    data: -1.042114
    data: -0.157239
    data: 0.123838
    data: -0.394844
    data: -1.305850
    data: -0.398660
    data: 0.325347
    data: -0.297781
    data: 0.063741
    data: 0.446876
    data: 1.030796
    data: 0.110844
    data: 1.152417
    data: 0.804329
    data: -0.679249
    data: 0.028919
    data: 0.178157
    data: -1.470794
    data: -0.309901
    data: 0.526300
    data: 0.541736
    data: -0.577381
    data: 0.225486
    data: 0.334958
    data: -0.651313
    data: 0.445807
    data: 0.249356
    data: 0.649410
    data: 1.371049
    data: 0.714319
    data: 0.401101
    data: -0.237173
    data: -0.304598
    data: -0.817224
    data: -0.042574
    data: -0.062790
    data: -1.246422
    data: 0.838526
    data: 0.323123
    data: 1.326391
    data: 0.325419
    data: 1.117496
    data: 0.767487
    data: 1.478297
    data: -0.207973
    data: 1.108163
    data: -0.835642
    data: -1.723094
    data: -0.198563
    data: -1.281524
    data: -0.372344
    data: 1.442677
    data: 1.160477
    data: -0.532981
    data: -1.051031
    data: 1.581033
    data: 0.221789
    data: -1.622874
    data: -1.194215
    data: -0.757915
    data: -1.096743
    data: -0.749107
    data: 0.444126
    data: -0.060032
    data: -1.252061
    data: 0.855365
    data: -0.627814
    data: -0.647986
    data: -0.527841
    data: -0.191340
    data: -0.365808
    data: 0.064227
    data: 0.470859
    data: 2.675524
    data: 2.580114
    data: -0.914447
    data: 1.510620
    data: 0.207853
    data: 1.470847
    data: 0.292315
    data: -0.626504
    data: 0.793909
    data: 1.203263
    data: 0.632227
    data: 0.327011
    data: 0.658578
    data: 0.053137
    data: 0.580235
    data: 0.690881
    data: -1.488375
    data: -1.848899
    data: 0.309887
    data: -0.179664
    data: 0.344877
    data: -0.547225
    data: 0.353404
    data: 0.445285
    data: -0.510654
    data: -0.173738
    data: 1.049856
    data: -2.468341
    data: 0.823144
    data: -0.236017
    data: 0.677812
    data: 0.685527
    data: -0.978657
    data: 1.206482
    data: -0.005888
    data: 0.194485
    data: -0.477204
    data: 0.804753
    data: -1.599711
    data: 0.283275
    data: 0.097123
    data: -1.807786
    data: 1.762503
    data: -0.755472
    data: -1.365608
    data: -0.278982
    data: 1.900412
    data: 0.697179
    data: 1.496114
    data: 0.699974
    data: 0.459180
    data: 0.801277
    data: 0.432895
    data: 0.285443
    data: 0.378837
    data: 0.341047
    data: 0.440611
    data: -0.167456
    data: 0.510686
    data: 0.118431
    data: -2.842214
    data: -2.111596
    data: -0.591720
    data: -0.181526
    data: -0.292126
    data: 0.291017
    data: -0.130410
    data: -0.305965
    data: -0.091060
    data: 0.210156
    data: -0.219664
    data: -0.602954
    data: 0.728479
    data: 0.405062
    data: 0.270922
    data: -0.046693
    data: -0.284505
    data: -0.370915
    data: -0.885351
    data: -0.833970
    data: -1.045203
    data: -0.451068
    data: -0.894229
    data: -0.100531
    data: -1.506564
    data: -2.778708
    data: 0.080748
    data: -0.876070
    data: -1.797678
    data: 0.390275
    data: 0.806807
    data: 0.470451
    data: 0.834832
    data: -0.475489
    data: 0.143380
    data: -0.348024
    data: 0.463080
    data: -0.535676
    data: -0.480624
    data: 1.173037
    data: 0.175230
    data: 0.663206
    data: -0.649872
    data: -0.079853
    data: -0.077690
    data: 0.471311
    data: 0.993684
    data: 0.232836
    data: -0.359108
    data: -0.493972
    data: -0.050679
    data: 0.304661
    data: -0.774684
    data: 0.009171
    data: 1.114950
    data: 0.649168
    data: 1.390352
    data: 0.017961
    data: -0.136453
    data: 0.480349
    data: -0.355836
    data: 0.452027
    data: 0.858828
    data: -0.969626
    data: -1.853930
    data: -1.451979
    data: 0.883334
    data: 0.568972
    data: 0.251571
    data: -0.112696
    data: -0.505513
    data: 0.260250
    data: 1.096470
    data: 0.991579
    data: 1.234619
    data: 0.787343
    data: 0.899797
    data: -0.457929
    data: 0.373114
    data: 0.172963
    data: -0.138224
    data: -0.592116
    data: -2.558631
    data: -1.901639
    data: -0.628643
    data: -0.549041
    data: -0.021749
    data: 0.287942
    data: 0.432605
    data: -1.180181
    data: 1.406916
    data: -0.746400
    data: -0.155574
    data: 0.775596
    data: 0.268636
    data: -0.042438
    data: 0.928472
    data: 0.255634
    data: -0.326426
    data: 1.517769
    data: -0.847970
    data: -0.753948
    data: 0.768530
    data: 0.437294
    data: -0.033906
    data: 0.221237
    data: -1.197656
    data: 0.573172
    data: -0.039951
    data: -2.264373
    data: -0.159568
    data: -0.523276
    data: -0.184812
    data: 0.111954
    data: 0.360054
    data: 0.028055
    data: -0.476970
    data: 0.434178
    data: 0.283419
    data: -0.230793
    data: 0.287193
    data: 0.110296
    data: -0.188801
    data: -0.429543
    data: 0.120627
    data: 0.027258
    data: -0.163638
    data: 0.479748
    data: 0.840711
    data: 0.324667
    data: -0.624002
    data: 0.281698
    data: -0.155028
    data: -0.117409
    data: 0.137897
    data: -1.478109
    data: -1.053201
    data: 0.794785
    data: -0.698626
    data: -0.574915
    data: -0.733987
    data: -0.441148
    data: -0.798660
    data: 0.004671
    data: 0.775824
    data: 0.575943
    data: 0.280595
    data: -0.377743
    data: 0.274177
    data: -0.805147
    data: 0.526908
    data: -0.170560
    data: 0.005849
    data: 0.493135
    data: -0.263621
    data: -0.012151
    data: 0.218409
    data: -0.157251
    data: -0.482863
    data: 0.856326
    data: 0.371583
    data: 0.102805
    data: -2.097971
    data: -0.692882
    data: -0.040945
    data: -1.069926
    data: -0.210955
    data: -0.604776
    data: -1.543017
    data: -0.124845
    data: -0.527341
    data: -1.719206
    data: -0.241045
    data: -0.221183
    data: -0.363301
    data: -0.046465
    data: -0.161037
